/**
** 全局解释文字
 * **/

export const expsV2  =  [
    {
        x: "111111",
        e: {
            原: "乾：元亨利贞",
            象: ["天行健，君子以自强不息。"],
            彖: ["大哉乾元，万物资始，乃统天。云行雨施，品物流形。大明终始，六位时成，时乘六龙以御天。乾道变化，各正性命，保合太和，乃利贞。首出庶物，万国咸宁。"],
            析: "“天行健”，一言以断定乾天全卦之德。行者运也，讲也，为也，往也，道也；\n" +
            "谓天道运行，犹如太阳日日运行，循环不息，无一刻之停止也。君子体天行之刚健，天理浑然，无一毫人欲之间，自强不息，自足当天下万般之事业。然此自强者，亦非暴戾猛进而不知止，妄用健强之谓也。玩索“潜龙”、“亢龙”及用九“无首”之辞，而可知其义也。"
            ,
            占:
            "○　得此卦者，要临事刚健，自强不息，犹天行也。又要包括“元亨利贞”之四德。乾有施德而不计利之意。\n" +
            "【女子】筮得此卦，以阴居阳，有刚强过中之嫌。宜慎重也。\n" +
            "【天候】二三四五之中，变则必晴也。\n" +
            "【买卖】不利买而利卖也。\n" +
            "【祸福】谓积善余庆，积不善余殃，恐有不在当代而在后裔也。\n" +
            "【常人】有高其身而不知鄙事之虞。\n" +
            "【贤者】有知天命而独行是道，恐群阴潜伏，有群小构谗之惧。"
        }
        ,
        ye: [
            {
                原: "初九：潜龙勿用",
                象: ["潜龙勿用，阳在下也。"],
                析: "初九以阳居阳。龙之为物，神灵不测，能大能小，能飞能潜，应时而变化者也。爻之取象于龙者，以喻人具灵明之德，变通之才也。“潜龙勿用”四字，周公所系，谓之爻辞，以下仿之。“潜”者隐伏之称，此爻在纯乾之时而居最下，未得遽用，犹龙之时运未来，而隐伏于深渊也，故谓之“潜龙勿用”。占得此爻者，以不得其时，虽有才德，未可进用也。然龙之潜，非终于潜者也；“勿用”者，非竟不用也。龙有神灵之作用，不得其时，蛰而不腾，潜而不现，寂然以养其心神，君子亦待时而动，善成其用。当此勿用之时，晦其才，韬其德，不干进而取祸，亦不迟疑而失机，乐天知命，俨如神龙之蛰而待伸也。盖天地之气有升降，君子之道有行藏，孔子曰“舍之则藏”，正得此卦之旨也。若以小事筮得此卦，宜用妇人而成事，盖以此爻变则为《姤》［4］，《姤》以“女壮”故也。"
                ,
                占:
                "【问战征】乾为武人，有战征之象。初爻阳气始动于黄泉，犹是潜伏，故曰“潜龙”。在军事，为威令初发，大军未集，宜按兵以待也。吉。\n" +
                "【问营商】龙而潜，曰“勿用”，虽是一种好贸易，只可株守，未可骤动也。\n" +
                "【问功名】龙本飞腾发达之物，初爻曰潜，是未得风云之会也。故曰位在下也。\n" +
                "【问婚姻】《乾》初变《姤》，《姤》曰“女壮，勿用娶女，”是宜戒之。\n" +
                "【问家宅】按震为龙，震在东方，是宅之东，必有渊水，闭塞不济，宜修凿之。\n" +
                "【问六甲】生男。"
            },
            {
                原: "九二：见龙在田，利见大人",
                象: ["见龙在田，德施普也。"],
                析: "此爻阳处二位，故曰九二，阳气发现，有龙出渊，现于地上之义也。在圣人，潜不终潜，有屈而将伸之机。曰“在田”，盖有其德，而犹未居其位也。“大人”者，以其有人君之德，故称大人。此爻变则为《离》，《离》文明之象，卦变为《同人》，以文明之人而与人同，故曰“利见大人”。盖刚健者，性之德；文明者，学之成；中者居之宜；正者位之得。然有其德，而犹不自以为足，欲见九五之大人，盖期勉进其见识，相与赞成天下事业，是龙德始见于世，立身显名之时也。五者君上之定位，二者臣下之定位，此卦二五皆以阳刚相应者，盖有故也。《乾》之为卦，其体则纯阳圆满，其时则刚健日进，其爻则二五共备刚中之德，同德相助，谓之两刚相应之例。《乾》之卦，处九五之位，以明德御众贤，九二之臣，承奉君意，以飞力于国家，并法天德，以治国家，以其志望之同，而两阳相应如是。上下之大人，合志而济世，则其德化之所及，无有穷极也。又此爻备三才之妙义，“现龙”者，谓得天之时；“在田”者，谓得地之利；“利见大人”者，谓得人之和也。",
                占:
                "【问战征】龙本灵物，初爻曰“潜”，是谓伏兵；二爻曰“现”，则发现而出也。“在田”则必列阵于田野空旷之地。《传》曰“德施普也”，是必战胜而行赏也。\n" +
                "【问营商】爻曰“现龙在田”，知其货物大般是米麦丝棉之类。现者，谓物价发动开涨；“利见大人”者，谓当有官场出而购买也。\n" +
                "【问功名】谓伏处田间者，当乘时而进用也，且得贵人之助，故曰“利见大人”。\n" +
                "【问婚姻】二五相应，五居尊位，婿家必贵。曰“现龙”，必是新进少年也。大吉。\n" +
                "【问六甲】生男，且主贵。"
            },
            {
                原: "九三：君子终日乾乾，夕惕若，厉无咎",
                象: ["终日乾乾，反复道也。"],
                析: "九三以阳居阳，故才强而志亦强，具刚健之性。然位不得其中，居内卦之上，奉外卦而治下，任大而责重，若违上意，必得谴责，若失下情，必受众怨。上下之际，祸福之交，成败之所由决也。盖九三所居之地，正当危惧之时，惟“终日乾乾”，戒慎恐惧，可以免咎。六爻之中，三爻配三才而为人位，此爻以乾德居六十四卦人道之首位，君子之象也，故不称大人，而称“君子”。初之“潜”，二之“现”，四之“跃”，五之“飞”，皆有待于此爻也。故修我德，勤我业，“终日乾乾”，如临危地，戒慎畏惧，而修之于身，施之于事，能通于下之志，能虑天下之变，则虽身居危地，处置得宜，可变危而为安也，故曰“厉无咎”。所谓“反复道”者，即反复叮咛，重复践行之意。又此爻变则为《履》，《履》之六三曰“履虎尾”，可以见危殆之地位也。三者日之终，故曰“夕”；此爻变则为《兑》，《兑》者西也，日之在西，即夕之象也。",
                占:
                "【问战征】危事也。爻曰“终曰乾乾，夕惕若”，是能临事而惧者也，故虽危无咎。\n" +
                "【问功名】九三处下卦之极，其位犹卑，功名未显也，故称君子；在忧危之地，故曰乾乾惕若，斯可免咎。\n" +
                "【问营商】居不中之位，履得刚之险，度其贸易必是危地，须日夜防备，可脱险而获利也。\n" +
                "【问家宅】观爻象，必须谨慎持身，勤俭保家，斯无灾害。\n" +
                "【问婚嫁】三以六为应，三位卑，六位尊，尊则不免亢而得悔，是不宜攀结高亲也。\n" +
                "【问六甲】生男。产时恐稍有危惧，恐终无咎。"
            },
            {
                原: "九四：或跃在渊，无咎",
                象: ["或跃在渊，进无咎也。"],
                析: "九四以阳居阴，且近君位，其将进者阳之情，其将退者阴之志，故疑而未决也；然阳气方进，龙之一跃，自有升天之象。或者，疑而未定之辞，“或跃”者，将进而未进也。“在渊”者，欲进而复退。渊为空虚之地，上与天通气，且渊有水，龙得水便易于腾跃，与二爻“在田”不同。兹虽一跃而后在渊，知终必跃而升天，故曰“无咎”。《象》辞加一进字，益见乘时进必无咎也。人能审时势之可否，察人心之向背，待时而出，见可而动，其进也非贪位，其退也非沽名，可以投事机之会，可以免失身之辱。所谓无咎者，亦勉人之不失其时也。四爻越内卦迁外卦之处，故有进之意。又此爻变，外卦为《巽》，《说卦传》曰：“巽为时退，为不果”，故有犹豫之象。",
                占:
                "【问战征】观爻象，行军前进，必有渊水阻隔，宜设船筏；或临渊有敌军埋伏，宜预设备，乃得无咎。\n" +
                "【问营商】爻曰“或跃在渊”，若在贩运海货，恐罹波涛之险，或者物价一时腾涨。爻曰“无咎”，可保无害。\n" +
                "【问功名】有一举成名之象，大吉。\n" +
                "【问家宅】渊者水也，跃者飞升也，必家道有一时振兴之象。\n" +
                "【问六甲】生男。"
            },
            {
                原: "九五：飞龙在天，利见大人",
                象: ["飞龙在天，大人造也。"],
                析: "五爻刚健中正而居尊位，下与九二之臣，同德相应，见大人而助其治化，谓有圣人之德，而居天子之位，恩泽被于生民者也。盖“大宝曰位”，虽有其德，苟无其位，不能利济天下。“飞龙在天”者，谓龙飞上天，云行雨施，神变化而泽及万物。圣人在位，天下被其泽，万物遂其生，故取象于此。所谓大人者，“与天地合其德，与日月合其明，与四是合其序，与鬼神合其吉凶”。以其备龙之德，腾跃而居天位，为万物所瞻抑，故天下利见。《象传》曰“飞龙在天，大人造也，”造犹作也，即所谓“圣人作而万物睹”也。",
                占:
                "【问战征】九五尊位，必是天子亲征，王师伐罪，故曰“大人造也”。\n" +
                "【问营商】九五辰在申，上值毕，附星咸池。咸池者苍龙之舍，咸池亦名五车，主稻黍豆麦，度其贸易，定在五谷之属。曰“飞龙”者，知物价之飞生也；曰“利见大人”，知其贩运或出自政府之命也。\n" +
                "【问功名】有云宵直达之兆。\n" +
                "【问疾病】有上应天召之象，不吉。\n" +
                "【问六甲】生男，主贵。"
            },
            {
                原: "上九：亢龙有悔",
                象: ["亢龙有悔，盈不可久也。"],
                析: "上爻以阳居《乾》卦之极，极则太过，龙飞过高，故曰“亢”，以高致危，故“有悔”。此卦言龙始而“潜”，继而“现”，中而“跃”，终而“飞”，飞则已当全盛，过此则宜复潜，则不特可免此日之悔，即可冀后日之再飞。犹人臣居势位之极，当知退避之意，斯富贵可以长保也，否则，知进而不知退，则鲜有不蒙咎者矣，故曰“盈不可久也。”此爻变则为《夬》，《夬》者，决也，日中则昃，月盈则亏，天理之必然也。故当斯之时，宜因悔思改，见机而退，斯得之矣。若夫尧舜之禅让，范蠡张良之功成身退，皆不极亢而善其终者也。",
                占:
                "【问战征】上九居《乾》之极，阳极于上，故“亢”；亢则因胜而骄，是以“有悔”也。故《传》曰“盈不可久”，知不能持久也。\n" +
                "【问营商】“亢”者，太过也，凡卖买之道，不可过于求盈也，过盈则必有亏，故曰“不可久”也。\n" +
                "【问功名】上九之位已极，宜反而自退，否则必致满而遭损。\n" +
                "【问家宅】是必宅基太高，太高则危，亦可惧也。\n" +
                "【问疾病】是龙阳上升之症［12］。《传》曰“盈不可久”，知命在旦夕间矣。可危。\n" +
                "【问婚嫁】不利。\n" +
                "【问六甲】生男，恐不育。"
            },
        ],
        yonge:{
            原: "用九：见群龙无首，吉。",
            象: ["用九，天德不可为首也。"],
            析: "“用九”者，为六十四卦阳爻之变，示阳刚之用例，即《易》中百九十二阳爻之通例也。“用”者变动之象，“九”者阳数之终，《乾》卦全体皆阳，阳极则变，故曰“用九”。“见”者，《乾》六爻皆取象于龙，曰“潜”，曰“跃”，曰“飞”，显然昭著，故曰“见”。“首”者上也，《易》以《乾》为首，“无首”者，言而有出夫其上者矣。卦以得变为吉，《乾》卦纯阳无变，故六爻未尝言吉；用九则动而将变，故曰吉。《象传》曰用九天德，以《乾》卦纯阳，不亲阴柔，浑然无德，亦即乾为天之义。“不可为首”者，言无以尚之也。夫《乾》以六龙各有行云布雨之势，在人则谓群贤汇萃，同心翊赞，以匡国家，以显功名，各宜谦让巽顺，不矜不伐，或互竞才智，争夸首功，便是凶象。《易》曰“群龙无首，吉”，正所以垂诫之也。《象传》曰：“用九，天德不可为首也。”要必知舜之玄德升闻，而好问察迩，卑牧自下，斯以为至矣。",
        }
    },
    {
        x:"000000",
        e:{
            原: "坤：元亨，利牝马之贞。君子有攸往，先迷后得主，利西南得朋，东北丧朋，安贞吉。",
            象: ["地势坤，君子以厚德载物。"],
            彖: ["至哉坤元，万物资生，乃顺承天。坤厚载物，德合无疆。含弘光大，品物咸亨。牝马地类，行地无疆，柔顺利贞。君子攸行，先迷失道，后顺得常。西南得朋，乃与类行；东北丧朋，乃终有庆。安贞之吉，应地无疆。"],
            析: "《坤》卦三偶六断，纯阴虚阙之象。“坤”字古文巛，顺字偏旁及川字，亦巛之象形也，故《象传》曰“及顺承天”，又曰“柔顺利贞”。《文言传》曰：“坤道其顺乎？”《系辞传》曰：“夫坤，天下之至顺也。”皆可见“坤”顺之义。后以其混山川之川，改从土从申，言坤地也。地土也，于方为申也。地之为体，安静而至柔至顺，以承乾也。《说卦传》曰，“坤为柔”，《杂卦传》曰：“乾刚坤柔”，柔顺之义可知矣。"
            ,
            占:
            "【问战征】坤为地，为众，“势”者有力之称。在行军，既得其地，复得其势，又得其众，宜乎攻无不克矣。\n" +
            "【问功名】上者能法坤德之厚，积厚流光，自得声名显远。\n" +
            "【问营商】《坤》为富，为财，为积，为聚，皆营商吉兆也。曰“厚德载物”，德者得也，可必得满载而归也。\n" +
            "【问家宅】知此宅胜占地势，大吉。\n" +
            "【问婚嫁】《坤》顺也，柔顺而已，地道也，即妇道也。大吉。\n" +
            "【问六甲】生女。"
        },
        ye:[
            {
                原: "初六：履霜，坚冰至",
                象: ["履霜坚冰，阴始凝也。驯致其道，至坚冰也。"],
                析: "初爻居纯阴之初，阴之始凝也，虽其端甚微，其势必渐至于盛，故取其义于霜之将到坚冰也。盖谓履霜之初，宜察阴气之渐长，终至坚冰而预防也。在人则阴邪之萌犹微，如霜之易消，然积累之势，终至坚冰，其恶逆不能复，如之何？故大而治国，小而修身，皆宜谨之于微。《文言传》曰：“积善之家，必有余庆，积不善之家，必有余殃。臣弑其君，子弑其父，非一朝一夕之故，其所由来者渐矣。”可谓能解此义者也。抑此卦，全卦皆阴，小人知利欲而不知道义。当其初，由于父教不谨，日深月久，愈趋愈下，遂致利欲薰心，不孝不悌，极至犯上作乱，而亦无所忌惮，其祸实始于教之不谨所致。抑阴扶阳，防微杜渐，圣人所以谆谆垂诫也。坤道虽至顺，然至顺之变，流极而至于大逆，圣人因坤顺之流害，以戒坚冰之驯致，履霜防冰，履尾防虎，其训诫一样深切。《传》曰“其所由来者渐矣，”来也者，即在过去、未来、现在三般中。《彖传》曰“刚来而得中（《讼》）”，曰“柔来而文刚（《贲》）”，皆言来之意。往往固执之士，以因果报应，为释氏之说，圣人所不言，可谓误矣。《象传》曰“阴始凝”者，即小人之欲念始萌，则驯者顺也，随自然之势，不复留意，习而至于盛也。阴邪之萌，其初虽微，自履霜而至坚冰，渐渐而来，不可遏抑，遂至灭身丧家，不复可救。谚曰“窃针者窃钟”，即此义也。是以圣人于其过怠之未大戒后来，欲其速改也。此爻变则为《复》，《复》之初九曰“不远复，无祗悔，元吉”，即所谓速改其过，不贻其悔也。",
                占:
                "【问营商】初六阴气犹微，曰“履霜，坚冰至”，是由微而推至于盛也，犹商业由小至大，积渐而至于富。\n" +
                "【问功名】初爻是少年新进之时，由卑而尊，犹履霜以到坚冰，随时而来，未可躁进也。\n" +
                "【问战征】初爻阴之始，“履霜”之象，至上爻“龙战”，阴之极也，“坚冰”之象。曰“其血玄黄”，是两败也。所当先慎其始。\n" +
                "【问家宅】《坤》纯阴之卦，初爻阴气尚微，故曰“履霜”，“至坚冰”，则阴气盛矣。阴盛则衰，不吉之兆。\n" +
                "【问婚嫁】《坤》卦纯阴，曰霜，曰冰，皆阴象。纯阴无阳，不利。\n" +
                "【问六甲】生女。\n" +
                "【问疾病】恐是阴邪之症，初起可治矣，久则难医"
            },
            {
                原: "六二：直、方、大；不习，无不利",
                象: ["六二之动，直以方也。不习，无不利，地道光也。"],
                析: "二爻以阴居阴，即《坤》之主爻，故有上人之势也。盖《乾》之九五，《坤》之六二，各居阴阳之本位，而合中正之德者。《乾》以君道，故以九五为主；《坤》以臣道，故以六二为主。六二具地道之全德，在内则无私曲，在外则事皆当理，称之曰“直方大”。直者无邪曲也；“方”者圆之对，纯阴之象也。圆者动而不静，阳之道也，“方”者止而守常，阴之道也，故曰天圆而地方。“大”者广大也，谓坤地生育之功德广大也。“直”则其心无私，“方”则其事当理，“大”则谓其功也。“直方大”，则配天之刚，而合自然之德。天理虽至直至方，人欲则邪曲也。人之性虽善，人欲蔽之，百岐横出，反致害天理之直也，此卦本非凶，惟为私欲所蔽，则陷于凶。然此爻得坤道之纯，其中直、方正、广大之全德，凡学之有待于习者，由于未晓其理，未谙其事也矣，亦何习之为？故曰“不习无不利”。“不习”者，谓其自然而能也，《大学》所谓“未有学养子而后嫁者也”之意。《乾》之六爻，莫盛于九五，《坤》之六爻，莫盛于六二。《象传》之意，谓六二柔顺中正，居本卦之主，动容周旋，皆中其规矩，又有“不习无不利”之功德，阴道、地道、臣道、妻道，皆得其当，德行光大之故也。盖此卦纯阴，初、三、五三爻柔顺而不正，四上两爻，柔顺而不中，惟此爻柔顺中正，独得坤道之粹者也。",
                占:
                "【问营商】六二《坤》之本位，“直方”者地之性，“大”者地之用，知其营业必是地产，如谷米、木材、丝棉之类是也。“不习无不利”，习与袭通，谓不烦重筮而知其获利也。\n" +
                "【问功名】二爻居中得位，动而获利，言不待修营而功自成，其成名也必矣。\n" +
                "【问战征】战之一道，以得地势为要，动以其方，势大力强，可一战而定也。\n" +
                "【问家宅】六二中正，居宅得宜，故曰“地道光也”。\n" +
                "【问嫁娶】“直方大”，地道也，妻道通于地道，故婚娶亦利。\n" +
                "【问疾病】爻曰“直方大”，知其素体强壮，不药有喜［17］。\n" +
                "【问六甲】生女。"
            },
            {
                原: "六三：含章可贞。或从王事，无成有终",
                象: ["含章可贞，以时发也。或从王事，知光大也。"],
                析: "三爻不中不正，而居内卦之极，改革之地，其心术行为，不能无不中不正之失；且柔顺之臣，与六五之君，皆阴柔而不相应，是人臣不得于其君者也。大抵六三之爻，多不得时位，即有才识之士，只宜韬德匿采，以待时至，若妄露才能，必招疑忌，故戒之日“含章”。刚柔相杂曰文，文之成曰章，含者含而不露也。惟其静而能守，故曰“可贞”。大凡为人臣者，不闻其遇与不遇，当有守其常而不可变之志操，纵无干进之心，亦未尝无进用之日。如或出而从事，则仍含其章，而不自居其功，从君之令，以终君之事而已，事即不成，必使后人得续以成之，谓之“无成有终”。六三居下卦之上，有“从王事”之象，盖《乾》之九四，《坤》之六三，皆居进退未定之地，曰“在渊”，曰“含章”，故皆加曰“或”，示以将进未进之意。当此进退之际，亦宜不失时宜，以从王事也。《象传》“知”字与“时”字相对。含蓄才能，未敢吐露，谓其能审时而发。“时发”者，即吐发其含章之光，退则能含，进则能发，是以其光大也。此爻变则为《谦》，《谦》之九三曰：“劳谦，君子有终，吉。”《系辞传》曰：“劳而不伐，有功而不德，厚之至也。”下卦为艮，艮者止也，有含之象，亦得含章之义也。",
                占:
                "【问战征】爻曰“含章可贞”，言平时含蓄才智，敛藏不露，一旦从事，自能制胜，即不成功，亦无大败。故曰“无成有终”。\n" +
                "【问营商】《坤》地也，百货皆生于地，商能蓄积百货，故曰“含章”。凡从事营商者，贸迁百货，以时发售，故曰“时发”。《坤》内卦至三而极，正盛满之地，故曰“光大”。是以一时虽或未成，知必有终也。吉。\n" +
                "【问功名】凡求名者，最宜待时，时未当发，“含章可贞”；时而当发，出从王事。知此道者，必能保功名以终也。吉。\n" +
                "【问疾病】玩“无成有终”句义，知不可药救矣。凶。\n" +
                "【问六甲】生女。"
            },
            {
                原: "六四：括囊，无咎，无誉",
                象: ["括囊，无咎，慎不害也。"],
                析: "四爻虽柔顺得正，而居失其中，故不足以有为也。四居近五之位，而两柔不相得，上下闭隔，是大臣不信于君之象也。当此之时，宜慎重缄默，晦藏其智，如括结囊口，杜口不露，默默隐忍，以守其愚，如此则“无咎，无誉”，斯得远于灾害矣。故谓之“括囊，无咎，无誉”。“无咎”者，在避害，“无誉”者，在逃名。若因括囊而得誉，则有誉即有咎，必深藏不露，并泯其括囊之迹，故《象传》曰：“括囊，无咎，慎不害也。”此爻变则为《豫》，卦形有括囊之象。",
                占:
                "【问营商】四巽爻，巽为商，为利，巽“近利市三倍”之谓也。兹爻曰“括囊”，是明亦以闭囊之象，知必昔日得利，财已入囊，不使复出也。故曰“括囊，无咎，无誉”。\n" +
                "【问战征】六四重阴，当闭塞之时，虽有智，囊其才，无所施其计谋也，是宜闭关不战，如囊之括其口也，斯无咎矣。\n" +
                "【问功名】四重卦，动当否位，《文言》曰“天地闭”，“括囊”者，闭口也。天地且闭，何有于功名？若妄意干进求名，适足致祸，有誉反有咎矣。宜慎。\n" +
                "【问家宅】六四以阴居阴，履非中位，是宅必在山谷幽僻之处，宜隐遁者居之。\n" +
                "【问六甲】生女，或得孪生二女。"
            },
            {
                原: "六五：黄裳，元吉",
                象: ["黄裳元吉，文在中也。"],
                析: "黄属中央，土色也；裳下服。黄中色，守中而居下，为巨下之象。盖此爻以柔德居五尊位，或女后南面听政，或如伊周之辅主摄政者也。然《坤》者纯阴，六爻皆臣事，未可以六五直为人君。占此爻者，为当垂中和之盛德，维持朝宪，辅弼国君，终复退守臣职。此尊位所以为尊，阴爻不失其常，故曰“黄裳，元吉”，否则，居尊而为天下，必大凶也。《左传》昭公十二年，南蒯筮得此爻，以不守“黄裳”之义，败家丧身，可为征矣。圣人以裳字系此爻者，恐有权臣乘势位，擅威福，失臣下之道，蔑视君上，其垂诫也深矣。《象传》曰：“文在中也”，坤为文，五居中，言美积于中而形于外，为能柔中而克守节也，故为元吉。",
                占:
                "【问营商】四巽爻，巽为商，为利，巽“近利市三倍”之谓也。兹爻曰“括囊”，是明亦以闭囊之象，知必昔日得利，财已入囊，不使复出也。故曰“括囊，无咎，无誉”。\n" +
                "【问战征】六四重阴，当闭塞之时，虽有智，囊其才，无所施其计谋也，是宜闭关不战，如囊之括其口也，斯无咎矣。\n" +
                "【问功名】四重卦，动当否位，《文言》曰“天地闭”，“括囊”者，闭口也。天地且闭，何有于功名？若妄意干进求名，适足致祸，有誉反有咎矣。宜慎。\n" +
                "【问家宅】六四以阴居阴，履非中位，是宅必在山谷幽僻之处，宜隐遁者居之。\n" +
                "【问六甲】生女，或得孪生二女。"
            },
            {
                原: "上六：龙战于野，其血玄黄",
                象: ["龙战于野，其道穷也。"],
                析: "上爻居全卦之终，是阴邪极盛之时，变而为《剥》，则有一阳与五阴相战之象。是以初六履霜之始，圣人谆谆警其将至坚冰，夫阴邪之势过盛，必将剥阳；其剥之甚也，势遂至于相战；及其战也，阴虽盛大，阳虽减退，终必两被其伤。血者伤害之甚也。玄者天色，黄者地色，天地即阴阳，故血色玄黄，为阴阳共伤也，故曰“龙战于野，其血玄黄”。近推之于一家之事，为人父兄者，其初误于弟之教育，遂养成不肖，其结果遂致骨肉相残，同类相害，争斗杀伤，势穷而始止。《象》曰“其道穷也”，其字即指阴阳君臣而言；道字亦指君臣；穷者穷困窘迫也。夫至君臣相战，其巨之横逆无道，固不俟论，其君亦未为无过。《系辞传》曰，“上慢下暴，盗思伐之矣”，“慢藏诲盗，冶容诲淫”，使其臣下至此者，君道之穷，亦即臣道之穷也，故曰“其道穷也”。龙本乾之象，今此爻言龙者，示阴极而抗阳也。又曰野者，以在外卦之外也。爻辞不言凶者，其凶不待言也。",
                占:
                "【问战征】象已明示是两败也。\n" +
                "【问功名】上处外卦之极，是穷老人闱，抑塞已久，一战复北，可哀也。\n" +
                "【问营商】上六《坤》卦之终，其道已穷，是资财既竭，血本又耗，商道穷矣。\n" +
                "【问疾病】必是阴亏之症，阴极抗阳，肝血暴动，命已穷矣。\n" +
                "【问六甲】阴尽变阳，可望男孩。"
            },
        ],
        yonge:{
            原: "用六：利永贞",
            象: ["用六永贞，以大终也。"],
            析: "用六之义，已示之卷首。永者长也，远也。《坤》卦之象纯阴，为臣妻之义，在人事则柔顺贞正，而悠久有恒，不变其志，可以从君从夫矣。忠臣不事二君，贞女不更两夫，即“永贞”之义也。为人臣为人妻者，从“永贞”之义，则大吉而有终，若少变之，则大凶大恶之道也，故深诫之曰“利永贞”。盖阴之性，柔躁而难守其常，有易进易退之弊。《象传》曰“以大终也”，谓其不变坤道之顺，而全其终也。若变动则阴侵阳，臣侵君，妻凌夫，逆理背常，乌得全其终哉！又阳为大，阴为小，阴者柔也，暗也，小也，然勤而不怠，必强学而不懈，终明，是有以大终之义也。\n" +
            "按：《乾》之用九，以过刚强，宜守无首之道；《坤》之用六，以阴道、臣道、妻道，直守恒常之德，不可变动。是警戒之辞也。",
        }
    },
    {
        x:"100010",
        e:{
            原: "屯：元亨，利贞。勿用有攸往，利建侯。",
            象: ["云雷，屯，君子以经纶。"],
            彖: ["屯，刚柔始交而难生，动乎险中，大亨贞。雷雨之动满盈，天造草昧，宜建侯而不宁。"],
            析: "屯，上一象地，中山象草，下象草根之屈曲，即草木穿地始出，欲伸而未能即伸之形。内卦《震》，《震》雷也，能以鼓动发育万物；外卦《坎》，坎水也，能以滋润养成万物。按：卦为雷在水中，当冬至之候。雷欲发于地下，而地上之水，冻冰凝结，为所压抑，不能遽出于地，其象艰难郁结，如物之勾萌未舒也，故名之曰《屯》。\n" +
            "通观此卦，初九，虽有建侯之才力，以当屯难之时，磐桓不进，居贞正之位，遇险而能自守其正。六二，居九五之应位，而为初九所挑，不能与九五共事，犹贞操之妇，拒强暴者之挑，经十年之久，始归其正应之夫。六三，为喻利之小人，乘此不明之时，欲独博其功。六四，应初九，亦比九五，因有所忌惮而不能共事，虽有“乘马班如”之屯难，终归正应初九之吉。九五，中正而并有位德，然介居二阴之间，不能沛雷雨之泽。上六，居屯难之终，无能为世。盖三与上无应之屯，二与四有应之屯也。六爻共动，当陷险之时，务要谨慎持重，经过屯难之气运，自有得志之日。曰“大亨贞”，大亨者，正屯难已解之时也。",
            占:
            "【问功名】内《震》外《坎》为《屯》，《震》为雷，《坎》为云，故曰“云雷”；《震》为出，《坎》为入，欲出而复入，故曰《屯》。又《震》为人，为上，《坎》为经，为法，故曰“君子以经纶”。是君子施经纶之才，而运当其屯也，宜待时而动。\n" +
            "【问战征】勤兵而守曰屯。“云雷”者，蓄其势也；“经纶”者，怀其才也。然当其屯，宜守不宜进。\n" +
            "【问营商】《彖》曰“刚柔始交而难生”，是必初次营商也。凡事始创者，多苦其难。经纶，治丝之事，知其业必在丝棉之类。\n" +
            "【问家宅】《震》东方，《坎》北方，《震》动也，《坎》陷也，恐是宅东北方有动作，宜经理修治之。\n" +
            "【问婚姻】雷阳气，云阴气，“刚柔始交而难生”，是初婚时，必不和洽，宜正人劝解之。\n" +
            "【问六甲】生男，恐始产不免有险难。"
        },
        ye:[
            {
                原: "初九：磐桓。利居贞，利建侯。",
                象: ["虽磐桓，志行正也。以贵下贱，大得民也。"],
                析: "每卦有主爻，皆具本卦之德，例之如《乾》之九五，具乾之德，《坤》之六二，具坤之德。《屯》以初九为内卦之主，故爻辞全类《彖》辞，他卦主爻，都依此例。“磐”者，大石也，“桓”者，柱也。此爻以正居刚，处险能动，虽有济屯之才，今居众阴之下，上应坎水之险，深虞陷入危险，未足以自持，惟守其身，贞固而耐困难，以待时机之来也。故如磐桓之居下，为柱石之臣，撑持难难之象。如因对抗之敌而占之，则有强敌坚固而不可摇动之势，在此时我惟固守持重，不可妄动，若妄进则不惟不得其志，却取其败，故曰“利居贞”。《彖》辞所云“勿用有攸往”，亦磐桓难进之意。盖言功业非容易可成，磐桓趑趄，不进不退，以待时会，即所谓“在下位而不获乎上，民不可得而治”之意。必明善诚心信友，而后乘时得位，则功业可得而成，故有大亨之利也。曰磐，曰居，皆震足之象。“利建侯”三字，与《彖》同而其义异也。《彖》辞属九五之君而言，爻辞属初九之人而言，故彼训为建侯，此训为所建之侯。侯之于王，臣也，能安其臣职，而为下不悖，即居贞也。\n" +
                "《象传》之意，贵谓阳，贱谓阴，此爻以一阳居三阴之下，为“以贵下贱”之象。虽时蹇位卑，而不得用其力。犹之江海居下，而百川归之，君主能下人，则众庶归之。屯难之世，江山易主之时也，此爻以刚健之德居下，大得人望，为他日立身之基，故曰“以贵下贱，大得民也”。第以磐桓观之，似失阳之德，要在内心坚确而不失其正也，故曰“虽磐桓，志行正”也。此爻变则为《比》，《比》之初六曰：“有孚比之，无咎。有孚盈缶，终来，有它［21］吉。”其不遽求成功之意，可推而知也。",
                占:
                "【问战征】磐桓，不进之貌，曰“利居贞，利建侯”。尽尝屯难之时，内则居正以守，外则求贤以辅，斯民心归向，众志成城，而终无不利矣。\n" +
                "【问营商】初九爻，辰在子，北方，上值虚宿［22］，曰元枵［23］，枵之为言耗，虚亦耗意，不利行商。能以守贞任人，尚有利也。\n" +
                "【问功名】初爻是必初次求名也，“磐桓者”，是欲进不进也。要当志行正直，谦退自下，终有得也。\n" +
                "【问家宅】磐字从石，所谓安如磐石，知其宅基巩固也；曰“利居贞”，知其居之安；曰“利建侯”，知必是贵宅也。\n" +
                "【问婚嫁】曰“以贵下贱”，知为富贵下嫁之象，吉。\n" +
                "【问六甲】初爻生男。"
            },
            {
                原: "六二：屯如邅如，乘马班如，匪寇婚媾。女子贞不字，十年乃字。",
                象: ["六二之难，乘刚也。十年乃字，反常也。"],
                析: "凡《易》三百八十四爻中，首揭卦名之字者，多言其卦之时也。“屯如”者，难进之貌；“邅如”者，行而不进，转辗迟回之貌；“班如”者，半欲进，半欲退，进退不决之貌。“匪寇婚媾”者，盖六二乘初爻阳，六四之阴应之，谓彼乘马不进者，非通于寇难，乃我之婚媾。然当此爻时，虽明知为正应，不能直行而遇也，故曰“女子贞不字”。《易》中言“匪寇婚媾”者凡三，此爻及《贲》之六四、《睽》之上九是也。“女子贞不字”者，此爻中正而应九五之阳，其义可从，然以阴柔，不能往而解《屯》之厄，救九五坎险之苦，故初九乘其隙来逼，此爻居中履正，执义守节，不敢许也。变则为《兑》，以少女配坎之中男，故托女子而系辞。曰“字”者，许嫁也，言女子有正应之夫。屯之时，内外相隔，不得从之，进退踌躇，是以“屯如邅如”也。“乘马班如”者，以震坎皆有马之象，故称“乘刚”曰“乘马”。时以初九之男子比我，虽欲娶我，不敢应其求，忌之避之，犹寇雠也。然初九实非寇我者，乃欲与己共事，特本婚媾耳，而我守正而不失其道，即贞而不字之象也。互卦有《坤》，坤数十，数之极也。又《震》为卯，坎为子，自卯于子，其数十。十干一周，而地数方极，数穷事变，星移物换，十年之后，其妄求者自云，屯难已解，而始得许嫁九五之应，谓之“十年乃字”。此爻犹太公居渭滨，伊尹居莘野，孔明在南阳也。屯难之时，群雄并起，不独君之择臣，臣亦择君，六二之“屯如邅如”，又非无故也。《象传》曰，“六二之难，乘刚也”，六二之艰难犹苦如此者，谓乘初九之刚故也。难字释“屯如邅如”之义。凡爻以刚乘柔为顺，以柔乘刚为逆，逆则其情乖而不相得，犹下有强刚之臣，我实艰于制驭。《象》曰“十年乃字，反常也。十年之久，尚守其贞操，而从九五，复女子常道，何者？女子生而愿为之有家，人伦之常也。女子二十而嫁，十年乃字，故曰“反常也。”",
                占:
                "【问婚嫁】爻曰“匪寇婚媾”，是明言佳偶，非怨偶也。但曰“女子贞不字，十年乃字”，知于归尚有待也。\n" +
                "【问战征】六二以柔居柔，有濡滞之象，故曰“屯如”。《春秋传》：“有班马之声，齐《师》乃《遁》。”古者还师称班师，故曰“班如”，知行师未可遽进也，必养精蓄锐，十年乃可获胜。\n" +
                "【问营商】媾与购音同，义亦相通。以货物求购，有迟回不决之意，故曰“屯如邅如”。又曰“十年乃字”，十者据成数而言，货物未可久积，或者十日十月乎？\n" +
                "【问功名】士之求名，犹女子之求嫁也，曰“屯如”、“邅如”、“班如”，皆言一时未成也。“十年乃字”，此其时也。\n" +
                "【问六甲】生子。"
            },
            {
                原: "六三：即鹿无虞，惟入于林中。君子几，不如舍，往吝。",
                象: ["即鹿无虞，以从禽也。君子舍之，往吝穷也。"],
                析: "“即鹿”，谓逐鹿也。鹿禄同音，又通乎禄利之义。鹿指九五而言。“虞”，掌山泽之官，犹土地向导者也，盖指初爻而言。初爻人位，故曰君子，与《乾》之九三同例。“几不如舍”。舍者，止也，谓知其功之不成，不如见几而止也。“往吝”者，吝，鄙吝贪吝之义，谓欲往而遂其志，必致辱名败节也。互卦为《艮》，《艮》者，止也。此爻以阴居阳，有阴柔而躁动之性，且乘应皆阴，无贤师良友训导，犹猎者无虞人之向导，而独入林中，虽冒险而进，不能获鹿，日倾西山，马困身疲，不可如何也。且林中之险，非必入而后知之也，无虞人之向导，在即鹿之初，其机已见，然以其贪于从禽，往而不舍也。夫舍与人林，均不获鹿，舍则为君子，入则为小人，君子小人之分，无他，利与义之间而已。《象传》“以从禽也”者，谓为贪心所使也。又爻辞曰“几不如舍”，《象传》曰“舍之”者，决去之辞也。此爻变则为《既济》，《既济》之九三曰：“高宗伐鬼方，三年克之，”建国之意，可并见也。",
                占:
                "【问战征】爻曰“即鹿无虞，惟入于林中”，犹言行军而无向导，冒进险地也。当知几而退，否则必凶。\n" +
                "【问营商】玩爻辞，知其不谙商业，不熟地理，前往求货，不特无货，反有损失，舍而去之，尚无大害也。\n" +
                "【问婚嫁】是钻穴隙以求婚也，其道穷矣。\n" +
                "【问功名】梯荣乞宠，士道穷矣。\n" +
                "【问六甲】六三阴居阳位，生男。"
            },
            {
                原: "六四：乘马班如，求婚媾，往吉，无不利。",
                象: ["求而往，明也。"],
                析: "“乘马班如”，解见六二下。六四之位，与九五之君，刚柔相接，然以阴居阴，其才不能救天下之屯，故欲进而复止，“乘马班如”也。夫大臣不患无才，患不能用才，苟能求贤自辅，可谓贤明也。其取象与六二同，盖以初九为刚明有为之才，求之偕往，相与共辅刚中之君，庶几“吉，无不利”，谓其有知贤之明，而无嫉贤之私也。故《象传》曰：“求而往，明也。”初九亦然，若不待其招而往，不知去就之义，岂得谓之明哉！此爻变则为《随》，《随》之九四，曰“有孚在道以明，何咎？”可以知婚姻之正道也。",
                占:
                "【问战征】“乘马班如”者，不明其进攻之路故也，明而前往，则所向无敌，故曰“往吉，无不利”。\n" +
                "【问功名】士者藏器待时，不宜躁进，迨于旌下逮，出而加民，“无不利”也。\n" +
                "【问婚嫁】《诗·关睢》云，“窈窕淑女，君子好逑”，逑，求也，必待君子来求，始为往嫁，故吉。\n" +
                "【问六甲】生女。"
            },
            {
                原: "九五：屯其膏，小贞吉，大贞凶。",
                象: ["屯其膏，施未光也。"],
                析: "膏者，膏润，坎水为雨为云之象。“屯其膏”者，谓时当屯难，不得下膏泽于民，致财政涩滞，有功而不能赏，有劳而不能报也。五爻中正而居尊位，得刚明之贤臣以辅之，则能济屯矣，以无其臣也，故“屯其膏”。初九备公使之选，在下而遵时养晦，六四应之，民望归之。九五居尊，而陷坎险之中，失时与势，其所应六二之臣，才弱而不足济屯，小事守正则可得吉，所谓“宽其政教，简其号令”，可使之徐就统理也。惟至大事，则不可也，若夫遽用改革，恐天下之人，将骇惧而分散，是求凶之道也。自古人君，时当叔季，往往愤权柄之下移，遽除强梗，而为权奸反噬者不少，谓之“小贞吉，大贞凶”也。夫天子亲裁万机，其中所尤急者，在于抚育教化万民，各使之沐浴泰平之德泽，无一夫不得其所。今九五之君，陷坎险之中，屯难之世，左右股肱之臣，亦皆阴柔，而无免险之力，不得施膏泽于下，故《象传》曰：“屯其膏，施未光也。”",
                占:
                "【问功名】士之所赖以显扬者，全望上之施其恩膏也，若上“屯其膏”，而士复何望焉！\n" +
                "【问战征】上有厚赏，则下愿效死，若恩泽不下，势必离心离德，大事去矣。凶。\n" +
                "【问营商】膏者谓商业之资财也，“屯其膏”，谓蓄聚而不流通也，小买卖犹可固守，大经营未免困穷矣。凶。\n" +
                "【问疾病】膏者在人为脂血，屯而不通，是闭郁之症，初病治之尚易，久病危矣。\n" +
                "【问六甲】九五居尊，生男，且主贵。"
            },
            {
                原: "上六：乘马班如，泣血涟如。",
                象: ["泣血涟如，何可长也。"],
                析: "“乘马班如”，解见六二下。“泣血”者，悲泣之切，泪竭而继之以血也。《坎》为血卦，故曰“泣血”。“涟如”，泪下之貌，此爻变则为《巽》，以坎水从巽风，涟如之象。上六以阴居阴，在全卦之终，坎险之极，运尽道极，而不能济；三阴而不我应，虽下比五，以屯膏贞凶，不足归之，故困穷狼狈，不堪忧惧，其求救之切，犹欲乘马而驰者也。悲泣之甚，涕泪不绝，真有不堪其忧矣。然物穷则变，时穷则迁，如因忧而思奋，不难转祸为福，则屯可济矣。此爻与三四两爻，有济屯之志，而无其才，其占不言凶者，盖因时势使然，非其罪也。《象传》“泣血涟如，何可长也”者，谓其不久而时运将变也。此爻变则为《益》，《益》之上九曰，“莫益之，或击之，立心无恒，凶”，又可以见其穷之甚也。\n" +
                "\n" +
                "《屯》之经纶国家也，初爻公而忘私，国而忘家，为《水地比》之世，建侯辅治，可得安泰。四爻往而求贤，与初爻建侯同，为《泽雷随》之世，亦得安泰也。上爻居于上位，奋发有为，为《风雷益》之世，国运可进步也。然初四二爻，相疑而不相让，上爻欲进复退，则屯难无复解之日也。",
                占:
                "【问战征】上居屯之极，进退维谷，穷戚已甚，而至泣血，是军败国亡之日也。凶。\n" +
                "【问营商】“乘马班如”一句，上已三复言之，是商业之疑惑不决，已至再至三矣。极之泣血，知耗失已多，故曰“何可长也”。\n" +
                "【问功名】上居《坎》终，更无前进，得保其身幸矣。\n" +
                "【问疾病】知必是呕血之症。凶。\n" +
                "【问六甲】生女，又恐不能长大。"
            }
        ]
    },
    {
        x:"010001",//蒙
        e:{
            原: "蒙：亨。匪我求童蒙，童蒙求我。初筮告，再三渎，渎则不告。利贞。",
            象: ["山下出泉，蒙。君子以果行育德。"],
            彖: ["山下有险，险而止，蒙。蒙亨，以亨行时中也。匪我求童蒙，童蒙求我，志应也。初筮告，以刚中也。再三渎，渎则不告，渎蒙也。蒙以养正，圣功也。"],
            析: "《国语》曰：“三人为众”是也。众民未得义方之训，智识未开，昧而不明，犹为物所掩覆之象，是为童蒙之“蒙”。此卦内坎水而外艮山，山下有水，水气成蒸为雾，昏不见山之义，故名曰《蒙》。\n" +
            "通观此卦，初六与上九，治蒙之始终也。九二当启发众蒙之任，六五“童蒙”之主，六三则女子之蒙也，六四“困蒙”之下愚者也。故初六蒙昧之民，而不知受教，不勤民业，以致陷于困难，处之刑辟，以惩其非，是以曰“发蒙，利用刑人”。九二为师，具顺良宏涵之德，善容众蒙，训导得直，得继祖先之志，使之守其业，故曰“包蒙吉”，“子克家”。六三，其性奸邪，不从教导，故曰“勿用娶女”。六四有顽固强慢之性。不听师教，自陷困苦，故曰“困蒙，吝”。六五犹是赤子，天性纯正，但智识未开，童稚而居君位，克顺九二师傅之教，遂成达识，此圣人之蒙，所谓聪明睿智，而守之以愚者也，故曰“童蒙，吉”。上九师教不得其正，不以德化，而以刑驱，是为寇也，故曰“击蒙，不利为寇，利御寇”也。",
            占:
            "【问战征】《象》曰“山下出泉”，是潜伏之水也，有伏兵之象。君子谓军中之将帅也。“果行育德”，果者果敢也，育者蓄养也，谓当蓄其锐势，而果决以进也。\n" +
            "【问营商】玩《象》辞，想是开凿矿山生意。当果决从事，吉。\n" +
            "【问功名】是士者素抱德行，伏处深山之象。曰“山下出泉”，终将出而用世也。\n" +
            "【问家宅】知是宅坐向坎艮。曰“山下”，必近山也；曰“出泉”，必有泉流出其下也。君子居之，其宅必吉。\n" +
            "【问婚嫁】坎辰在子，上值女，《圣冷符》曰，“须女者主嫁娶”。《艮》下《兑》上为《咸》，二气相感，故曰“取女吉”。“山下出泉，蒙”，是婚姻之始也。\n" +
            "【问疾病】艮止坎险，病势必热邪渐陷于内，待初爻发蒙，邪气外发，可保无虞。\n" +
            "【问六甲】生男。"
        },
        ye:[
            {
                原: "初六：发蒙，利用刑人，用说桎梏，以往吝。",
                象: ["利用刑人，以正法也。"],
                析: "凡人而不喻道理，不通事情者，皆谓之蒙，“发蒙”者，启发蒙昧，使之明晓也。“刑”者，所以治违教犯法之人。“桎梏”刑具，在足曰桎，在手曰梏。“说”，脱也。初爻阴柔而失中正，居六爻之最下，陷坎险之底，如入幽暗之地，不见明光，是爻之象也。“发蒙”者，非不欲诱掖之，劝勉之，无如教之不从，则不得不以刑罚齐之，一经悔悟，便脱刑具，不敢或猛，亦足见发蒙者之苦心也，故曰“利用刑人，用说桎梏”。古圣人之治民也，教化以导其俗，刑罚以齐其众，圣人虽尚德不尚刑，而亦未尝偏废也。按，艮为手，互卦《震》足，手足交于坎险，有桎梏之象。又《坎》通也，《艮》止也，如能通达，遂即罢止，有脱之象也。若执法过严，下既改过，上复苛责，不特阻其自新之路，或激而成变，故谓之“以往吝”也。盖治民之蒙，不可太宽，亦不可太急，戒之以刑，改则脱之，所谓“恩威并行，宽猛相济”者，发蒙之道，斯得之矣。用刑固非圣人本意，然国家设法，所以齐不齐以致其齐也，若使有罪者皆脱网而去，则法将安用？顾刑法所主，宜大公至正，罚一人而使千万人知畏者是也，故曰“利用刑人，以正法也”。此爻变则为《损》，《损》之初九曰：“已事遄往，无咎。酌损之”。其斟酌适宜之义可见也。",
                占:
                "【问战征】爻曰“发蒙”，是为伐暴讨罪之师，如大禹之征有苗，格则罢师而还，故曰“以正法也”。\n" +
                "【问营商】初居内卦之始，是必初次谋办也。《坎》为难，爻曰“发蒙”，曰“用刑”，知营商必有阻碍，殆将兴讼，得直理直即止，若欲穷究，恐有害也，故曰“往吝”。\n" +
                "【问功名】欲往求荣，恐反受辱，宜自休止。\n" +
                "【问嫁娶】初居始位，爻曰“发蒙”，必在少年订婚。既多事变，罢婚可也。\n" +
                "【问六甲】初爻阴居阴位，生女，又恐生产有难。"
            },
            {
                原: "九二：包蒙吉，纳妇吉，子克家。",
                象: ["子克家，刚柔接也。"],
                析: "“包”者，包容之义，“包蒙”者，包容众《蒙》而为之主也。“纳妇”者，受众阴而为妇也。“包蒙”，言其量之能容；“纳妇”，言其志之相得；“子克家”，言其居下而能任事，故曰“吉”。二爻以阳居阴，具刚明之才，中和之德，当启蒙之任，能以宽严适宜，训导有方，可为君蒙之师也。《蒙》一卦，只有两个阳爻，余爻皆阴。上九之阳过刚，至于“击蒙”，惟九二之阳得中，故能“包蒙”。且二爻之位，臣也，子也，在臣则与六五柔中之君，阴阳相应，斯内为同僚所悦服，外为众人所归向，虽妇人之性柔暗难晓，能以柔纳之，自得亲睦，故谓之“包蒙吉，纳妇吉”也。在子则能事六五之父，统众阴之子弟，以修齐家道，故曰“子克家”。夫子能治家，则家道日隆，父之信任专矣；臣能敷教，则民德日新，君之信任专矣。《象》曰“刚柔接也”，即所谓上下合德也。《象传》之意，以二为臣，则以五为君，以二为子，则以五为父，事虽异，义则一也。刚指九二，柔指六五，九二与六五，阴阳相应，以刚中之子，继柔中之父，能治家道，谓之“子克家，刚柔接也”。以阳刚爱阴柔，故有“纳妇”之象；居下位而能任上事，故有“子克家”之象。互卦为《震》，《震》为长子，有主器成家之象。",
                占:
                "【问战征】二爻以阳居阴，爻曰“包蒙”，有包括群阴之象。《象》曰“刚柔接也”，刚柔者两军也，“接”，接战也，“克家”，犹言克敌也。占例妇为财，子为福，既克敌军，又纳其财，并受其福，大吉。\n" +
                "【问营商】二上以两阳包三阴，一阳在内，一阳在外，有包罗财物，出贩外地之象，故曰“包蒙吉”。“纳妇”者，是必旅居纳妇也，有妇复有子。‘克家”者，必其子能继父业也。\n" +
                "【问功名】想不在其身，而在其子也，故曰“子克家”。\n" +
                "【问家宅】曰“包蒙”，以《艮》包《坎》，是必山环水抱之地。曰“纳妇”，曰“克家”，是宅必有佳妇佳儿，克振家业，吉。\n" +
                "【问婚姻】玩爻辞，有二吉，明言有妇有子，吉莫大焉。\n" +
                "【问六甲】生男，主富贵。"
            },
            {
                原: "六三：勿用取女，见金夫，不有躬，无攸利。",
                象: ["勿用取女，行不顺也。"],
                析: "“金夫”，犹曰丈夫也，金者，阳爻之称，取刚坚之义，指九二。九二包君蒙，故有富之象。曰“金夫”者，为别上九正应之夫。三爻阴柔而不中正，暗昧而居坎险之极，不能守贞而待时，故求而不止，欲而不择，其行偏僻，其事暧昧，见九二为君蒙所归，得时之盛，因舍上九正应之夫，欲从近比之九二。操行不正，不能复持其身，娶此多欲之女，必无所利也，故曰“勿用娶女，见金夫，不有躬，无攸利”。艮山止而不动，坎水流而不止，可见“不有躬”之象。又《坎》为盗，此爻变则为巽，《巽》为近利，见人之有金，破节败名，不复知有躬。此爻又变而为《蛊》，以《巽》之长女，从艮之少男，惑乱之象。爻辞虽指女与夫言，亦喻辞耳，凡阴柔多欲者，皆可类推。九二有刚中之德，必不比六三而为不义之行，惟六三以不中正，欲自比九二，故系辞于六三，以见罪在六三也。《象传》之意，谓阳倡而阴和，男行而女随，顺也。以女求男，于理已悖，况舍正应之夫，而从比近之金夫乎？故曰“勿用娶女，行不顺也”。",
                占:
                "【问战征】爻曰“勿用娶女”，女阴象，凡占书以女爻为财，金亦财也，言行军宜散财以容众，不宜敛财以取怨。如掳掠财物，必致师败身亡，曰“勿用”，戒之深矣。\n" +
                "【问营商】六三以阴居阳，阴内阳外，是必行商出外也。行商最忌贪色，男恋其色，女图其财，一入骗局，小则破财，大则伤身。《象》曰“行不顺也”，顺与慎音同义通，可不慎哉！\n" +
                "【问家宅】玩爻辞，所谓“牝鸡司晨，惟家之索”，是宜深戒。\n" +
                "【问功名】妇道通于臣道，见财忘义，必致声名破败，为女不贞，即为臣不忠也。\n" +
                "【问六甲】生男。"
            },
            {
                原: "六四：困蒙，吝。",
                象: ["困蒙之吝，独远实也。"],
                析: "四爻以阴居阴，其位不中，如艮下山足，牢不可移，谓顽固而不知迁善也。近六五之君，才拙而任重，无贤者以辅导，故不堪困苦，而终为鄙吝之行，所谓“困而不学，民斯为下”者也。盖《艮》之少男，柔弱不中，昏蒙未启，与群宵为伍，是自困也。况上有《艮》山而不能进，下有坎险而不能退，应比皆阴，无刚明之亲援，凡亲我者皆阴柔不正之徒，则聪明无自发，昏昧无由开，是以其为事也，无不困也，谓之“困蒙，吝”。窒而不通曰困，纳而不出曰吝，困犹病者之忌医，吝犹过者之讳师，如此者，教之虽以其道，不能从也，其吝甚矣。《象传》之意，此卦初爻比九二，三爻应上九而比九二，五爻应九二而比上九，各有阳刚之应比，得贤师良友之辅导，独此爻陷三阴之中，而不得刚实之师友，故曰“困蒙之吝，独远实也”。独者，无助之谓，阳以生为主，故称实也；“远实”者，自我远道之义也。人而远道，孟子所谓自弃者。",
                占:
                "【问战征】行军宜深入显出，曰“困蒙”，是入阴险之地，而不能出也，故困。足以济困者，在初爻之阳，六四距初间隔二爻，阳为实，故“远实”。是知救兵在远，不能及也。凶。\n" +
                "【问营商】经商之道，宜亨不宜困，宜通不宜吝。“实”资本也，“远实”则伤其资矣。困蒙之吝，其道穷矣。\n" +
                "【问时运】“蒙”，暗昧也，“困”，厄穷也，蒙而困，其终困矣。\n" +
                "【问家宅】据爻辞观之，家业困苦，宅地亦幽僻，《象》曰“独远实也”，是必孤村而乏邻居也。\n" +
                "【问六甲】生女。是女必少兄弟，故曰独。"
            },
            {
                原: "六五：童蒙，吉。",
                象: ["童蒙之吉，顺以巽也。"],
                析: "五爻以阴居阳，柔顺谦虚，下应九二；艮之少男，得柔中之德，而居尊位，幼主临下之象。九二之贤臣，有刚中之德，能辅佐六五之君，在幼主自知年少，委政贤相，无为而治，如成王之于周公是也。人主能不挟威权，舍己从人，任贤不二，如“童蒙”之得贤师，专心听受，故曰“童蒙，吉”。《象传》之意，以人主之尊，生长富贵之中，不知处世之艰苦，往往疏忠言，远耆德，以致败乱国家，在所不免。今六五能顺九二，故曰“童蒙之吉，顺以巽也”。此爻互卦为《坤》，《坤》为顺，变则为巽，顺《巽》二字，出于此。\n" +
                "《易》中以九居五，以六居二者，虽当其位，其辞多艰；以六居五，以九居二者，虽不当其位，其辞多吉。盖君贵以刚健为体，在虚中为用，臣贵以柔顺为体，以刚中为用，斯上下交而其志同也。是卦之通例也。",
                占:
                "【问战征】五互《坤》，辰在未，值井，弧矢九星在井东南，主伐叛。又东为子孙星，曰“童蒙”，是帅子弟以从军也，故吉。\n" +
                "【问营商】五为卦主，爻曰“童蒙”，是必店主尚在童年。五应二，正义云“委物以能”，谓委付事物于有能力之人，是委二也。盖五爻店主，自知年少，顺从二爻，以为经纪，故曰“童蒙吉”。\n" +
                "【问功名】年在“童蒙”，功未成，名未就，惟能顺听二爻师教，则成就未可量也，故曰“吉”。\n" +
                "【问婚姻】《蒙》上体艮，艮为少男，是以幼年定姻也，故曰“童蒙吉”。\n" +
                "【问六甲】生男。"
            },
            {
                原: "上九：击蒙，不利为寇，利御寇。",
                象: ["利用御寇，上下顺也。"],
                析: "“击蒙”者，谓不能“包蒙”，面杖作教刑，怒而出之以击也。此卦四阴二阳，四阴皆蒙昧，二阳均有刚明之才德，足以击蒙也。九二有刚中之德，训导中节，宽严适宜，其于蒙能包之，所谓“董之用劝”；此爻以阳居阴，刚极失中，其于蒙也，乃击之，所谓“戒之用威”。此击字，比“包蒙”之包，“发蒙”之发，凌厉严刻，不言可知矣。然“重蒙”而不从教，初发之而不知感，继包之而不知悟，教之术亦几穷矣，上九亦出于势之不得已也。至击之太甚，未免过于凶暴，是击之者，反为寇也，故曰“不利为寇”。然因其蒙顽不灵，一味优容而不惕之以威，将恐蒙极而流为寇，是宽之适以害之。击之者，治蒙虽严，正所以御其为寇也，故曰“利御寇”也。曰“为寇”者，寇在我也；曰“御寇”者，寇在彼也。《艮》为手，有击之象；《坎》为盗，有寇之象；《艮》止于上，有御寇之象。上九虽应于三，三之行不顺，是寇也，非婚媾也，故利御之也。此爻变则为《师》，《师》又有击之象，乃寇之象。《象传》之意，此卦有刚明之德，比六五而辅翼之，应六三而训导之，且自上九至六三，其应比之间，无有一阳之障碍，是为柔顺之极，故曰“利用御寇，上下顺也”。",
                占:
                "【问战征】上辰在戌，上值奎，奎主库兵，禁不违时，故曰“利御寇”。\n" +
                "【问营商】商业一道，全在利用，又贵顺取。逆取为寇，顺取则为御寇。“上下”者，卖买两家，卖买和洽，则上下顺矣。吉。\n" +
                "【问婚姻】“击蒙”，马郑作“系蒙”，恰合月下老人红丝系足之意。《屯》卦两言“匪寇婚媾”，是佳偶为婚，怨偶为仇之谓也。利用御寇，必为佳偶。妇道贵顺，《象》曰“上下顺也”，是必家室和平也。吉。\n" +
                "【问六甲】生男。此男童年，必宜严教。"
            }
        ]
    },
    {
        x:"111010",//需
        e:{
            原: "需：有孚，光亨，贞吉，利涉大川。",
            象: ["云上于天，需。君子以饮食宴乐。"],
            彖: ["需，须也，险在前也。刚健而不陷，其义不困穷矣。需有孚，光亨，贞吉，位乎天位，以正中也。利涉大川，往有功也。"],
            析: "通观此卦，初九从二阳之后，有进行之志，虑遇险而难为，未敢轻进。九二，为三阳之主，本可进行，但以坎险在前，恐进而有咎，是以从容待时，即所谓“君子居《易》以俟命”也。九三，重刚而不中，独进而涉坎险，以致酿灾，惟能敬慎，尚可不败。六四，位邻九五，虽能尽其忠诚，而乏匡济之才，为下三阳所疑，未免受伤，仅得以身免而已。九五，秉刚健中正之德，以待天命，是能尽需之道也，故曰吉。上六，当爻之终，险陷已极，无复可需，虽有非意之来，“敬之终吉”。乃知需之为时，能含忍守敬，皆可免祸。需之时义大矣哉！",
            占:
            "【问战征】需，待也，云在天上，阴阳未交，未可战也。《乾》为君子，又为武人，属主帅言。《坎》为酒，故曰“饮食宴乐”，盖言行军先备军粮也。\n" +
            "【问营商】玩爻辞，想是贩运粮食，或开设酒馆之业也。曰“云上于天”，是云在上而雨未下，想是资本未集也，故曰《需》。\n" +
            "【问功名】是风云未际其会，尚有待也。\n" +
            "【问疾病】宜以饮食调剂，安乐自遣，遣久自愈。\n" +
            "【问六甲】生男。"
        },
        ye:[
            {
                原: "初九：需于郊，利用恒，无咎。",
                象: ["需于郊，不犯难行也。利用恒，无咎，未失常也。"],
                析: "“郊”者，偏鄙之地；《坎》者，水也，险也。“需于郊”者，前途为坎水所阻，必待川减退，故需。又《乾》为金，如旅客怀金，中途被水，以致滞留者。以《乾》三爻，对外卦之《坎》，各以所居远近系辞，曰“郊”，曰“沙”，曰“泥”，取渐次近险之象。此爻去水最远，不敢进而冒险，故曰“需于郊”，所谓“危邦不入，乱邦不居”之义也。躬耕郊野，无求于世，历久而不改其节，故曰“利用恒”。“恒”，不变动之义，“用恒”者，始终不变也。初九之患，相去尚远，然思患预防，恒守其贞，可以免祸矣，故曰“无咎”。此爻体《乾》，《乾》者刚健，其道以上行为常，且以初九与六四正应，苟急其应，则必有冒险之虞。今僻处远郊，以待时机，是以《象传》曰：“不犯难行也。”",
                占:
                "【问战征】爻曰“需于郊”，是必屯营于郊也。《坎》为险，为难，是必前进有险，故《象》曰“不犯难行也”。初为卦之始，知初次出军；曰“恒”，曰“需”，知宜久待。恒而后进，必无咎也。\n" +
                "【问功名】卦属初爻，知为初出求名也。郊为草莽之地，“需于郊”。谓宜退居于野也。恒久也，“利用恒”，谓宜久待而后可利见也。《象》曰“不犯难行也”，谓其不涉于难；“未失常也”，谓其能守其恒，故无咎。\n" +
                "【问营商】行商之道，以恒久为利。“需于郊”，知必前途有险，暂以货物堆积于郊，以待时而行也。《象》曰“未失常也”，知货物无损失也。\n" +
                "【问疾病】“郊”者田野空旷之处，谓宜就野外，幽居以养病也。“无咎”，即病无害之谓也。\n" +
                "【问六甲】生男。"
            },
            {
                原: "九二：需于沙，小有言，终吉。",
                彖: ["需于沙，衍在中也，虽小有言，以吉终也。"],
                析: "“沙”者，近水之地，比九三之“泥”尚远，《比》初爻之“郊”近矣。“小有言”者，谓有言论之争。凡《易》之辞，患难之小者曰“小有言”。二爻进初九一等，渐近于险，有“需于沙”之象。虽有刚阳之才，足以济险，以上无君长之应，中无同僚之助，惟居柔守中，宽裕自处，是需之善也。然以去险渐近，虽未至大害，已有小言矣，故曰“小有言”。互卦为《兑》，《兑》者口也，悦言之象，《坎》者舌也，怒言之象，谓彼出怒言，而我能和解之，故曰“终吉”。“衍”，宽绰也，谓胸中宽衍，又能忍耐，终得济焉。故《象传》曰：“需于沙，衍在中也，虽小有言，以吉终也。”凡爻辞变而之成曰终，为原始以要终。“终吉”者，前凶而后吉也。此爻变则为《既济》，其爻辞曰，“妇丧其茀，勿逐，七日得”，亦可以见终吉之义也。",
                占:
                "【问战征】《坎》为隐伏，玩爻象，谓宜伏兵于沙漠之地。或因间谍致误，小有挫折，终必吉也。\n" +
                "【问营商】二爻辰在寅，上值天江四星，石氏云，“天江明动，大水不具，津梁不通”，因之货物不能通运，故“需于沙”，沙，水岸也。虽小有口舌，无害商业，故“终吉”。\n" +
                "【问时运】沙从水从少，是少有水之处，不能通舟揖也。“需于沙”，犹言时运之不能也。二爻辰在寅，又上值箕，《诗纬》云：“箕为天口，主出气”，小有言，是谗言也。然需以待之，故“终吉”。\n" +
                "【问六甲】生男。"
            },
            {
                原: "九三：需于泥，致寇至。",
                象: ["需于泥，灾在外也。自我致寇，敬慎不败也"],
                析: "“泥”者，水际湿土，即水际之地也；“寇”者，《坎》之象，灾之大也。初九之郊险尚远，九二之沙险渐近，九三之泥，身已接险，祸在目前。此爻居《乾》卦之极，过刚而不中，故当险难在前，复不介意，恃己刚强，见上位之应我，不辨时机，不察事情，一意妄进，将以救在前之险，故非坎险来迫人，人自进而逼险，譬如水不溺人，人自冒险狎水，以致其溺，故曰“致寇”也。然当此时，能操谨思持重之心，戒轻举妄动之失，及早悔悟，犹得免于灾也。《象传》曰“灾在外也”者，坎险在外卦之义。又外者，谓意外之事也。我欲救彼而却为彼所害，九三之意外也。且非灾之来害我，自我去招致其灾，故曰“自我致寇”。若能敬慎自持，量宜而进，虽坎险围绕，亦不能如我何，我自得以不败，故曰“敬慎不败也”。凡争名者毁，争利者夺，是皆非寇之罪，自招之孽也。此爻变则为《节》，其辞曰，“不节若，则嗟若，无咎”，可以见敬慎之义矣。又如九三、六四虽阴阳相比，不相为助，而却相为害，《易》中此类之比，谓之害比。",
                占:
                "【问战征】九三居内卦之终，逼近外卦，《坎》为寇，亦为灾，故曰“灾在外也”。有敌来寇者，谓寇至，有我自去招敌者，谓“致寇至。”必谨慎自持，先立于不败之地也。\n" +
                "【问营商】“泥”拘泥也。行商之业，宜流动，不宜拘泥，若拘泥不化，内有疑忌，遂致外生变端。慢藏海盗，即以致寇也，可不谨慎哉！\n" +
                "【问功名】爻曰“需于泥”，泥水际污泥也，需于此，则必将下流而难期上达矣。其不败也亦仅免焉。\n" +
                "【问婚姻】《易》以寇与婚媾并言，谓寇则必非婚媾，是怨偶也。“需于泥”，不进之象，于婚事则必不成。\n" +
                "【问六甲】生男。"
            },
            {
                原: "六四：需于血，出自穴。",
                象: ["需于血，顺以听也。"],
                析: "《坎》阴为血之象，坎险为穴之象。此爻与上六同言穴者，以体《坎》也。血者杀伤之地，穴者险陷之所，此爻入坎险杀伤之地，为寇所伤，故曰“需于血”。“需于血”者，承前爻“致寇”而言也。盖六四重阴才弱，居坎险之初，以一阴柔之资，为三阳所迫，临大难之冲，惟能顺以从时，不竞于险难，虽受小伤，不至大凶，终得出险。六四上《比》九五，为九五所救，出九死而得一生，故曰“出自穴”，犹孔子解匡人之围，文王脱前羑里之难也。夫云出于地，升于天，无不由穴，故有“出自穴”之义。且此爻居外卦之始，又有出之象，变则为夬，有决出之义。《象传》“顺以听也”者，谓能顺从九五之训诲也。《坎》为耳，有听之象。",
                占:
                "【问战征】四为《坎》之始，《坎》为血卦，“需于血”，是战之受其伤也。“出自穴”，是虽伤而犹能出于险也。其所以出险者，盖不在强争，而在顺听也，顺斯免害矣。\n" +
                "【问家宅】曰需血，曰出穴，有出幽谷迁乔木之象。顺者家道顺也，吉。\n" +
                "【问营商】玩爻辞，想必是采取矿产也。“出自穴”，斯得利矣。\n" +
                "【问功名】所谓呕尽心血，方得出人头地，故有《需》血出穴之象。\n" +
                "【问疾病】想是呕血之症，必须调养气血，使阴阳和顺，自可出险得生。\n" +
                "【问六甲】生男。虽小有险难，终获安产。"
            },
            {
                原: "九五：需于酒食，贞吉。",
                象: ["酒食贞吉，以中正也。"],
                析: "五爻阳刚而居尊位，居中得正，克尽其道，以此而需，何需不获？《篡言》曰：“万物需雨泽，人需饮食，天下需涵养，需之时义大矣哉！”饮食者，人各需以养生，惟人君不需自养，而需饮食以养天下。斯休养生息，使天下之民，人人乐其乐，利其利，咸餍袄于深仁厚泽之中，故曰“贞吉”。然或妞狃于豆区釜钟之小惠，逸乐自耽，不知警戒，则坠其成业者，往往有之，是谓失其中正也。《象传》曰，“酒食贞吉，以中正也”，戒之深矣。且九五君德，尚在险中，需人共济。初爻乐躬耕以求志，二爻惕人言而复退，三爻守敬慎以免灾，至四爻则出穴而进也，上爻则不速而来也，五爻数来时可，众贤并进，斯时人君适馆授餐，礼隆养贤，贤才亦各效才能，以匡济天下。教稼明农，画并授田，首为民生谋衣食之源，不复使天下有一夫冻馁，即遭荒凶，亦必蠲赈周济，倍切人饥己饥之忧。是王道之久而成化者，其即在需之道乎？《彖传》曰，“需，有孚，光亨，贞吉，位于天位，以正中也”，此之谓也。此爻变则为《泰》，天下泰平之象也。",
                占:
                "【问战征】爻辞曰“需于酒食”，是得胜旋师，有犒赏策勋之象，故曰“贞吉”。\n" +
                "【问功名】是为鹿鸣宴乐之时也，吉。\n" +
                "【问营商】五互《离》，辰在午，上值柳，附星有酒旗，有外厨，主宴享饮食，知必是酒馆粮食等业。又《坎》为人，为纳，知其商业必输入有余也。故“贞吉”。\n" +
                "【问婚嫁】《需》四爻为《泰》，《泰》六五曰“帝乙归妹，以祉元吉”；又九三曰“于食有福”，此即“需于酒食”之义也。“有福”，故“贞吉”。《象》曰“以中正也”，是谓得婚嫁之正也。\n" +
                "【问六甲】生男。得子必置酒设席，古今皆然，故爻曰“需于酒食”。"
            },
            {
                原: "上六：入于穴，有不速之客三人来，敬之终吉。",
                象: ["不速之客来，敬之终吉，虽不当位，未大失也。"],
                析: "上与四共《坎》阴，有穴之象。上爻居外卦之终，出而无可行，故曰“入于穴”。“有不速之客三人来”者，谓内卦三阳，不招而皆来也。惟柔顺不拒绝，无妒嫉争竞之心，一以敬礼相待，彼三阳虽刚断，无争夺之意，故曰“敬之终吉”。“敬之”二字，暗含前爻“酒食”之意；“终吉”之义，与九二同。上六阴而居险，无复可需，然能敬而下贤，是无失也，故《象》辞曰：“虽不当位，未大失也。”\n" +
                "按：位者六爻六位，位当者，谓得正位，位不当者，谓不得正位也。是《易》之通例也。然其中亦有差别，《象传》曰位者，多指九五之君位。又《象传》中为生卦法而说位者，六爻之正位也，《小畜》、《同人》、《大有》、《噬嗑》、《家人》、《归妹》、《渐》、《涣》、《既济》皆一是也。又《象传》中说位亦有数义。说六爻之正不正者，《履》之六三，《否》之六三，《豫》之六三，《噬嗑》之六三，《晋》之九四，《蹇》之六四，《解》之九四，《震》之六三，《丰》之九四，《旅》之九四，《兑》之六三，《中孚》之六四，《小过》之九四，《未济》之六三，皆是也。于三四两爻说之者，盖二五之位虽不正，有刚中柔中之义。又以初上为无位之地，不主说位。位当者吉，位不当者凶，然又有以位不当之为吉者，《大壮》六五之《传》是也。又于九五有专说君位者，《比》、《否》、《巽》、《节》之《传》是也。又有系不当位之辞者，《需》上六之《传》、《噬嗑》之《象传》、《困》九四之《传》是也。盖不当位与位不当，其义稍异。不当位者，本非正不正之谓也，故《需》之上六，以阴居阴，虽得正者，尚有不当位之称。位者谓五之君位也，故《需》之上六及因之九四，共于君位比近之爻说之。叉按此卦中曰“难”，曰“败”，曰“寇”，曰“血”，曰“穴”，曰“陷”，曰“有言”，曰“孚”，曰“入”，曰“酒”，曰“食””，曰“宴”，曰“乐”，曰“郊”，曰“沙”，曰“衍”，曰“听”，皆《坎》之象，可知圣人观象，自有妙用也。一说“不速”，谓非不召而来也，需待也，谓需缓之意。观初、二、三、四诸爻，曰“于郊”，曰“于泥”，曰“于沙”，曰“出穴”，皆渐渐而进，不速而来，谓其迟缓而来也。“三人”者，即《乾》卦三阳。此说亦通。",
                占:
                "【问战征】上为《坎》之终，穴谓坎险，“入于穴”，谓凭险以自守也。“三人”者，谓内卦三阳；“不速”者，自来也，谓有敌兵三面来围。既入险地，不宜再战，宜以礼貌相接，以和解之，故曰“敬之，终吉”。\n" +
                "【问营商】《坎》劳卦，万物之所归也，故曰入穴。穴，窟也，谓贮藏货物之地。“三人来”者，买客也，敬礼以接之，是得价则售，故“终吉”也。然《坎》为水穴，不宜藏货，幸而客来即售，故曰“虽不当位，未大失也”。\n" +
                "【问家宅】此屋必幽暗潮湿，幸有三面阳光来照，故曰吉。\n" +
                "【问婚姻】《需》六变《小畜》，《小畜》上九曰“妇贞厉”。称妇谓已嫁之女，故曰“不当位”，以其“贞厉”故“终吉”。“入于穴”，有生同室死同穴之义。“三人来”者，媒人也。\n" +
                "【问疾病】曰入穴，凶象也；曰“终吉”，终而后吉，于病亦凶。\n" +
                "【问六甲】生男。曰“终吉”，必少男乃吉。"
            },
        ]
    },
    {
        x:"010111",//讼
        e:{
            原: "讼：有孚，窒惕，中吉，终凶。利见大人，不利涉大川。",
            象: ["讼，上刚下险，险而健，讼。讼有孚，窒惕，中吉，刚来而得中也；终凶，讼不可成也。利见大人，尚中正也；不利涉大川，入于渊也。","天与水违行，讼，君子以作事谋始。"],
            彖: ["需，须也，险在前也。刚健而不陷，其义不困穷矣。需有孚，光亨，贞吉，位乎天位，以正中也。利涉大川，往有功也。"],
            析: "“讼”字从言，从公，《说文》曰，“争也”；《六书通》曰：“争曲直于官有司也。”盖《坎》为言，为平，《乾》为公，为决，为争，为直，故取乾刚坎险之义，名此卦曰《讼》也。\n" +
            "通观此卦，初爻以柔弱居下，不永其事，虽“小有言”，终得吉也，故曰“讼不可长”。二爻刚健，将讼者也，与五爻相应，以卑讼尊，势不能敌，知其不克，归而逋窜，尚“无眚”也。三爻以柔从刚，能安分守贞，处危知惧，故初之“不永”三之“从上”，皆终吉也。四爻与初爻对讼，初以“不永所事”，四亦复而即命，故不克，必将敛其欲讼之心，以守其安贞之道，斯无不吉矣。五爻明主当阳，用其中正，以断枉直，辟以止辟，刑期无刑，在斯时平？吉莫大焉。上九，《讼》之终也，即使善讼能胜，得邀命服之荣，然悖得悖失，其能久保乎？至“终朝三褫之”，故《象传》曰，“以讼受服，亦不足敬也”。读初、二、三、四爻辞，惕之吉可征；读五爻之辞，见大人之利可征；读上九之爻辞，所谓终讼之凶，与涉川之不利，又足征也。讼者能翻然而悔，惕然而省，斯有吉而无凶矣。盖惟上有元吉之君，初六之《讼》，可无以永；九二九四之《讼》，不以克；六三可食旧而守贞；终《讼》如上九者，虽胜终败。是使民无讼者，权在君上。讼之占尽此矣。",
            占:
            "【问战征】天《乾》也，《乾》为刚武，水《坎》也，《坎》为寇盗，故主讼事，亦主军事。两军相违，以致相战，而其所以相违者，则在未战之始，故曰“君子作事谋始”，即孔子慎战之旨也。\n" +
            "【问营商】《讼》卦内互《离》，《离》为资斧，外互《巽》，巽为商，有营商之义焉。营商之道，相合则成，相违则败，且《乾》为始，《坎》为谋，故曰“作事谋始”。善其始，乃可图其终，斯商业得久大矣，吉。\n" +
            "【问功名】《乾》健也，坎险也，是《乾》欲进而陷于坎险，此功名之所以难也。\n" +
            "【问婚姻】婚姻者，合两姓之好而成，有相合，无相违也。男有家，女有室，为人伦之始，故君子必求淑女，是谋始之道也。\n" +
            "【问疾病】病之始起，必由阴阳不和，不和则行违，行违即成疾。治之者，宜先慎夫始。\n" +
            "【问六甲】生男。\n" +
            "【问失物】此物在高处，坠落水中，不可复得。恐大有口舌之争。"
        },
        ye:[
            {
                原: "初六：不永所事，小有言，终吉。",
                象: ["不永所事，讼不可长也。虽小有言，其辨明也。"],
                析: "“事”，即讼也，以其事之小，故不曰讼而曰事。“有言”者，即诉讼之言；“小”者，与《需》之九二小言之小同，谓言论之伤，灾之小者也。此爻阴而居下，其身微践而无诉讼之势，其性柔暗而乏辩论之才，且畏上怖官，虽内实吞恨，不能遂讼而止。以其力弱，却不至凶，终得吉也。初六事之始，争讼未深，止之亦易，故曰“不永所事”。虽有小伤，以不遂讼得吉，谓之“小有言，终吉”。此爻变则为《兑》，《兑》者，悦也，不永所事，变而有悦也。此卦六爻中，惟九五刚健中正，为听讼之君，余五爻，皆讼者也。其中九二、九四、上九三阳，才逞而志强，贪必胜而遂讼者也，故直指其辞曰“讼”；初六、六三二阴，柔弱无才，虽一旦起讼，不遂其终者也，故初六曰“事”六三曰“旧德”并不指其为讼。此可知《易》爻扶阴抑阳之义矣。又《彖辞》曰“终凶”，此爻曰“终吉”同一终字，显分吉凶之异，《彖》为讼者言，爻为不讼者言也。讼本凶事，既得辨明，可止即止，若永讼不已，仇怨日深，必至贻累身家，故《象传》曰“讼不可长也”，又曰“其辨明也”。盖以初六之《讼》不为讼，先是被告也，且不为九二所笼络，虽为六三所疑，小有言语之伤，以上有九四之应，乃得辨明利害，故得“不永所事”也。",
                占:
                "【问战征】讼者两人相争，战者两国相争，故终讼与穷兵，皆凶事也。爻曰“不永所事”，是谓一战而胜，不复黩武，益见圣人不得已而用兵也，非好战也。\n" +
                "【问疾病】初爻者，初病也，“不永所事”，谓不久即愈也，故曰“吉”。久病则凶。\n" +
                "【问功名】初爻居卦之始，是初出而求名也。“不永所事”，谓不久困于人下也，故曰“终吉”。\n" +
                "【问营商】爻曰“不永所事，小有言”，谓商家贩售货物，宜即售脱，或卖买小有争论，亦无大碍，故曰“终吉”。"
            },
            {
                原: "九二：不克讼，归而逋，其邑人三百户，无眚。",
                象: ["不克讼，归逋，窜也。自下讼上，患至掇也。"],
                析: "“不克讼”者，不遂讼而止也；“归而逋”者，以归窜而避眚也。“眚”者，灾也，自为孽曰眚。九二自外来，以刚处险，为讼之主，与五为敌，五居尊位，自知不免，归而逋避，故曰“不克讼，归而逋”。“其邑人”者，附讼者也，主讼既逋，附讼者皆得免灾，故曰“其邑人三百户，无眚”虞氏曰，《坎》为隐伏，有逋窜之象；李氏曰：《乾》为百，《坤》为户，下卦三爻，故曰三百户。二变而之正，则《坎》化为《坤》，故曰“无眚”，是《象辞》所谓“中吉”也。若归逋而据强地，虽不克讼，尚有相抗之势。至“三百户”，邑之小者也，下既悔罪，上亦免穷。《象传》曰，“归逋，窜也”，按窜字从穴，阴柔之物也，窜之义，曰入穴，可知必窜入阴柔以求免也。项氏曰，“一家好讼，则百家被灾”，今起讼者既逋，余党亦无连坐之患矣。《象传》曰，“自下讼上，患至掇也”，以二讼五，五居尊位，故谓之“以下讼上”；“掇”，自取也，言下讼上，势既不敌，祸患之至，犹自取之耳。一说掇作掇，即《诗》“忧心掇掇”之意，言下与上讼，深为可忧。《坎》为加忧，与爻辞地“惕中吉”惕字意同。此说亦通。凡爻曰“不克”者，皆就阳居阴位者而言，以阳讼阴，故不克。如此爻示人当见机而止，退而避祸，虽非君子所为，处浊世亦足以保身，并可为邑人免患也。此爻内卦变则为《坤》，《坤》顺也，有柔顺而止讼之义。",
                占:
                "【问战征】二应在五，五在尊位，大国也，二势弱，自知不克，《坎》为隐伏，故“归而逋”也。三百户小邑，二既归逋，五亦罢战，故三百户得以无眚。\n" +
                "【问营商】九二爻辰在寅，上值尾箕斗，附星天弁［38］，主列肆闬阍，有营商之象。二变为《否》，《否》败也，故曰“不克”，有耗败之象。外互《巽》，《巽》为归，故曰“归逋”。三百小数也，故曰“无眚”。\n" +
                "【问疾病】玩爻象，是必在外得病，宜速归家调治。病人既归，病气不致传染，故曰“邑人无眚”。\n" +
                "【问功名】爻曰“不克”，是一时不克成名也，退归隐居，亦无害也。\n" +
                "【问婚嫁】二五相敌，尊卑不相偶，宜罢婚，无眚。\n" +
                "【问六甲】生男，恐不举。"
            },
            {
                原: "六三：食旧德，贞厉，终吉。或从王事，无成。",
                象: ["食旧德，从上吉也。"],
                析: "“旧”，昔也；“德”，业也。“食旧德”者，犹曰食旧业也。此爻以阴居阳，志强而才微，从九二而起《讼》，九二以不克而归逋，六三亦归旧居而食旧业，守分安常，不敢复与竞争也。“贞”固守也，“厉”危也，谓虽处危地，能知危惧而贞固自守，终必获吉也。“或从王事”者，上九为此爻正应，或将与之共从王事，然上九“终朝三褫”，是无成也，谓以阴柔不中而无功也。“或从王事”一语，与《坤》三同，《坤》以地道，故代而有终。此以讼故，不言有终，即讼不可成之意。此爻以柔从刚，以下从上，有功而不自居，故能不失旧德。盖有退让之心，无忿争之念，忧勤惕厉，自知才力柔弱，一惟从上所为，即有成功，不敢自居，故“无成”而终得吉也。此爻内卦变则为《巽》，《巽》者顺也，即从上之象。夫讼凶事也，观初三两爻，以柔不克讼者曰“终吉”，可知刚而好讼者必凶也。",
                占:
                "【问战征】六三居《坎》之终，逼近《乾》位，所谓“阴阳相薄”，“战乎《乾》”也。《坎》本为《乾》再索之男，《乾》为旧，为德，“食旧德”，是子食父遗禄，安常守分，保其旧业，无事争战也，故吉。若欲兴动王师，《坎》为破，为灾，必无成功也，故曰“无成”。\n" +
                "【问营商】爻曰“食旧德”，知其商业为先世遗产，谨慎固守，终得吉也。\n" +
                "【问功名】宜继守先人旧业，或欲出而求仕，必无成也。\n" +
                "【问疾病】须仍服前医方剂为吉。\n" +
                "【问家宅】直守居旧宅，不须别建新居，恐无成也。\n" +
                "【问六甲】生男。此子长成，亦以继承父业为吉。"
            },
            {
                原: "九四：不克讼，复即命，渝安贞，吉。",
                象: ["复即命，渝，安贞，不失也。"],
                析: "四爻承五履三而应初，初既“不永所事”，四虽刚健欲讼，无与对敌，亦即得中止。且所谓“不克讼”者，与二爻同，然二爻以势不敌而归逋，四爻以理不足而自返。“复”者，返也；“即”者，从也；“命”者，正理也；“渝”者，变也；“贞”者，正也。祛其刚忿好讼之心，以复改过迁善之念，一就定命，变不安贞为安贞，故曰“渝，安贞，吉”。此爻以阳居阴，在《乾》之初，有“潜龙勿用”之义。外卦变则为《巽》，《说卦传》曰，《巽》为不果，有踌躇之象。《象传》曰“不失也”者，谓能量终始之势，复就正理，虽讼犹不失君子之道也。",
                占:
                "【问战征】四与初为敌，初既“不永所事”。四亦克无可克，故曰“不克”。《乾》为君，“命”，君命也，凯旋而复命于君。战，危事也，变危而安，故吉。\n" +
                "【问营商】玩爻象，知其商业必与初爻合办，初既“不永所事”，四亦复而“即命”，复命犹言罢事也，故吉。\n" +
                "【问婚姻】内卦《坎》为女家，外卦《乾》为男家，《坎》初曰“不永所事”，《乾》四亦复而“即命”，是变计改婚也。《象》曰“不失也”，谓不失其道也。\n" +
                "【问疾病】至致不克，是凶象也。“复”谓重生也。《坎》为疾，为炎，《乾》为生，为庆，复命即复乾也。变而得安，故吉。\n" +
                "【问六甲】生男。"
            },
            {
                原: "九五：讼，元吉。",
                象: ["讼元吉，以中正也。"],
                析: "此爻为一卦之主，五居尊位，中正刚健，能听天下之讼，辨是非，析曲直，《彖辞》所谓“大人”也，讼者得此，吉莫大焉。自来无讼，固非易期，而听讼亦难。其人听讼而不刚，则威轻而民不服；听讼而不中，则意见多偏，而讼必多枉；听讼而不正，则性情固执，而断不当理。今五爻具刚健中正之德，居《乾》之中，《乾》健也，变体为《离》，高明也，健以致决，明以察几，听讼之能事尽矣。爻辞曰“讼元吉”，《象传》曰“讼元吉，以中正也”，元吉者，吉之尽善者也。\n" +
                "此卦初爻不永讼，六三不讼，九二九四“不克讼”，九五以“元吉”化《讼》，是此卦虽名曰《讼》，意在化讼，实即“使无讼”之圣训也。",
                占:
                "【问战征】五居尊位，是主战之大君也，师出有名，得其中正，是王者之师，无敌于天下者也，故曰“元吉”。\n" +
                "【问商业】《乾》为利，《坎》为平，商业固在谋利，亦要公平正直，斯不致于争夺，商业乃得其正矣，故吉。\n" +
                "【问功名】《讼》字从言从公，五为主爻，求名者，盖以言而求主公之知也。“元”谓三元，是功名之魁首也，吉莫大焉。\n" +
                "【问婚姻】五为卦主，与五结姻，是以贱从贵，以贫从富也，故曰“元吉”。\n" +
                "【问六甲】生男。此儿品貌端正，且有福泽。"
            },
            {
                原: "上九：或锡之鞶带，终朝三褫之。",
                象: ["以讼受服，亦不足敬也。"],
                析: "“或”者，不必然之辞；“鞶带”者，命服之饰也；“终朝”者，自旦至暮，一日间也；“褫”者，夺也。彼讼而得胜，非理之本直者，无非以机诈遂其谋，以私曲济其奸，是理不可胜者而幸胜之，其曲直真伪，固不待辨也。爻辞所谓“锡之鞶带”。不必实有此荣，而若或有之；所谓“终朝三褫”，不必实有此辱，而若或有之。盖极言虽得胜，终必败，虽膺荣，终必辱。盖见荣骤者，夺之速也。“终朝”者，暂时之义；“三褫”者，多数之象。《象传》曰“以讼受服”，言其受服不正，如沐猴而冠，何足敬哉！故曰“亦不足敬也”。“亦”字，深可玩味。《彖辞》所谓“终凶”者，于是可见矣。《乾》为敬，为衣，上九变则《乾》体坏，即不足敬之象；《兑》为毁拆，即褫之象。此爻不系讼字者，与初爻之不系讼字同。初爻不言讼，杜其始也；上爻不言讼，恶其终也。益见圣人“使无讼”之微意也。",
                占:
                "【问战征】上居《乾》阳之极，阳极而战，胜已难矣，至一日而三胜三败，败固为辱，即胜亦不为荣也。\n" +
                "【问功名】“锡”赐也，“褫”夺也，“或”者未然之辞。而设言赐之，至终朝而三夺之，是亦一患得患失之鄙夫也，何足敬哉！\n" +
                "【问商业】玩爻辞，是屡得屡失，终至得不偿失。且问其所得者，尚非正路之财，所谓悖入悻出，非其财者也，亦可鄙矣。\n" +
                "【问疾病】是必其病乍愈乍发，一日之间，病势不一。在上爻，处卦之极，势极难返，恐终凶矣。\n" +
                "【问六甲】生男。恐生男多不育，必至四胎可育。"
            }
        ]
    },
    {
        x:"010000",//师
        e:{
            原: "师：贞，大人，吉无咎。",
            象: ["地中有水，师。君子以容民畜众。"],
            彖: ["师，众也，贞，正也，能以众正，可以王矣。刚中而应，行险而顺，以此毒天下，而民从之，吉，又何咎矣。"],
            析: "“师”篆书左旁为阜；右旁为巾。巾上加一者，为能一人指挥众人也。《师》承《讼》来，《讼》必有众，《师》者，众也，故《师》继夫《讼》。顾《师》有二义，一为教导子弟，一为统领军旅，是皆有率众之象。以九二为成卦之主，统率五阴而济坎险。《坤》上《坎》下，地中有水，水依地而安居，地得水而滋润，生育万物，相助为功。水土之性，原来相亲，此卦水在地下，是至险起于至顺之下，为聚众据险，扰乱不定之象。《师》者，以一人统众而平定之也。盖未乱之先，以师道训导之，格其非心，可戡乱于未形。既乱，则统师旅以征伐之，枭其元恶，可戡乱于方作，皆为师也。此卦初爻，柔而不得其正，为起难之首；二爻在险难之中，能率众以平难，故为一卦之主。\n" +
            "通观此卦，九二为元帅，五阴从之。初六为师众，九二为主帅，六三六四为褊裨，六五为临敌，上六为赏功之时。又以内外卦见之，九二为将帅，六五为君主，将帅承君命而出征，所谓“礼乐征伐，出白天子”。将帅者，佐主成王，相与有成者也。故“能以众正”者，属九二之将帅言之；“可以王矣”，属六五之君言之也。",
            占:
            "【问战征】卦以《师》名，爻义甚明，可就各爻推究，吉凶自验。\n" +
            "【问营商】《坤》为财，为聚，《坎》为人，为纳，自有容保之量。坎水在地中，为地所包容，财源如水，流而不息，可知商业之富有也。吉。\n" +
            "【问功名】水在地中，犹士尚伏处，未显达也，而其德量，自能包容民物，一经进用，如水之朝宗于海，敷施甚广。“君子”者，有德有位之称也。吉。\n" +
            "【问婚嫁】按《坤》《坎》互用，地水相亲，是必旧亲联姻也。大吉。\n" +
            "【问疾病】是必水满腹胀之症。《坎》为心，为忧，宜息心调气，解忧取乐，自愈。\n" +
            "【问六甲】生男。"
        },
        ye:[
            {
                原: "初六：师出以律，否臧凶。",
                象: ["师出以律，失律凶也。"],
                析: "此卦内《坎》外《坤》，自内而外曰出。“以”，犹用也。《坎》为律，“律”法律，即号令节制之谓也。初为爻之始，即为出师之始。所谓临事而惧，言当谨其始也。师旅之事，率大众而临危地，国家之存亡，人民之安危系焉，苟纪律不严，人心不协，三军覆败，凶莫大矣。“否”，不也；“减”，善也，与《诗”·卫风》“何用不臧”同训。盖“师出以律”，胜负尚未可预决，故不言吉；至不善用其律，则陷于危险，势必凶矣。《象传》曰“失律凶也”，“否臧”即失律之谓也。一说否，塞也，谓军心隔塞，不得和协；臧藏古字通用，臧即藏字，谓深臧不发，是畏敌也，即使纪律严明，亦必取败。况“否臧”者，必不能“以律”，其凶必矣。此说亦通。\n" +
                "此爻居坎险之始，故以失律为戒，所谓“作事谋始”也。此爻内卦变则为《兑》，坎水变而为泽，停止而不流，是纪律不行之象。",
                占:
                "【问功名】初爻者，初出而求名也。“出师以律”为正，犹士之以道为重，失其道，虽荣终辱，凶。\n" +
                "【问营商】初爻，知为新立之业，水在地中，知为海运商务。总之谋利以义者吉，失义为凶。\n" +
                "【问家宅】《师》卦内《坎》外《坤》，是宅必坐子兼丑，向午未也。宅中人口最多。出师有律，犹言治家当以法也。否不也，减善也，不善治家，家道必凶。\n" +
                "【问疾病】《师》卦一阳五阴，是必寒多热少。症在初起，宜延良医调治，否则凶。"
            },
            {
                原: "九二：在师中吉，无咎，王三锡命。",
                象: ["在师中吉，承天宠也。王三锡命，怀万邦也。"],
                析: "《师》卦，九二为五爻正应，以一阳为众阴所归，乃师中之主将，得专主战伐之权。“在师中”者，谓居军阵之中，又得中正之道；“王三赐命”者，命者恩命，谓邀荷宠遇也。“三”者，言宠赐之频也。此爻以阳居阴，在《师》之中，当互卦《震》之主爻，为居将帅之位。《坎》为智，《震》为勇，以阳爻之德居中，智勇兼备，威信并行，洵足膺元帅之任，即《彖辞》所称“大人”者是也。承六五之君命，统率师众，且得六三之同僚比亲之，初六之众庶比顺之，上下咸相比应，并为参谋，所谓战必克，攻必胜者，惟在此九二之师也。六五之君，倚任既专，宠赐又厚，九二自得专制其权，所谓阃外之事，一以委卿者。其任既隆，其令必行，故成功也易。古来权臣在内，即有坤岳之将，未能克敌者，皆由信任之不专故也。此爻曰“王三赐命”，可见任之专，宠之渥也。《象》曰“承天宠也”，“天”即王也，王而曰天，可知王之明于任贤。《象》曰“怀万邦也”，谓王之所赐命，不在用威，而在用怀，即怀保万民之意也。\n" +
                "此爻变则全卦为《坤》，去坎险，就坤顺，有拨乱反正之象。《地水师》忽变《坤为地》，有拓地开疆之象，此爻为成卦之主，故以《彖》辞“吉无咎”属之也。",
                占:
                "【问功名】九二以一阳统率五阴，爻曰“在师中，吉”，是鸡群一鹤，杰出之才也。“王三赐命”，谓以能授爵，显膺王命也。\n" +
                "【问营商】九二为一卦之主，必其人谋为出众，在商务中称为老成练达，可举为商社之长者也。吉。\n" +
                "【问家宅】曰“师中吉”，是家必为一乡之巨室，即为一乡之善士也。\n" +
                "【问婚姻】九二变为《坤》，坤地道也，妻道也，水土之性相合，故吉。\n" +
                "【问疾病】知为水气停积中宫，必使水气流动，中焦宽舒，病无害也。吉。\n" +
                "【问六甲】生男。"
            },
            {
                原: "六三：师或舆尸，凶。",
                象: ["师或舆尸，大无功也。"],
                析: "“舆尸”者，谓军败而战死者多，载尸于车而归也。此爻内卦变则为《巽》，《巽》为进退，有疑之象，故曰“或”。古语曰，三军之灾，生于狐疑，疑者行军之所大戒也。六三以阴居阳，不中不正，进而无所应，退而无所守，居内卦之极，对外卦之敌，正当交锋接刃之际也。三以柔居刚，如小人之才弱志刚者，窃二之权，而恃强妄进，遂致失律丧师，舆尸而归，谓之“师或舆尸，凶”。《象传》曰“大无功也”，犹曰大败也。军旅之事，信任宜专，二为主帅，三为偏稗，偏稗擅权致败，主帅亦不能辞咎，故曰‘大无功也”。如城濮之战，左师右师败，子玉不败，然子玉帅也，故败师之罪，子玉不免。盖以全卦言之，六爻皆师徒也，独以三言，内卦为先锋，外卦为敌，外卦《坤》为众，敌兵众多也。至四则又以五上为敌；五君位而非敌，是卦爻之变例也。《易》之取象，概如此，学者不可不知。",
                占:
                "【问商业】《坎》为舆，舆所以载货物也；《坎》又为陷，为破，舆而遇隘，则舆破而货覆矣。人死谓尸，犹车败物亡也。“或”者未然之辞，“大无功”者，大失利也。行商未必遇此凶险，亦不可不防此凶险也。爻象戒之如此。\n" +
                "【问功名】“君子得舆”，得为德，舆所以载德而行也。君子有德位之称。或曰，“舆尸”是无德而尸位者也，故凶。\n" +
                "【问家宅】阴阳家称堪舆，堪天也，舆地也，舆尸是地有尸气，安得不凶！\n" +
                "【问婚嫁】三爻居《坎》之终，得乾气，《乾》下《巽》上为《小畜》，《小畜》三爻曰“舆脱辐，夫妻反目”，《象》曰“不能正室”，其凶可知。\n" +
                "【问六甲】虽生男，凶。"
            },
            {
                原: "六四：师左次，无咎。",
                象: ["左次，无咎，未失常也。"],
                析: "左者右之对，不用之地。人手右为便，左为僻，故称不正之术，曰左道，称谪官曰左迁，划策不适，曰左计。“左次”者，谓退舍也。左氏曰“不进曰次”，又曰“凡军三宿为次”，又《易》阳为右，阴为左，六四以爻位俱阴曰左。此爻阴柔而不中，志弱而不能克敌者也。自知不能克敌，量宜而退，克保全师，愈于三爻之覆败者远矣，故“无咎”也。《象传》曰“未失常也”，谓不违“左次”之常道。古语所谓见可而进，知难而退，军政之善也。若可进而退，何得无咎？《易》之发此义，为后世行军不量力而妄进者戒。",
                占:
                "【问家宅】四出《坎》历《坤》，《坤》西南，是宅必朝西南。吉事尚左，是宅逼近东方，青龙主喜，吉无咎也。\n" +
                "【问功名】凡官职下降称左，所谓左迁是也。曰“左次”，不吉。\n" +
                "【问营商】有高左下，次亦为下，占此爻，知其货财必非高品。然货虽次，尚可获利，故曰“未失常也”。\n" +
                "【问婚姻】男尚有，女尚左，爻曰“左次”，或者入赘于女家乎？然赘亦无咎。\n" +
                "【问疾病】按春生于左，得其生气，疾必无咎。\n" +
                "【问六甲】生女。"
            },
            {
                原: "六五：田有禽，利执言，无咎。长子帅师，弟子舆尸，贞凶。",
                象: ["长子帅师，以中行也；弟子舆尸，使不当也。"],
                析: "“田”者，艺禾之地；禽者，鸟兽之总称。“田有禽”者，谓有禽兽来害稼，犹言寇贼来害人民也，故驱逐之，捕获之，不可以不保持防御也。此爻五居尊位，其德柔顺，见有寇贼来犯，执言下命，委任将帅，以主征伐，故曰“利执言”。此爻互卦，变则为艮，艮为手，又为执，即执言之象。九二秉刚中之德，上承天宠，奉辞讨罪，所谓“师出以律”，必有功也，故曰“无咎”。奈何既任长子帅师，复任弟子，以分长子之权，是六五之君，信任不专也。长子指九二，弟子指六三。盖九二刚中有才，其出师也，纪律严明，故吉；六三阴柔不中，无智无谋，是以一败涂地，舆尸而归，故曰“长子帅师，弟子舆尸”。此长子即《彖》辞所谓“大人”也。自《彖》称之曰“大人”，自君命之曰“长子”。《篡言》曰：“凡次子以下，皆长子之弟，曰弟子。”此卦九二为主帅，六三、六四分将一军，举九二、六三，不及六四者，以九二大吉，六三大凶，六四能不失其常，故无咎也。“贞凶”者，谓命将出师，必宜择贤而任，所谓“贞”也，反是则虽贞亦凶。此“贞凶”二字，包括一章之要。此爻因彼来寇，而我讨之，是曲在彼也，是以“无咎”。《象传》“以中行也”者，谓九二之长子，具中行之才德，能奏征讨之功也；“使不当也”者，谓六三阴柔不中之弟子，失律丧《师》，是任使之不当其才也。",
                占:
                "【问营商】爻曰“田有禽”，犹言农有谷，商有利也。“执言”者，谓约证之券也。在商业一道，总宜以老成练达者为主，则利，否贝凶。\n" +
                "【问家宅】此宅想是立约新售者，利在长房，不利众子。\n" +
                "【问功名】知其人才能素著，有一朝获十禽之技，然要在德长于人，若德劣于物，虽正亦凶。\n" +
                "【问婚姻】“有禽”者，奠雁之仪；“执言”者，媒的之书。所约之婚，当以长子长女为吉。\n" +
                "【问六甲】生男，是《震》之长男也。"
            },
            {
                原: "上六：大君有命，开国承家，小人勿用。",
                象: ["大君有命，以正功也。小人勿用，必乱邦也。"],
                析: "“大君”指六五之君；“有命”谓论功行赏；“开国”，谓新封建诸侯也；“承家”，谓使之为卿大夫也。此爻外卦变则为艮，艮为门阙，有家之象；《坤》为土，有国之象。上爻居上卦之极，在师武功之终，即战定功成，旋凯行赏之时也。九二主帅，首功也，以“开国”封之；六四“左次”与有功也，以“承家”赏之；六三以柔居阴，舆尸败北，是小人也，诫勿复用；上六在大君左右，于师无所事，然在内而参赞王命，以尽将将之道，功亦大焉，故赏亦同之。审其功之大小，辨其罪之轻重，赏必公，罚必行，是皆大君之命也，故曰“以正功也”。若夫汇缘以邀功，遮饰以免罪，则非九五之命，是失其正矣。至于小人在军旅中，或以驰驱而效力，或以勇敢而获胜，未始无功也，但当赏以金帛禄位，不可使“开国承家”，以杜后患。《象传》曰，“小人勿用，必乱邦也”，戒之深矣。此爻居上卦《坤》之极，伏卦为《乾》，大君之象。下卦《坎》为盗，盗即小人，故以“勿用”警之。",
                占:
                "【问家宅】爻曰“大君有命，开国承家”，知是家必是阀阅巨室也。“小人勿用”，为其后嗣戒也。\n" +
                "【问营商】上六辰在巳，得《巽》气，《巽》为商，“近利市三倍”，此家必由商业兴家。《巽》又为命，爻曰“大君有命”，又将因富致贵，家道日隆。但因富生骄，比呢小人，所宜戒也。\n" +
                "【问功名】上六居卦之终，谓当论功用赏之时，正见功名显赫。在《震》之长子，自能克家，惟《坎》中男为不可用也，故曰：小人勿用”。\n" +
                "【问婚姻】《师》三至六为《坤》，《坤》妻道也。爻曰“开国承家”，两姓俱是巨室；曰“大君有命”，媒的必是贵人。吉。\n" +
                "【问六甲】生男，主贵。"
            }
        ]
    },
    {
        x:"000010",//比
        e:{
            原: "比：吉，原筮，元永贞，无咎。不宁方来，后夫凶。",
            象: ["地上有水，比。先王以建万国，亲诸侯。"],
            彖: ["比，吉也。比，辅也，下顺从也。原筮，元永贞，无咎，以刚中也。不宁方来，上下应也。后夫凶，其道穷也。"],
            析: "“比［45］”字篆书作二人相比之象。比则亲，亲则相辅，相辅则乐。又作炏，炏以联属一体为义。此卦坎水在坤地之上，水得地而流行，地得水而滋润，故相亲辅而和合，因名此卦曰《比》。《彖传》曰，“比，辅也”；《序卦传》曰，“比者，亲也”；《杂卦传》曰，“比乐”，皆同义也。以卦象言之，九五一阳位中正，上下五阴爻皆比而从之。\n" +
            "通观此卦，初爻为远人，二爻为贤士，三爻为求进之士，四爻为在位之宰相，五爻为君，上爻为化外之民。此皆莫非王民，而休咎不同者，物情自不能齐也。此卦次《师》，《师》《比》二卦，同是一阳五阴。《易》中一阳之卦凡六，其最吉者莫如《比》卦，以其九五一阳居天位，而“上下应之”也。又《师》《比》共为得位之卦，得君位者为《比》，得臣位者为《师》。“《师》者，众也”，众不能无争，争则乱，靖乱以武，孚之以德，所以《比》次于《师》。《师》之群阴来而居下，载九五阳刚中正之君，有乱后得明主，各安其位之象。",
            占:
            "【问战征】玩爻象，其军威之盛，有如水就下，沛然莫御之势。一战平定，即当列土分封，建立屏藩。\n" +
            "【问营商】水在地上，无处不流通，商业亦以流通为利。《比》，亲比也，得亲比之人以共事，斯商业可垂永远矣。\n" +
            "【问功名】建国封侯为士生荣显之极品；《比》反《师》，《师》上六曰“大君有命，开国承家，”此之谓也。\n" +
            "【问家宅】是宅必低洼近水，亦比近贵人之宅。宅基大吉。\n" +
            "【问婚姻】《比》，比好也，地与水，本相亲比，占婚得此，必卜百年好合，且主贵。\n" +
            "【问疾病】坤为地，亦为腹，《坎》为水，亦为心，恐是心腹水肿之症。诸侯能治国，犹医能治病，宜切近求治。吉。\n" +
            "【问六甲】生女，主贵。"
        },
        ye:[
            {
                原: "初六：有孚比之，无咎。有孚盈缶，终来有它吉。",
                象: ["比之初六，有它吉也。"],
                析: "“有孚比之”者，谓诚信充实于中，如物之盈满于缶中。缶者，上古之土器，郑云：“缶，汲器也。”此卦以五阴比九五一阳为义，与他卦应比之例不同。《比》之道以诚信为本，若中无信实，虽欲亲人，人谁与之！此爻居比之初，与九五犹远，本非其应，然《比》之道在初，初能积诚于中，率先三柔而从五，五比由初而始，故“无咎”也。譬如以诚事神，神必来格，有酒盈击，神必来享也。“缶”指六二，中虚能受之象；“之”字指九五而言。缶者质朴而无文饰，喻人之质朴正直，不事虚饰，以此交人，人亦乐推诚相与，即素未识面者，亦将乐与比助，共得欢心。谓之“终来有它吉，”“终来”者，谓将来也；“他吉”者，谓意外之吉。九五本不相比应，而亦比之，是意外之吉也。《象传》一“也”字，示其心之不可疑。此爻变则为《屯》，其辞曰：“磐桓，利居贞，利建侯。”磐与盘通，有缶象。“磐桓”“居贞”，“有它吉”者，建侯也。",
                占:
                "【问战征】有如禹征有苗，干羽来格之象，故曰“有孚比之，无咎”。\n" +
                "【问营商】商业专以信实为主，斯远近商客皆亲比而来，贸易广，而获利亦厚矣。吉。\n" +
                "【问功名】“有孚比之”，即中卦所云“信及豚鱼”之谓也。《中孚》九二曰，“我有好爵，吾与尔靡之”，靡共也，言我与尔愿亲比而共升荣也。故曰：“比之初六，有它吉也。”\n" +
                "【问婚姻】玩爻辞，谓既得相孚，又复相比，亲之至也，以是订婚，吉无咎也。\n" +
                "【问家宅】《比》，比邻也，近者既信义相孚，往来亲密，远者亦闻风愿来比邻，故曰“终来有它吉”。\n" +
                "【问六甲】生女。"
            },
            {
                原: "六二：比之自内，贞吉。",
                象: ["比之自内，不自失也。"],
                析: "“自内”者，自心也。古称中心曰内，书多其例，如《大学》“诚于内必形乎外”之类是也。此爻为内卦之主，柔顺中正，与五为正应，能以中正之道相比者也。盖其抱道在躬，而不愿夫外，故曰“比之自内，贞吉”，若急于用世，出而求君，虽有其道，已自失矣。必其秉中正之德，贞固自守，以待上之下求，而斯出而相辅，如商汤之三聘伊尹，刘先主之三顾诸葛，斯谓“不自失也”。此爻之辞为士之抱道者劝，即为土之失身者戒。",
                占:
                "【问战征】士卒同心，上下一体，战无不克，故曰“比之自内，贞吉”。\n" +
                "【问功名】“内”，我也，以我有实学，足以感孚于人，所谓实至而名归也。吉。\n" +
                "【问营商】一店伙友，性情比洽，自然百为顺从。以此出而贸易，人皆信服，无不获利，故《象》曰人之自内，不自失也”。\n" +
                "【问疾病】“内”谓心腹也，凡病总宜心平气和。中藏通利，外邪自消，故吉。\n" +
                "【问六甲】生女。\n" +
                "【问婚姻】必是内亲重联姻，吉。"
            },
            {
                原: "六三：比之匪人。",
                象: ["比之匪人，不亦伤乎"],
                析: "此爻阴柔，居《坤》之终，不中不正，承乘应皆阴，有远君子而比小人之象。所交非其友，所事非其君，不以正道相助，而以私谊相亲，是巧言孔壬之小人也。初应四为比，比得其人；二应五为比，比得其人，皆正人也。三乃应上，上处卦之终，是为“后夫”，即“非人”也。上比“无首”，“无首”，有伤之象。例如范增之从项羽，不能展其才力，忧辱而死。故《象传》曰“不亦伤乎”，谓其意之可悯也。此爻变则为《蹇》，《蹇》九三辞曰，“往蹇来反”，可以知“比之非人”之凶也。",
                占:
                "【问战征】观军而任用阉寺，参谋而偏听佞人，爻辞所云“比之非人”是也，安得不败！\n" +
                "【问营商】商业之盛衰，惟在其人，其人而日与市并无赖之辈，征逐往来。非人日亲，正人日远，不特其业立败，其人亦不堪问矣。\n" +
                "【问功名】交道不正，士品日下，不特声名破裂，祸亦随至。\n" +
                "【问婚姻】女贵贞洁，男效才良，人伦正道，苟非其偶，致误终身，不亦伤乎!"
            },
            {
                原: "六四：外比之，贞吉。",
                象: ["外比于贤，以从上也。"],
                析: "四本应初，不内顾初，而外比五，谓之“外比”。二之应五，在卦之内，故曰“比之自内”；四之承五，在卦之外，故曰外比之”。内外虽异，而皆得比于五，五刚阳中正，贤也；居尊位，上也；亲贤从上，比之正也，故曰“贞吉”，如夫周公之吐哺握发，以下天下之士，辅翼君德。下亲贤人，《比》爻之义也，《象传》曰“外比于贤，以从上也”。此爻于九五，象则为外，德则为贤，位则为上也。变则全卦为《萃》，九四之辞曰“大吉无咎，”可以见此爻之吉也。",
                占:
                "【问战征】爻曰“外比之”，得外夷归服之象，故曰“贞吉”。\n" +
                "【问营商】想是海外营业，货物流通，无远不居之象，故曰“外比之，贞吉”。\n" +
                "【问功名】四外比五，五居尊位，有简在帝心之象，功名之显赫可知也。\n" +
                "【问家宅】二居内卦，四居外卦，皆曰“贞吉”，自得内外亲比，一家和睦。\n" +
                "【问婚嫁】玩爻辞，想在外地订亲。吉。\n" +
                "【问六甲】生男。"
            },
            {
                原: "九五：显比。王用三驱，失前禽，邑人不诫，吉。",
                象: ["显比之吉，位正中也。舍逆取顺，失前禽也。邑人不诫，上使中也。"],
                析: "“显比”者，明亲比和顺之道于天下也。“三驱”者，《礼》所谓“天子不围”，天子之畋，合其三面，开其一面，使之可去，不忍尽伤物命，即好生之德也。“失前禽”者，以禽之前去者，失之不追也，商汤之祝网，即是此义。“邑人不诫”者，谓王者田猎，与民同乐，不烦告诫，如归市不止，耕者不变之意，故吉。诸爻之比，皆以阴比阳，五爻则以阳比阴，以阳故曰“显”。且九五阳刚中正，为《比》之主，阳刚则光明而不暗，中正则公直而无私。此其所以为“显比”也，《比》之至中而至正者也，故《象传》曰“位中正也”，位即九五之位。顺逆以去就言，前去之禽，任其失之，不复穷追，来者抚之，去者不追，谓之“舍逆取顺”也。“上使中也”者，言上之使下，中平不偏，是下民熙皞之象也。《比》《师》二卦，五爻皆取田之象，然《师》喻除忧，《比》喻同乐，故《杂卦传》曰“《比》乐，《师》忧”也。又《师》自二至五，《比》自五至二，《师》曰“三赐”，《比》曰“三驱”。《师》《比》皆禽，《师》之禽在内害物，为境内之寇，故“执”之，王者之义也；《比》之禽在外而背己，为化外之民，故“失”之，王者之仁也。\n" +
                "按：六十四卦中，有《坎》者十五，《屯》、《蒙》、《需》、《讼》、《师》、《比》、《坎》、《蹇》、《解》、《困》、《井》、《涣》、《节》、《既济》、《未济》是也。其中虽有轻重大小之别，皆不免艰难劳苦，以《坎》有险难之义，惟《比》之一卦，独无艰难劳苦之象，得为最上之吉。卦全由九五为主，爻具阳刚之盛德，读者玩索其义，可自得也。",
                占:
                "【问战征】有降者不杀，奔者不禁之恩威，故曰“王用三驱，失前禽也”；有耕者不变，归市不止之德化，故曰“邑人不诫，吉”。\n" +
                "【问营商】玩爻辞，不贪目前小利，不图意外资财，舍逆取顺，虽前有耗，后自得盈余也。\n" +
                "【问疾病】症象已显，前服驱邪之剂，邪已若失，不必警戒，病自愈也。吉。\n" +
                "【问功名】驰驱生事，前功虽失，后效自必显著。吉。\n" +
                "【问六甲】：生男。"
            },
            {
                原: "上六：比之无首，凶。",
                象: ["比之无首，无所终也。"],
                析: "此爻阴柔不才，居《比》之终。阴以阳为首，诸阴皆比五，上居五上，不下从五，是无阳也，无阳，即“无首”。胡氏云，“无首者，无君，”是所谓“后夫凶”。至众阴皆比，比道已成，于是欲比于五，不可得矣，故曰“无所终也”。天下有其始而无其终者，往往有之，无其始而有其终者，未之有也，是以“比之无首，”至终则凶也。",
                占:
                "【问战征】“首”，军中之首领，谓元帅也。“无首”者，亡其主帅也。凶。\n" +
                "【问营商】五为卦主，上不与比，犹营商之伙，不与店主相亲比，是“无首”也。凡有所谋，必无所终也。凶。\n" +
                "【问功名】凡求名以高等者为首，曰榜首，曰魁首，“无首”则名于何有？凶。\n" +
                "【问家宅】恐丧家主，凶。\n" +
                "【问婚姻】不知何以无主婚之人？婚家来历，不甚明白。凶。\n" +
                "【问六甲】生女，恐有奇疾。"
            }
        ]
    },
    {
        x:"111011",//小畜
        e:{
            原: "小畜:亨。密云不雨，自我西郊。",
            象: ["风行天上，小畜，君子以懿文德。"],
            彖: ["小畜，柔得位而上下应之，曰小畜。健而巽，刚中而志行，乃亨。密云不雨，尚往也；自我西郊，施未行也。"],
            析: "畜［48］字从玄，从田，玄者，水也，田中蓄水以养禾，兼有蕴藏含养等义。“小”者大之反，谓物之微细者也。此卦六爻，惟六四一阴，能畜五阳，为成卦之义。阳大阴小，以阴畜阳，故谓小。卦体下《乾》上《巽》，《乾》者刚健，《巽》者柔顺，《乾》下三刚，《巽》一柔二刚，《巽》以一柔为主，蓄藏群刚，故谓之《小畜》。《序卦传》曰：“《比》必有所畜，故受之以《小畜》。”凡物相比附，则必聚积，是卦之所以次《比》也。\n" +
            "通观此卦，六四以柔虚孚于九五，专以优柔抑制群阳。初九与六四，阴阳相应，阳为阴所畜，不宜躁动，是以自复于道，潜伏下位，故“无咎”而又“吉”也。九二以阳居下体之中，能与初九牵连而复，亦吉道也。九三与六四相比，刚而不中，止于阴而不得进，如车之脱辐，而不可行也。始则相比，而终则相争，则不和如“夫妻反目”，而不安于室也。六四处近君之位，以信实相孚，是能畜君者也，而众阳亦并受其畜；然以一阴敌众阳，因循姑息，势或攻击致伤，于是六四逃避而去，故有“血去惕出”之辞。九五在君位，任用六四，今见六四之去，怜其诚孚，有所赐与，故有“有孚挛如，富以其邻”之辞。至上九之时，处畜之终，六四之一阴已退，《巽》风变为《坎》雨，是为畜道之成也。",
            占:
            "【问时运】目下平平，有动作被人牵阻之患。\n" +
            "【问商业】有外观完美，内多耗失之象。\n" +
            "【问出行】主有风波之患。\n" +
            "【问家宅】主小康之家，防有口舌之祸。\n" +
            "【问战征】虽有雷厉风行之势，而恩泽不孚，只可小捷，难获大胜。\n" +
            "【问六甲】生女，又防小产。\n" +
            "【问行人】恐舟行阻风，迟日可归。无咎。\n" +
            "【问婚姻】主得懿美淑女，吉。\n" +
            "【问年成】主多风少雨，收成平平。\n" +
            "【问疾病】主风火之症。小儿吉，大人凶。"
        },
        ye:[
            {
                原: "初九：复自道，何其咎，吉。",
                象: ["复自道，其义吉也。"],
                析: "“复自道”者，谓知时之不可进，而自复于道。此爻居《乾》卦之初，是君子隐于下位者也。以阳居阳，位得其正，才力俱强，志欲上行，为六四之正应所畜，故返于本位，而复守其正。虽为彼所畜，而终不失其道，是不降其志，不辱其身，乃吉之道也，故曰“复自道，何其咎？吉”。“何”者，谓不复容疑之辞，叹美初九之能明道义，不吝改过，中途而复也。“何其咎”而后言“吉”者，谓不待其事之吉，而其义自吉也。",
                占:
                "【问时运】目下平常，宜退守，无咎。\n" +
                "【问商业】直稳守旧业，不宜创立新基。\n" +
                "【问家宅】所谓“士食旧德，农服先畴”，返而求已，不愿夫外，家道自亨。\n" +
                "【问疾病】宜静心自养，自可复原。\n" +
                "【问六甲】生男。\n" +
                "【问行人】即归。\n" +
                "【问年成】佳。"
            },
            {
                原: "九二：牵复，吉。",
                象: ["牵复在中，亦不自失也。"],
                析: "“牵复”者，谓与初九牵连而复也。此爻亦秉《乾》体，具阳刚之性，上进而为六四所止。然以阳居阴，位不得正，故欲进而有障；见初九之复，亦即牵连而复本位，故曰“牵复”。盖以刚中从容之德，自审进退，不失其宜，是以吉也。《象传》曰，“牵复在中，亦不自失也”，谓其有中正之德，能适进退出处之宜，自不失其节操也。“亦”字，承初爻《象传》而言。",
                占:
                "【问时运】因人成事，自得获利。大吉。\n" +
                "【问商业】宜创立公同社业，或旧业重振，皆得吉也。\n" +
                "【问家宅】主兄弟和睦，恢复先业，必致家道兴隆，大吉之象。\n" +
                "【问疾病】必主夙疾复发，小心调治，无妨。\n" +
                "【问行人】即日偕伴同归。\n" +
                "【问战征】主连日得胜。\n" +
                "【问六甲】生女。\n" +
                "【问年成】丰收。"
            },
            {
                原: "九三：舆说辐，夫妻反目。",
                象: ["夫妻反目，不能正室也。"],
                析: "“舆”者，人所乘以行远也；“辐”者，轮中之直木，或作輹；“说”者，脱也。“夫妻反目”者，谓妻瞋目而视夫，夫亦瞋目而视妻，故曰“反目”。此爻以阳居阳，刚而不中，才强而志刚，其性躁妄而不能自守，先众阳而锐进，为六四所止，故比之车之运行，脱辐而不能进，曰“舆说輹”。九三之阳，比六四之阴，有夫妻之象，但夫为妻所制，阴阳不和，致夫妻不睦，则其妻之不顺不敬，固不俟论，其夫亦不为无罪也。何则？夫之素行，苟能庄重笃实，闺门之内，相敬如宾，夫何反目之有？反目之来，实由于夫之素行有缺：始则溺于私爱，继则疏于自防，终则为妻所制。阴柔渐长，而阳刚无权，此家之所以不齐也，故《象传》曰，“不能正室也”。盖妻正位夫内，夫正位夫外，今以妻制夫，出而在外，是闺门之不正也。九三至九五，互卦为《离》为目，巽为多白眼，皆反目之象。",
                占:
                "【问时运】阴盛阳衰，内外不安，最宜慎守。\n" +
                "【问商业】有积货，急宜脱售，凡众所争售者，切勿售，众所不售者，急进售之。此谓反其道而行之，得利。\n" +
                "【问家业】阴阳颠倒，家室不和。\n" +
                "【问疾病】防医士不察，以寒作热，以虚作实，药不对症，是阴阳相反也。宜急别看良医，病必脱体，吉。\n" +
                "【问战征】军心不和，防有辙乱旗靡，倒戈相向之虑。\n" +
                "【问行人】即日可返。\n" +
                "【问出行】恐中途有险。\n" +
                "【问六甲】生男，主有目疾。\n" +
                "【问年成】不佳。\n" +
                "【问婚姻】不利。"
            },
            {
                原: "六四：有孚，血去，惕出，无咎。",
                象: ["有孚惕出，上合志也。"],
                析: "“血”者，恤也，恤字古文作血。曰恤，曰“惕”，皆忧惧之甚也。“血去”者，远伤害也，“惕出”者，免危惧也，皆所以解脱忧患。此爻成卦之主，以一阴之微弱，止五阳之刚强，盖畜得其时，又得其位，故能畜止众阳。自全卦言，为以小人畜君子；以一爻言，为以孤柔敌群刚。五为君位，四与五相比，是以臣而畜君者也。始如不足，终乃有济，有因人之功，无偾事之失。但在下三阳，为柔所制，欲锐进以害柔，亦势所不免；惟六四明而中虚，能以《中孚》感君，君臣契合，以至诚相畜，故五阳亦终服六四之制。非其力能止之，实本孚信有以感之也。且六四不以获君为荣，转以位高为惕，退避三阳，而不妨贤路，如六四者诚辅相之贤者也，谓之“有孚，血去惕出，无咎”。《象传》曰“上合志也”者，以六四之大臣，比于九五之君，尽心谋国，上下交孚；又以九五之君，爱庇六四之臣，恩遇优渥，始终无间，故曰“上合志也”。",
                占:
                "【问时运】目下不免忧虑，切忌与人争斗，防有损伤。宜出门远避，斯无咎也。\n" +
                "【问仕途】必得上官契合，即有升迁，大吉。\n" +
                "【问战征】利于出军进攻，可以获胜。\n" +
                "【问家业】姬妾仆从，御之宜得其道，否则防反受其制。\n" +
                "【问行商】利西北，不利东南。\n" +
                "【问疾病】是寒里热之症，治之宜宽解，不宜燥烈药品。\n" +
                "【问谋事】有得邻里相助之力。\n" +
                "【占行人】恐中途遇险，宜微服潜行，忍而避难。\n" +
                "【占六甲】此胎生女。后胎可连举五男。"
            },
            {
                原: "九五：有孚挛如，富以其邻。",
                象: ["有孚挛如，不独富也。"],
                析: "“挛”与孪通，“挛如”者，相连之意。“富以其邻”者，邻指六四，谓九五之君，能信任六四，与之合志而畜乾。六四之臣，积诚以格其君，九五之君，推诚以待其下，上下相孚，而畜道成。九五之富，皆六四之功也。此爻中正，以阳居尊位，而密比六四之宰相，惟其有孚，则群阳亦牵连以相从也。九五居尊，所谓贵为天子，富有四海，与上爻、四爻同居巽体，并力畜乾，以御众阳锐进之锋，方张之势。曰“富以其邻”，是以四爻为邻也。然九五之君，当以大赉天下，泽被群生，若第挛如六四之宰相，其富厚之泽，未免偏而不公，故曰“有孚挛如，富以其邻”。指臣位而称邻者，可见君德之不满。又爻辞不系吉凶者，亦以君德之未美也。《象传》曰“不独富也”者，以爻辞“以”字读为助之义也。\n" +
                "此卦初九、九二二爻，虽复道，不过独善其身；九三与六四为敌，遂至反目；独九五终始信任六四，以共天下之富，是《小畜》之所以亨也。",
                占:
                "【问商业】有百货辐辏，群商悦服之象，大利也。\n" +
                "【问时运】一生气运亨通，无往不利。\n" +
                "【问仕途】主连得升迁，禄位双全。\n" +
                "【问家业】主累代忠厚，惠及邻里，不独富有，且得贵显。\n" +
                "【问战征】主军士同心，有国境日辟之象。\n" +
                "【问六甲】有孪生之象。\n" +
                "【问疾病】主麻痹不仁，手足挛拘之症。\n" +
                "【问失物】宜从邻近寻觅，自得。\n" +
                "【问出行】宜结伴而行，不宜独往。"
            },
            {
                原: "上九：既雨既处，尚德载。妇贞厉，月几望，君子征凶。",
                象: ["既雨既处，德积载也。君子征凶，有所疑也。"],
                析: "“既”者，事之既成也。“既雨”者，此爻外卦变《坎》，前之“密云不雨”者，今则既雨矣。“既处”者，止也，谓阴阳相和，各得其所。阴之畜阳，不和则不能止，既和而止之，畜道成也。“尚德载”者，尚即《论语》“好仁者无以尚之”之谓，美六四之孚信充实，众阳感孚，明《小畜》全卦之成功也。九五、上九，同属《巽》体，知《乾》难畜，故积德而共载之。“望”者，满月也，“月几望”者，喻阴德之盛。此爻以阳居阴，《小畜》之终，畜道已成之时也。《彖辞》曰“亨”，即指上爻而言。盖此卦一阴，以巽顺为性，顺者妾妇之道，且巽为长女，象妇，故以妇为喻。六四阴象为女，九五信任不疑，六四之威权已重，恰如月之几望，满盈而敌九五之尊。“妇贞厉”之贞，谓以阴制阳，即以妇止夫。妇宜贞固自守，若以此道为常则厉，当此时虽有贤人君子，不能复如之何，故曰“君子征凶”。且阴之既胜，固无可为之道，方其将盛未盛之间，君子所最宜警戒。此爻“月几望”、“凶”者，阴之疑阳也；《归妹》之六五，“月几望，吉”者，阴之应阳也；《中孚》之六四，“月几望，无咎”者，阴之从阳也。“妇贞厉”者，以理言之，戒小人也；“月几望”二句，以势言之，戒君子也。《象传》曰“有所疑也”者，盖以阴敌阳则必消，犹言小人抗君子则有害，君子安得不疑之？一说，疑者碍也，谓于道义有所碍塞，义亦通。雨与月皆有《坎》象，此爻外卦变为《坎》，故有此辞也。",
                占:
                "【问时运】有昔时希望不遂，今得如顺之意。\n" +
                "【问家业】有前困后亨之象。\n" +
                "【问营商】宜得利则止，若贪得无厌，终恐盈满致凶。\n" +
                "【问战征】既得战胜，宜即罢军，若复进攻，不利主帅。\n" +
                "【问年成】旱，不为灾。\n" +
                "【问六甲】生女。\n" +
                "【问行人】即归。\n" +
                "【问出行】不利。"
            }
        ]
    },
    {
        x:"110111",//履
        e:{
            原: "履：履虎尾，不咥人，亨。",
            象: ["履，柔履刚也。说而应乎乾，是以履虎尾，不咥人，亨。刚中正，履帝位而不疚，光明也。", "上天下泽，履，君子以辨上下，定民志。"],
            析: "“履”者，冠履之履。篆书从尸，从彳，从舟。尸者，象人身；舟者，载也；彳者，行也。即所谓步履而行，可以运动人身者也。故此卦以此取名，《彖》辞曰“履虎尾”者是也。转而为礼，礼者，人之所践行也，故《序卦传》曰，“物畜然后有礼，故受之以履”；《大象》曰，“以辨上下”。又转为福之义，《诗》曰“福履绥之”是也。人能守礼，则天赐之以福。此卦外《乾》内《兑》，《乾》天，《兑》泽，天在上，泽居下，上下尊卑之分正，故有礼之象。又《乾》为行，《兑》为和，《论语》曰：“礼之用，和为贵。”《彖》有“履虎尾”之辞，故即取其首字以名卦也\n" +
            "通观此卦，高者无若天，低者无若泽，上下尊卑之分，昭然若揭。六三以一阴，介在五阳之间，为全卦之主，才弱而志刚，体暗而用明，不自量力，而敢于前进，致蹈危祸也。初九在下，素位而行，不关荣誉，虽涉危险之世，行其固有之业，而自得其安乐也。九二居内卦之中，不系情于名利之途，坦然自乐，不陷于危险也。九四上事威猛之君，下接奸佞之侣，处危惧之地，小心翼翼，位尊而主不疑，权重而人不忌，终得遂其志也。九五居尊位，雄才大略，独断独行，以刚猛而御下者也。上爻熟练世故，洞悉人情，建大业，奏伟功，而克享元吉者也，是《履》之终也。",
            占:
            "【问家业】有门庭肃穆，仆妾顺从之象。\n" +
            "【问任官】有品级渐升之象，若攀援干进，反致不利。\n" +
            "【问营商】宜辨别货品，实察商情，待时而售，必得高价。\n" +
            "【问出行】利于滨海之地。\n" +
            "【问六甲】得女。\n" +
            "【问疾病】宜疏通中焦。\n" +
            "【问遗失】一时为物所掩，久后自出。"
        },
        ye:[
            {
                原: "初九：素履，往无咎。",
                象: ["素履之往，独行愿也。"],
                析: "“素”者生帛，取天然之色而无饰也。“素履”者，谓直行本分。此爻以阳居阳，虽得正位，上无正应，在下位，不援上，《中庸》所谓“君子素其位而行，不愿乎其外”者也。以居《履》之初，去虎犹远，守当然之本业，独善其身，不求闻达，一旦得位，亦不改其“素履”之守，所谓“穷不失志，达不离道”，故曰“素履，往无咎”《象传》曰“独行愿也”者，谓己之所愿，不在乎外也。此爻无正应，故曰“独”也。",
                占:
                "【问功名】宜安居乐道，待时运亨通，往无不利。\n" +
                "【问营商】直守旧业，久后必获利。\n" +
                "【问谋事】宜缓待，不宜急迫。\n" +
                "【问战征】宜独行潜往，刺探敌情，无咎。\n" +
                "【问家宅】“福履绥之”，门庭吉祥。\n" +
                "【问六甲】生男。"
            },
            {
                原: "九二：履道坦坦，幽人贞吉。",
                象: ["幽人贞吉，中不自乱也。"],
                析: "“坦坦”者，道之平也；“幽人”者，谓隐居山林之士也。此爻当履之时，得刚中之位，中则不偏，不偏则不危，履行其道，犹行平坦之道路也，故曰“履道坦坦”夫行道者，履于旁则危险，履其中则平坦，必其中心淡泊，忘情荣辱，以道自守，斯得幽人之贞也，故曰“幽人贞吉”，若欲急进而从事，恐履虎而招祸也。盖此爻虽有才德，以上无应爻之助，故未得出而用世，惟其穷居乐道，遵时养晦，故吉。《象传》曰“中不自乱也”者，谓不降其志，不辱其身，是不以利达乱其心者也。一说“幽人”为幽囚之人，如文王之囚羑里而演《周易》，文天祥之囚土室而作《正气歌》之类，虽在患难，不乱其志也。此爻内卦变为《震》，《震》为大途，有道之象；又以《兑》泽，有幽谷之象，故曰“幽人”。",
                占:
                "【问功名】有高尚其志之象。\n" +
                "【问营商】一时物价平平，可得微利。\n" +
                "【问出行】平稳，获吉。\n" +
                "【问终身】有恭敬修身之意。\n" +
                "【问家宅】有分析财产之意。\n" +
                "【问失物】有意外损耗之虑。"
            },
            {
                原: "六三：眇能视，跛能履。履虎尾，咥人，凶。武人为于大君。",
                象: ["眇能视，不足以有明也；跛能履，不足以与行也。咥人之凶，位不当也。武人为于大君，志刚也。"],
                析: "“眇”者，目之偏视也；“跛”者，足之偏废也。“武人”者，文官之对；“大君”者，尊贵之称。此爻以阴居阳，不中不正，无才无德，以刚暴取辱者也。盖于履为成卦之主，欲恃其势而统辖群刚，不自度才德之微，不足负担大事。目之眇，自以为能视，足之跛，自以为能履，不避危险，勇往直前，自蹈履虎受咥之祸，故曰“眇能视，跛能履，履虎尾，咥人，凶”。曰“眇”曰“跛”者，示六三之柔暗，能视履者，谓恃九二而冒险躁进。虎之不咥我，以我背后有《乾》也。六三见虎之畏《乾》，以为畏己也，去《乾》而自用，遂为虎所咥。《彖》曰“不咥人”，爻曰“咥人”，其义相反，盖《彖》取内卦《兑》之柔和爱敬而立义，爻主中正，以六三阴柔不中正，独与上九之一爻相应，上九虎之首也。履尾而首应，故有咥人之象。六三不自知其量，放肆横行，武人而干犯九五之大君，其强暴而无所忌惮如此，大凶之道也。《象传》曰“眇能视，不足以有明也；跛能履，不足以与行也”者，谓其识暗，故视不能明，谓其才弱，故行不能远。“位不当也”者，谓以阴居阳；“志刚也”者，谓其阴柔而不中正，志刚而触祸也。《兑》为毁折，互卦《离》为目，巽为股，《离》目为《兑》所毁折，有眇之象；《巽》股为《兑》所毁折，有跛之象。又《兑》为口，有咥之象；“武人”《巽》之象，《巽》之初六“利武人之贞”可见也。“武人”，武士也，如《诗》所咏“赳赳武夫”是也，其职掌专主军政，奉王命以讨伐不庭，效忠于疆场者也。“武人为于大君，”刚强自用，干犯名分，孔子所谓“暴虎冯河，死而无悔”之徒，其甚者窃弄兵权，不奉朝命，如北条义时足利尊氏者也。我国维新以来，军政严肃，海陆两军，类皆桓桓武士，干城之选，好谋而成，固不徒以志刚为武也。《易》之垂诫，或不在当时而在后世，其虑远矣。",
                占:
                "【问家宅】有暗昧不明，以小凌大之象。\n" +
                "【问商业】有被人欺弄，急切不能脱售之虑。\n" +
                "【问战征】宜退守，不宜进攻，妄动者凶。\n" +
                "【问行人】恐中途遇险。\n" +
                "【问失物】就近寻觅，自得。\n" +
                "【问六甲】生男，但婴儿防有残疾。"
            },
            {
                原: "九四：履虎尾，愬愬终吉。",
                象: ["愬愬终吉，志行也。"],
                析: "“愬愬”者，畏惧之貌。此爻以阳居阴，逼近九五尊位，才强态弱，以九五为虎，常怀危惧，故有“履虎尾”之戒。若以其危故，而退身远引，亦非为臣之道。此爻处大臣之位，有可未常不献，有否未常不替，亦非避其威而不履也。但小心谨慎，常若想想，故曰“履虎尾，愬愬”。是以位虽高而主不疑，权虽重而上不忌，终免忧危，而得保全之吉，故曰“终吉”。此卦全卦以柔为吉。‘终”字对初而言，有始于危，终于不危之义也。《系辞传》曰“四多得”，此爻多惧，惟其防患周密，终得免害。《彖》辞曰“不咥人，亨”者，谓此爻也。《象传》曰“志行也”者，谓履行其道也。“志”者，为平日期望之志也。",
                占:
                "【问时运】以温和接人，以笃实当事，虽临危险，终得免祸，是气运平稳之时也。\n" +
                "【问商业】不宜急切脱货，宜谨慎耐守，终获利益。\n" +
                "【问战征】宜临危固守，遇救得捷，可转败为胜。\n" +
                "【问六甲】平稳得男。"
            },
            {
                原: "九五：夬履，贞厉。",
                象: ["夬履贞厉，位正当也。"],
                析: "夬者，决也“夬履”者，谓其一任刚决以履行也。此爻刚健中正，体《乾》卦，《履》尊位，下无应爻，自恃刚明，果于任事，多威武猛断之政，未免有果敢而窒之弊，故曰“夬履”。古圣人居天下之尊位，虽明足以照，刚足以决，势足以专，未尝不博取天下之议，以广其见识，此圣人之所以为圣人也。此爻不患不刚明，而患在躁急，一任己见，以刚行刚，不审时机，不察群情，遂致上下不通，内外阻隔，急切之甚，激成祸变，是危殆之道也，故曰“贞厉”。“贞”者，贞固也，谓固执而不变也；“厉”者，危也，谓当常存危惧之心也。《易》中用“厉”字之例皆然，《噬嗑》之九五，“贞厉无咎”，亦犹是也。盖《履》之道，尚柔不尚刚，九五以刚居刚，是决于履也；以其中正之德，又能危厉自惕，斯得动无过举。《书》曰“心之忧危，若蹈虎尾”，国君能常思蹈虎之危，可谓“履帝位而不疚”也。爻辞“贞厉”者，固见其厉也。《象传》曰“位正当也”者，与《兑》之九五及《中孚》之九五同义。盖有不满于君德之旨也，谓刚决之君，似于宽仁温和之德有阙，所宜反省而加勉也。",
                占:
                "【问时运】前苦后甘，目下正当披云见日之时，犹宜毋忘曩时苦境，兢兢业业，斯能长保其富也。\n" +
                "【问商业】宜和衷共济，有货不宜急售，久后必得厚利。\n" +
                "【问失物】有不待寻而自得之象。\n" +
                "【问官途】目下已得升迁，惟宜谨慎，斯可永保。\n" +
                "【问疾病】危而后安。"
            },
            {
                原: "上九：视履考祥，其旋元吉。",
                象: ["元吉在上，大有庆也。"],
                析: "“视履，考祥其旋”者，谓自视其履行之迹，能考祸福之祥兆。此爻居《履》之终，即践行之终，凡人之所践行，善则得福，不善则得祸，治乱祸福之所歧，悉由于履行。人之所履，亦难保始终皆善，有始不善而终善者，有始善而终不善者，必观于终，然后见也。若周旋无亏，终始如一，则其吉大矣，故曰“视履，考祥其旋，元吉”。《象传》曰，“元吉在上，大有庆也”。谓君上能行此道，则大有吉庆也。元即大，吉即庆也。凡六十四卦之中，上爻系“元吉”者，不过二三卦，此爻居其一，盖上爻者，极地而多危殆也。",
                占:
                "【问时运】目下正得安乐之时，其人必素行无亏，晚运亨通，福寿双全，大吉也。\n" +
                "【问商业】往返经营，俱得大利。\n" +
                "【问家宅】祸福无门，惟人自招，若能积善，必有余庆。\n" +
                "【问疾病】恐天年有限。\n" +
                "【问失物】不寻自得。\n" +
                "【问六甲】必产贵子。\n" +
                "【问战征】大获胜捷，奏凯而旋。"
            },
        ]
    },
    {
        x:"111000",//泰
        e:{
            原: "泰：小往大来，吉亨。",
            象: ["天地交泰，后以财“成天地之道，辅相天地之宜，以左右民。"],
            彖: ["泰，小往大来，吉亨，则是天地交而万物通也，上下交而其志同也。内阳而外阴，内健而外顺，内君子而外小人。君子道长，小人道消也。"],
            析: "“泰”字，从大，从水。形以两手决水，取水从中分，流通无滞，水去而民得安居也。自昔中土，大禹治水，疏通九河，则土壤，教稼穑，奠厥民居，斯地平天成，而万民得生活于其间，永享泰平之福，是《泰》之义也。此卦《坤》上《乾》下，《坤》阴也，《乾》阳也，是天地合气，阴阳爻和，资生资始，而民物咸亨，故名此卦曰《泰》。\n" +
            "通观此卦，天气下降，地精上升，天地之气相交，始开造化之功。初九，君子得位，拔擢同气之贤者，共立朝廷，以勤劳国事，谓之“拔茅茹以其汇，征吉”。“汇”，类也，盖以同类而并进也。九二有刚中正之德，为济泰之大臣。“包荒”，谓能包容群才，即所谓“尊贤而容众”是也。然亦一于“包荒”，又必济以果决。“用冯河”取其勇敢，足以任事；“不遐遗”，谓其思虑之诚实，不惟留心于目前，且远及僻偏之域；不惟顾虑于方今，且远图长久之谋。至为国家选择人才，不涉私情，其可进者，虽仇怨而不弃，其不可用者，虽亲近而不举，谓之“朋亡”。九二之行为，公明正大，中正以应尊位，宜六五之信任不疑也，谓之“得尚于中行”。九三居阳之极，其位不中正，且值盛极将衰之时。以卦体见之，天气不能久居下，地气不能久居上，有各将复其本位之象，谓之“无平不陂，无往不复”。夫阴阳之消长，如寒暑之往来，时运使然，无如之何；然天定胜人，人亦足胜天，将陂而预防其陂，将复而预虑其复，克艰其心，贞固其守，尽其人事，以挽天运，是保泰之道也。如此则可永食其福矣。六四以阳居阴，逼近尊位，上三爻皆以虚谦接下，下三皆以刚直事上，四当上下之交，故“翩翩”相从，乐与共进，是以不徒富而从邻，不持戒而相孚也。志同道合，正《彖传》所谓“上下交而其志同”也。六五温顺之君，虚已而信任九二，降其尊而从臣，有“帝乙归妹”之象焉。用此道而获福祉，则大吉而尽善矣。上六，《泰》之终，泰极而变，有“城复于隍”之象。当九二九三之时，尽人事之孚，可以维持泰运，然怠其道以至于是，虽天运循环之自然，亦人事之所自招。上六之时，失泰之道，上下睽隔，民情离散，以兵争之，盖乱之时耳，故曰“勿用师，自邑告命”焉。盖将守其城邑，明其政教，以挽天心，拨乱而返正，亦足以保泰之终也。“平”、“陂”、“城”、“隍”，其机甚捷，其象甚危，垂诫深哉！",
            占:
            "【问国家气运】正当君明臣良，黎民安泰，是全盛之时也。然盛之极即衰之渐，否泰在天，回挽在人，所当深虑，家道亦然。\n" +
            "【问谋事】事必可成，后败须防。\n" +
            "【问婚嫁】阴阳合体，大吉之象。\n" +
            "【问商业】买卖均吉，然卖出利微，买入者利大，其象于“小往大来”见之。\n" +
            "【问年成】雨水调和，丰登之象。\n" +
            "【问六甲】有男女孪生之象。\n" +
            "【问失物】须就左右近处，寻觅自见。"
        },
        ye:[
            {
                原: "初九：拔茅茹以其汇，征吉。",
                象: ["拔茅征吉，志在外也。"],
                析: "“茹”者，草根牵连之貌；“拔茅茹”者，谓拔茅之一根，其牵连者与之皆拔也。此爻具刚明之才德而居下，六四之大臣，阴阳相应，是在野之贤才，为大臣所荐举者也。以三阳同体，一阳进而众阳共进，犹拔一茅而其茹连类而起也，故设其象曰“拔茅茹”。自古君子得位，则贤士萃于朝廷，同心协力，以成天下之泰；小人在位，则不肖者立进，以启天下之乱，是各从其类也。今初九之“拔茅”，能引荐九二九三之贤士，相共并进，故曰“以其汇”。“汇”者，类也。初九为《泰》之始，得其正位，克履怀德之道，是以吉也，故曰“征吉”。《彖》曰“来”者，谓天气之下降；爻曰“征”者，谓君子之上进。卦以气交，自上而降；爻以位升，自下而升。凡君子之学道也，修之于身，以待其时，居天下之广阔，立天下之正位，行天下之大道，欲使其君为尧舜之君，使其民为尧舜之民，是学者之夙愿也。然天命不佑，不得其志，曲肱饮水，独居陋巷，是独善其身也。然其心要未尝一日忘天下也，《象传》“志在外也”者，谓初九贤士，身虽在下，志在泽民。“外”者，指天下国家也。此爻变则全卦为《升》，《升》初六之辞曰“允升，大吉”，可以卜贤者之升进也。",
                占:
                "【问时运】有因人成事之象。\n" +
                "【问家宅】有家室团圆，人口平安之吉。\n" +
                "【问营商】得主伙合志，货财汇萃之象。\n" +
                "【问功名】有逐渐升迁之喜。\n" +
                "【问战征】以进攻获胜。\n" +
                "【问失物】宜于丛草处寻觅。\n" +
                "【问六甲】初胎者生女，三四胎则男。"
            },
            {
                原: "九二：包荒，用冯河，不遐遗，朋亡，得尚于中行。",
                象: ["包荒，得尚于中行，以光大也。"],
                析: "“荒”，如洪荒之荒，又兼荒野之义。“包”者，容也；“凭河”者，徒涉也；“不遐遗”者，不忘远也；“朋亡”者，犹坤为地之“丧朋”也；“中行”，犹曰中道也。此爻具刚明之才，秉中正之德，与六五之君，阴阳正应，匡王佐霸，是有猷有为之荩臣也。盖其雍容大度，能包容荒远之细民，抚育教诲，使无一夫不得其所；且有冯河之果断，不流文弱，故曰“包荒”、“用凭河”。自来圣贤之心无弃物，非包荒不足示天地之慈祥，非冯河不能发天地之威怒，雨露雷霆，宽严兼济，而又不弃幽遐，不私习近。九二能体此刚中之德，光明正大，符合中道，故曰“不遐遗，朋亡，得尚于中行”。治泰之道，有此四者，所谓宽则得众，信则民任，敏则有功，公则众悦；诚不失中行之德也。而其要首在于宽，故《象传》统举“包荒”二字以括之，谓其得配中行，以光大也。旨深哉！\n" +
                "为活用占筮，姑就开拓之事而言之。“包荒”者，谓荒野也。“用冯河”者，谓开垦荒地，诱导无业贫民，开道架桥，以从公役。“不遐遗”者，谓极至深山幽僻之地，越险犯阻，而开拓之也。“朋亡，得尚于中行”者，谓无朋比之私，率众而举事，得天下之爱敬者是也。盖“包荒”，仁也；“冯河”，勇也；“不遐遗”，智也；“朋亡”，公也。备此四德治天下，尚有余力，若夫有包容而无断制，则非刚柔相济之才也。不遗遐远，而或阿私党类，则偏重而失公正之体。故必包容荒秽，而又果断刚决；不遗遐远，而又不私昵朋比，则不忘远，不狃迩，是合于中道者也。《象传》“以光大也”者，谓胸次宽阔，有容人之量。“光”则其明足以有照也；“大”则其器足以有容也。",
                占:
                "【问时运】目下正当功名显达之时，可以远游海外，创兴事业。\n" +
                "【问仕途】有奉使远行，或从事军征之兆，均获吉也。\n" +
                "【问商业】利在行商，贩运外物。\n" +
                "【问失物】定坠落水中，恐难寻得。\n" +
                "【问疾病】不吉。\n" +
                "【问家宅】用人宜宽，处事宜决，不可专信仆从，致《损》家业。\n" +
                "【问战征】有怀柔远人，征伐不庭，疆宇日辟之势。\n" +
                "【问六甲】生男。"
            },
            {
                原: "九三：无平不陂，无往不复，艰贞无咎，勿恤其孚，于食有福。",
                象: ["无往不复，天地际也。"],
                析: "“无平不陂，无往不复”者，时运变迁之常，犹月满则亏，花开则落。此爻以全卦见之，正当泰运全盛之时，然玩占爻位，为阳穷阴逼，《泰》之时将终，《否》之时将至也。凡物中则平，过中必倾，天数人事皆然。《泰》至九三，天道复其上，地道归其下，君子抚泰运之极，惟当尽人事以挽回天运，是以思患预防，常惕艰危，如是则可以无咎。此爻重刚不中，互卦有《震》，居健动不止之体，健进一步，即为陂复之象。是《乾》本上也，《坤》本下也，下交上，故《乾》居内而《坤》在外。《乾》苟不安于下，必上而迫《坤》，《坤》苟不得安于上，必下而夺《乾》，故曰“无平不陂”。复而不听其复，持其平，守其往，防微杜渐，用保厥终，凡小人欲乘怠而入者，君子则弥思其难，小人欲伺隙而攻者，君子则必保其贞。其操心之危如此，则举动措置，必无有过咎也，故曰“艰贞无咎”。夫天下之事，未有不戒惧而能保其终者也，《易》之垂诫，于始终消长之机，最为深切。世运之陂复，犹日月之食也，当食霎时晦冥，过时而复光明，故曰“勿恤其孚，于食有福”。“食”即蚀也。以日月之食喻祸，而以食终而光明喻福。\n" +
                "按：六十四卦中，不拘爻之阶级，专以内外卦分时运之转迁者四卦：《泰》、《否》、《既济》、《未济》是也。此卦以内卦三阳，为《泰》中之《泰》，以外卦三阴，为《泰》中之《否》，盖以阳为有余，为实，为富，阴为不足，为虚，为贫。九三居内卦之极，遇六四而当《乾》《坤》二体之会，为《泰》中之《泰》将终，六四居外卦之始，为《泰》中之《否》将来，故于三四两爻，示时运之转变。《象传》曰“天地际也”者，“际”即交际之际，是阴阳之两交接也。",
                占:
                "【问时运】谨慎者昌，逸欲者败，最宜留意。\n" +
                "【问商业】现虽失意，后必大利。\n" +
                "【问战征】须防敌兵埋伏，宜固守，不宜进攻。\n" +
                "【问失物】不久即得。\n" +
                "【问生产】虽危无咎，必生福泽之儿。\n" +
                "【问家业】宜谨守先业，可以永保富也。\n" +
                "【问疾病】少者无咎，老者大限有阻。"
            },
            {
                原: "六四：翩翩不富以其邻，不戒以孚。",
                象: ["翩翩不富，皆失实也。不戒以孚，中心愿也。"],
                析: "“翩翩”者鸟刷羽之貌；“邻”者，指六五、上六而言。此爻在泰之时，上与二阴在外卦，皆与下应。阴柔之质，宜在下位，今居上体，志不自安，故上三爻相连，同欲下行，是上者以谦虚接下，不待告诫而自信孚，谓之“翩翩不富，以其邻，不诫以孚”。“不富”者，阴虚之象。此爻是运过中，《泰》将转《否》，为小人合志，谋害正道之时，君子所当戒也。五上皆阴，不富识量，故《象传》曰“翩翩不富，皆失实也”。“皆”者，指《坤》之三阴；“实”者，指阳爻。阴之从阳，犹贫之依富，今三阴在外，失所依也。然当泰之时，阴气上升，阳气下降，上下不相疑，兴国利，植民福，谓之“不诫以孚，中心愿也”。",
                占:
                "【问时运】喜得朋友同心相孚，诸事可谋。\n" +
                "【问商业】外则场面甚好，内实空虚，全赖同业相助，可以成事。\n" +
                "【问战征】粮饷缺乏，当劫掠敌粮，以供军需。众心坚固，有胜无败。\n" +
                "【问家业】本一富家，目下外强内弱，幸亲戚邻里，皆得有无相通，不忧匮乏。\n" +
                "【问失物】主遗落比邻之家，问之即得。"
            },
            {
                原: "六五：帝乙归妹，以祉元吉。",
                象: ["以祉元吉，中以行愿也。"],
                析: "“帝乙”者，殷纣之父也。此爻柔而居尊位，下与九二之刚，阴阳正应，恭己无为，虚心下贤，是当位之君，开太平之治者也。九二成卦之主，辅弼六五之君以成乃治，故引“帝乙归妹”，下嫁从夫，以喻圣君虚己，下礼贤臣，开国承家，永保福祉，故曰“帝乙归妹，以祉元吉”，“元吉”者，谓大吉而尽善者，即所以成治泰之功也。夫帝女之归也，非求胜其夫，将以祉之；《坤》之复下也，非欲侵《乾》，将以辅之，《彖传》曰：“上下交而其志同”者是也。又互卦有《归妹》，故与《归妹》之六五，爻辞相同。《象传》曰“中以行愿也”者，当《泰》之时，君虑《泰》极变《否》，谨慎恐惧，所愿保持之终，永享至治之福，是所谓“中以行愿也”。",
                占:
                "【问时运】目下亨通，宜谦虚柔顺，万事皆吉。\n" +
                "【问商业】宜贸达海外。吉。\n" +
                "【问家宅】得内助之贤。\n" +
                "【问婚嫁】宜远嫁远娶，吉。\n" +
                "【问六甲】主生贵女。\n" +
                "【问疾病】必得神佑，吉。\n" +
                "【问失物】拾者必自来归还。"
            },
            {
                原: "上六：城复于隍，勿用师，自邑告命，贞吝。",
                象: ["城复于隍，其命乱也。"],
                析: "“隍”者，城壕也，无水为隍，有水为池。“城”者，筑土所成，隍者辟土所成。“城复于隍”，谓其高城崩而复旧隍也。“自邑告命”，谓从下邑发命令，而告上国也。此爻《泰》之终，将转而为《否》，其象取阴弱之君，不能制阳刚之臣，而以时运之变革为辞，以示盛衰消长之机，曰“城复于隍”。当时运既衰，天命将革，君倦于政，臣工于谗，取民无制，贿赂公行，其极必起逆乱。且军旅之要，以人和为主，上六之时，世运方否，人心不和，犹冰炭之不相容也，若以兵争之，成败难知。且城已坏而不修，岂可据此以战斗乎？故戒之曰“勿用师”。至是而君德既衰，威权尽废，武功不可用，惟退而修文，远略不可图，惟退而治近，故曰“自邑告命”。盖固守城邑，明示政教，如孟子所谓效死勿去，冀得民心，以挽天运也。“贞吝”者，圣人谓其不告命于未否之前，而告命于将否之际，惜已晚矣，虽正犹可羞也，故曰“贞吝”。《象传》曰“其命乱也”者，是上下俱乱也。彼守成之君，生长深宫之中，与妇寺为伍，虽有师传，多非正士，君则骄奢淫佚，臣则阿谀逢迎，无所不至，于是下情抑郁，不通于上，君泽涸滞，不流于下，鬼蜮奸贼，惑乱其间，终至人心离散，国家倾覆，是之谓“其命乱也”。",
                占:
                "【问时运】目下气运颠倒，宜谨慎自守，须防小人播弄。\n" +
                "【问商业】宜就小做，以待时运。\n" +
                "【问战征】攻夺城地，必胜。\n" +
                "【问家宅】防有颠覆破败，宜牢稳守业。\n" +
                "【问生产】生女。\n" +
                "【问失物】恐难复得。"
            },
        ]
    },
    {
        x:"000111",//否
        e:{
            原: "否：否之匪人，不利君子贞，大往小来。",
            象: ["否之匪人，不利君子贞，大往小来，则是天地不交而万物不通也，上下不交而天下无邦也。内阴而外阳，内柔而外刚，内小人而外君子。小人道长，君子道消也。","天地不交，否。君子以俭“德辟”难，不可荣以禄。"],
            析: "“否”字从不，从口。不者弗也，弗与茀通。茀者车后之蔽障，以茀蔽口，呼吸蔽塞之会意。医书“心下痞硬”之痞亦同，即取此义也。\n" +
            "通观此卦，下三爻者《否》之时，为小人用事，上三爻者否运已极，为趋《泰》之渐。初六虽小人并进之时，亦未尝无君子，君上亦未尝不求士也。在下之君子，不忍忘君，见可进而进，故曰“贞吉”。六二，当否之时，君子固当退避，然或有枉道行权，屈身济世，如汉陈平之于诸吕，唐狄仁杰之于诸武，亦足以救否也，故曰“包承”。又“包”者，苞也，“包承”者，受苞宜也。君子处浊世，往往独立廉介之节，为小人所畏忌，不啻不能保身，且不利于国家，故有姑受小人之苞直，以晦清节也。是随流扬波之士，谓之“包承”。又有痛恨小人，而欲去之，因势有不可，姑以利啗之，以潜消其凶焰，即枉道行权之计，亦谓之“包承”。在小人而能“包承”君子，是小人中之君子也；君子受小人所“包承”，是君子中之小人也。大人当否，必不受其包，故亨。六三，小人之尤者，本欲伤害君子，尚蓄而未发，今感君子之德，内省而羞耻，故曰“包羞”。盖君子遇凶顽，使之畏，不如使之耻。九四，当阳来之初，为转《泰》之渐，上近九五，君子见泰机之已动，方将出而济否，故曰“有命无咎，志行也”。九五，明君在上，从容而体否，即中兴之君也，故曰“休否”。上九，否运倾消，已及泰来之时，故曰“倾否”。“休否”之后，又恐其正之复陷于邪，治之复入于乱，故有“系于苞桑”之戒。夫天地以好生为德，圣人以思治为心。人君而知此，必思所以杜祸患之端；人臣而知此，必思所以严邪正之辨；小人而知此，当亦知所以变也。",
            占:
            "【问时运】目下诸事不利，宜慎守，不宜妄动。\n" +
            "【问营商】宜买入，不宜卖出，隐藏待价，后可获利。\n" +
            "【问战征】不利攻，宜退守。\n" +
            "【问家业】惟宜克俭克勤，方可免祸。\n" +
            "【问疾病】是痞隔之症，宜节饮食。\n" +
            "【问生产】恐生男不育。\n" +
            "【问失物】恐不可复得。\n" +
            "【问婚嫁】有分离之象。\n" +
            "【问谋事】不成。"
        },
        ye:[
            {
                原: "初六：拔茅茹以其汇，贞吉亨。",
                象: ["拔茅贞吉，志在君也。"],
                析: "“拔茅茹，以其汇”，解见《泰》初九下。此卦与《泰》卦虽同，而别分内外，以气运变迁言之。下卦《坤》，为《否》中之否，上卦《乾》，为《否》中之泰。此内卦之三阴相连，犹《泰》内卦之三阳相连，故初爻之辞，与《泰》初爻同。惟此爻以阴柔之小人，三阴相连，一阴起则众阴并起，例如大奸得志，群奸竞进，谓之“拔茅茹以其汇”。初之时，小人恶迹未形，且与四相应，尚有改而为君子之意，故圣人不虑绝之，而教之以贞，如能祛邪从正，以道匡时，固可得吉而亨也。《象传》曰“拔茅贞吉，志在君也”，谓小人初时得位，亦未尝无忠君爱国之心，苟与君子并进，能从君子之道，即可为君子也，较之只知有身，而不知有君异矣。",
                占:
                "【问时运】吉，宜以合伙谋事。\n" +
                "【问营商】于新立商业，用人宜慎。\n" +
                "【问战征】当牵左右营，合队并进。吉。\n" +
                "【问家宅】主有亲戚同居，吉。\n" +
                "【问疾病】恐患传染之症，然无害也。\n" +
                "【问六甲】生女。\n" +
                "【问失物】可得。"
            },
            {
                原: "六二：包承，小人吉，大人否亨。",
                象: ["大人否亨，不乱群也。"],
                析: "“包承”者，谓承顺于上，下顺上，臣承君，阴为阳所包之义。“小人”，皆指占者德位，及事之大小而言。夫为臣者不一，有事人君者，有安社稷者，有天民者，有大人者，如六二则事其君而为容悦者也。此爻柔顺中正，上应九五，小人之巧者，包承容悦，以得其君之宠幸，爵禄之崇，赐予之丰，可为吉矣。然阴柔不才，当否之时，无开通闭塞，拨除骚乱之力，但与上下二阴，为阳所包。以其能包容君子，礼贤下士，藉作攀援，较与嫉正妒贤，残害君子者，固有间焉，故曰“包承，小人吉”。而在大人，则惟固守其否，穷居乐道，必不肯委曲以效其承，其身虽否，道自亨也。盖志高品洁，断不随流扬波，混入于小人之群，故《象传》曰“不乱群也”。盖可见君子处否，不失其道也。",
                占:
                "【问时运】目下顺适，能以宽容待人，万事皆吉。\n" +
                "【问商业】买卖皆利。\n" +
                "【问讼事】防有贿赂伪造等弊，始审或不利，上控则吉。\n" +
                "【问家宅】家口平安，年老家长，或恐有疾，亦无害也。\n" +
                "【问战征】必可获胜，主将或有小害。\n" +
                "【问失物】须就包裹内见之，必得。\n" +
                "【问生产】得女，产母有疾，无妨。"
            },
            {
                原: "六三：包羞",
                象: ["包羞，位不当也。"],
                析: "羞者，耻其非之谓也；“包羞”者，掩蔽羞辱也。此爻居内卦阴之极，为恶既深，既昧于审时，又短于量己。今《否》中之否既去，《否》中之泰将来，有为之士，出而图治，施其才力，正宜拨乱反正，以济国家之否也。乃六三阴柔无才，不中正而在阳位，较六二更为凶险。六二尚欲包承君子，六三则已有伤害善人之意，但当否运已转，恶势已衰，欲伤不能，见得君子，反觉自形羞耻，是以曲意掩饰，谓之“包羞”。内羞而外包，其中心之凶险，未可测矣。不言凶者，其既知羞，当必自知其凶也，《象传》曰“位不当也”者，谓其不中不正，柔居阳位，不得其当也。",
                占:
                "【问时运】目下正当好运将来之际，宜谨慎自守，以避羞辱。\n" +
                "【问商业】防内中暗有耗失，外面仍然瞒盖，以用人不当也。\n" +
                "【问家宅】恐内行不修，有墙茨之羞。又不宜以妾作妻。\n" +
                "【问战征】防为敌军所困。\n" +
                "【问疾病】防以寒包热之症，恐药不对症，宜急看良医。\n" +
                "【问讼事】恐辨护士，不得其当。\n" +
                "【问失物】防窃者含羞自尽，反致多事。\n" +
                "【问行人】防其人恋女色，一时未归。"
            },
            {
                原: "九四：有命无咎，畴离祉。",
                象: ["有命无咎，志行也。"],
                析: "“命”者，天命也；“畴”者，类也。“畴高祉”者，谓三阳同类而共受福也。此爻上近至尊，有济否之才，居济否之位，若不待君命而举事，急于图功，虽济亦不能无咎。要必奉五之命令，斯名正言顺，才力足以除奸，威权一归于上，故曰“有命无咎”。迨事平论赏，固不独为一己之功，凡与谋诸贤，皆得并受福祉，故曰“畴离祉”。“离”者，丽也；“畴”者，谓同类济否之三阳也。夙具济否之志，向以未得其时，故未行也；今则上奉君命，进而举事，乃得行其夙志，而克奏济否之功也。",
                占:
                "【问时运】目下已得盛运，随意谋事，必获利益。\n" +
                "【问商业】大得转机，但须立定意志，审度市面，从前所失，今可复得，且获盈余。\n" +
                "【问家宅】宅运已转，吉。\n" +
                "【问战征】命将出征，大吉。\n" +
                "【问疾病】命根牢固，无害。\n" +
                "【问失物】必夹入在用品物中，寻之即得。"
            },
            {
                原: "九五：休否，大人吉。其亡其亡，系于苞桑。",
                象: ["大人之吉，位正当也。"],
                析: "“休否”者，谓能休止其否运。“苞桑”者，谓桑之丛生者也。“系”，维系也，谓系之而坚牢也。此爻刚健中正，而居尊位，其才德威望，足以休否而开泰，是有德有位之大人也，故曰“休否，大人吉”。六二“大人否”，以六二之时，大人有德无位，时会未来，只得守其否。至居九五，则德位兼备，适当体否之会也。然否之方休，而泰未全复，譬如病之新愈，痛痒虽除，元气未充，苟不慎起居，不节饮食，则旧患再作，其祸更烈，危亡立见。是以休否之后，内怀敬畏之心，外尽保护之计，常恐天命之难知，人心之难保，夙夜深虑，凛凛灭亡，其虑患深，操心危，正不容一刻偷安也，庶几长治久安，可得保也，故形容其危曰“其亡其亡”。不嫌反复重述，垂诫深矣！曰“系于苞桑”，象旨以二在巽下为桑，初三与二，同类系之，令桑止于其下，无复向上而长，则根本不摇，三阳得并力休否，而启泰运也。无道之君，自谓不亡，故必亡；有道之君，常怀其亡，故不亡。《系辞传》引伸其辞曰：“安而不忘危，存而不忘亡，治而不忘乱，是以身安而国家可保也。”《象传》曰“位正当也”；六二曰“位不当”，属之“非人”，九五曰“位正当”，谓之大人，故六二日“大人否”，此则曰“大人吉”也。",
                占:
                "【问时运】目下渐入佳境，惟安而不忘危，百事皆吉。\n" +
                "【问商业】恰当绝好机会，但须改用伙友，谨慎做去，必获利益。\n" +
                "【问家宅】祖业深厚，吉。\n" +
                "【问战征】暂宜休战。\n" +
                "【问疾病】有碍。\n" +
                "【问讼事】和。\n" +
                "【问失物】防难复得。\n" +
                "【问行人】不利。\n" +
                "【问生产】大人无碍，小人难保。"
            },
            {
                原: "上九：倾否，先否后喜。",
                象: ["《否》终则倾，何可长也。"],
                析: "“倾否”者，谓倾毁否运，而渐复泰运也。此爻以阳刚之才，居《否》之极，能倾毁其否者也。九五之君，既有休否之务，上九居其后而辅佐之，鞠躬尽瘁，能恢复既坠之国运，故曰“倾否”。盖《否》《泰》本有循环之机，处《否》之极，其势必倾，否塞已尽，泰运将至。然当否之时，要不可委之天运，终当尽其人事，故九五不日否体，而曰“休否”；此爻不曰否倾，而日“倾否”，见运会之转，人力居多。夫天道开导人事，人事赞辅天道，拨乱者贵夫德，成治者在夫时。上九阳刚，而具有为之才，居否之机，又值可为之极，故能拔乱反正。从前忧苦于否塞之乱，今乃复遇康泰之盛，安宁喜乐，谓之“先否后喜。”盖往者无不还，终者无不始，是天运循环之定理。假令否之时，天地闭塞，阴阳不交，天下无道，而小人得时，一旦否倾则泰来，即天地生生之道也。《象传》曰“何可长也”，是之谓也。",
                占:
                "【问时运】亨通。\n" +
                "【问商业】春夏不利，秋冬大吉。\n" +
                "【问家宅】迁居大吉，老宅不利。\n" +
                "【问讼事】即日可结。\n" +
                "【问战征】小败大胜。\n" +
                "【问六甲】生男。\n" +
                "【问失物】即得。\n" +
                "【问疾病】即愈，但复发可虑。"
            }
        ]
    },
    {
        x:"101111",//同人
        e:{
            原: "同人：同人于野，亨，利涉大川，利君子贞。",
            象: ["同人，柔得位得中而应乎《乾》，曰《同人》。《同人》曰，同人于野，亨，利涉大川，乾行也。文明以健，中正而应，君子正也。惟君子为能通天下之志。","天与火，同人，君子以类族辨物。"],
            析: "通观此卦，上卦为《乾》，下卦为《离》。《离》本《乾》也，《坤》交于中而生《离》，其象为火。盖《乾》本元阳，火者阳之真气，与《乾》同体，故曰同。天之生人，耳同听，目同视，口同味，心同觉，一人之所是，万人同以为是，一人之所非，万人以为非，亲者同爱，长者同敬，人虽至愚，此心此志，无不同也。故孟子曰：“圣人先得我心之所同然者也”，“天之所与于我者，不异也”。盖公则无不同，一涉私欲，遂致去《离》乖僻，不可复同，然其秉彝之良，卒不可昧也。是天之所与于我，而其不可昧者，离也；不可异者，乾也。故人秉《离》之明，行《乾》之健，至公无私，自然亨通，险阻化而为平地，虽涉大川，亦无不利，是《同人》之所以亨也。观诸爻无同之象，盖凡人有意求同，便涉于私，私则不同，盖同者不言同而自同也。初九曰“于门”，谓出外无所私呢也，故“无咎”。六二曰“于宗”，虽中且正，以涉宗党之私，为可吝也。九三以刚强居二五之间，强欲求同，虽伏藏三年，终不敢兴，知惧，故不凶也。九四近五，如隔塘耳，知义弗直，弗敢强攻，则为吉也。九五刚健，应二爻明，当其未通，不胜愤郁，一旦贯通，自觉喜悦，故曰“先号咷而后笑”也。上九《遁》居郊外，无意求同，故“无悔”。合而言之，《同人》一卦，初、上二爻，“于门”“于郊”，皆在外也，故无咎悔；二有“于宗”之吝，三有戎莽之祸，五有“大师”之患，是皆同于内，故无吉者。盖“于宗”不若“于门”，“于门”不若“于郊”，“于郊”不若“于野”。总之出外则无党援，亦无阿好，地愈远而心愈公。公则平，平则通，故圣人以四海一家，中国一人为心，斯谓之大同矣。若求同于近，虽同亦私，是以《彖》辞首曰“于野”，可知《同人》之道，当以天下力量者也。",
            占:
            "【问时运】目下大有升腾之象，且得朋友扶助，大吉。\n" +
            "【问商业】宜于合资会社等业，大利。\n" +
            "【问家宅】得合家和悦之象，吉。\n" +
            "【问战征】主军士同心，即宜调兵进攻，大利。\n" +
            "【问疾病】是火症也，恐医药有误，宜别求良医。\n" +
            "【问讼事】防有同党私庇，一时未可结案。\n" +
            "【问六甲】生女。\n" +
            "【问失物】须细细于物类中寻觅，乃得。\n" +
            "【问行人】即日可归，必与友偕来。"
        },
        ye:[
            {
                原: "初九：同人于门，无咎。",
                象: ["出门同人，又谁咎也。"],
                析: "初九居一卦之始，为《同人》之首也。此卦以二爻为主。初变阴下卦为艮，象门，故曰“于门”，亦不愿独同于二，故欲出门以广交也。门以外无所私昵，故“无咎”。《象传》则颠倒其辞曰，“出门同人”，显言一出门外，天地万物，孰不吾同？不曰无咎，而曰“又谁咎也”，盖无咎，第属己言，“又谁咎”，则见门外之人，皆乐与之同，谁复得咎之者？《易》以人名卦者，《家人》《同人》两卦。《家人》者，一家之人，宜位正夫内；《同人》者，天下之人也，宜志通夫外。《易》言“出门”者，《随》与《同人》两卦，《随》曰出门有功，《同人》曰出门无咎，皆以门内为易溺于私，门外则廓然大公矣。",
                占:
                "【问时运】目下平顺，宜经营出外，利。\n" +
                "【问家宅】一门之内，雍雍和睦，无咎。\n" +
                "【问商业】利行商，不利坐贾。\n" +
                "【问疾病】宜避地调养，无碍。\n" +
                "【问讼事】防有惩役之患，宜预出躲避，可以免咎。\n" +
                "【问失物】须于门外寻觅。\n" +
                "【问六甲】即时可产，得男。"
            },
            {
                原: "六二：同人于宗，吝。",
                象: ["同人于宗，吝道也。"],
                析: "此爻以阴居阴，文明中正，而为全卦之主，卦中诸阳，皆求应二。二与九五为正应，九五为君，居一卦之尊位，二爻曰“同人于宗”，“宗”尊也，言二得同于至尊。在二与五，刚柔中正，时位相应，可谓尽善，但两相亲密，未免偏私，有失至公大同之量。且三四两爻，求同不得，见二与五，同意亲密，致生嫉妒，即所以取吝也，故曰“同人于宗，吝”。《象传》曰“吝道也”，道字最宜玩味，谓一时即未见吝，而已有取吝之道也。《彖》辞以六二得位得中，曰“亨”，爻义以“同人于宗”，曰“吝”，盖卦体主大同，爻义戒阿党也。",
                占:
                "【问时运】目下未佳，虽有相助，而相忌者多，未能百事遂意。\n" +
                "【问商业】利于大宗买卖，惟须出纳宜留意。得利。\n" +
                "【问讼事】不利。\n" +
                "【问家宅】以勤俭起家，得长子之力。\n" +
                "【问疾病】有魂归宗庙之象，凶。\n" +
                "【问行人】即返。\n" +
                "【问六甲】生女。\n" +
                "【问失物】被拾者藏匿，不见还也。"
            },
            {
                原: "九三：伏戎于莽，升其高陵，三岁不兴。",
                象: ["伏戎于莽，敌刚也。三岁不兴，安行也。"],
                析: "“戎”者，兵戎也。“莽”者，草深处也。此卦六二，一阴居中，卦中诸阳，皆欲与同。三爻接二最近，欲同之意尤切，然二爻中正，为九五正应，不与三同。三爻过刚不中，性情刚暴，位居二五之间，欲用强而同之。然惧二之中正，畏五之刚健，不敢显发，“伏戎于莽”，以俟其机，上升高陵，以窥其隙，至三岁之久，终不敢兴，亦可见小人之情状矣。其不言凶者，以久而不兴，故未至凶矣，然曰“伏”，曰“升”，其凶已露矣。《象传》曰“敌刚”也者，谓其所敌九五刚健，自知不能胜也；“安行”也者，“三岁不兴”，亦安行乎？《离》为甲，兵戎之象，互卦《巽》，为隐伏之象。此卦九三九四，不言同人者，两爻共有争夺之象，非同人者也。此爻变为《无妄》，其六三之辞曰：“无妄之灾，或系之牛，行人之得，邑人之灾”。可以见其有凶咎也。",
                占:
                "【问时运】目下直潜伏，三岁后方可出而谋事。\n" +
                "【问商业】宜开山林，三年后大可获利。\n" +
                "【问家宅】防有盗贼窃伺。\n" +
                "【问战征】须防敌军埋伏。\n" +
                "【问讼事】虑有意外葛藤，一时不了。\n" +
                "【问失物】须于丛草中寻之，或山上草中。\n" +
                "【问行人】俟三年后可归。"
            },
            {
                原: "九四：乘其墉，弗克攻，吉。",
                象: ["乘其墉，义弗克也；其吉，则因而反则也。"],
                析: "“墉”者，城垣也。此爻以刚居柔，而不中正，四与二非应，亦非比，而欲强同于二，且中间隔以九三之“墉”并忌二五粮密，故欲“乘其猜”而攻焉。既思九五刚健中正，攻之于义不直，于势亦不敌，必弗能克，故不攻也。即此转念间，悔过而改善，乃得变凶而为吉，谓之“乘其墉，弗克攻，吉”《象传》曰“义弗克也”者，谓不自逞其强，而能反省夫义，是以吉也。“困而反则也”者，谓不义之举，必陷困厄，止其邪念，而所法则也。此卦名《同人》，三四两爻，均有乖象。人情同极则必异，异极则复同，犹国家之治极而乱，乱极复治也。是人事分合之端，即《易》道循环之理也。凡《易》曰不克，皆以阳居阴之爻，惟其阳，故有《讼》，有攻；惟其阴，故弗克也。此爻及《讼》之九二九四，如“不克讼”，皆是也。",
                占:
                "【问时运】目下直退守弗动，吉。\n" +
                "【问商业】宜垄断货物，待价弗售，后必获利。\n" +
                "【问家宅】宜修葺墙垣，吉。\n" +
                "【问战征】直坚筑营磊，防敌袭击。\n" +
                "【问讼事】今虽不直，后反得胜。\n" +
                "【问失物】久后可得。\n" +
                "【问疾病】虽凶无害。"
            },
            {
                原: "九五：同人先号咷而后笑，大师克相遇。",
                象: ["同人之先，以中直也。大师相遇，了相克也。"],
                析: "“号咷”者，谓悲忧之甚而啼哭也。此爻君位，当与天下同应，若独与二亲密，非人君之道，即非大同之道也。是以为九三九四所嫉妒，隔绝阻挠，使不得与六二相遇，遂致兴师攻克，始得相遇，盖其初以不遇而号咷，今得相遇而笑乐，谓之“同人，先号咷而后笑，大师克相遇”。在五与二，刚柔相应，上下相洽，其情似私，其理本正，故《象传》明其“中直”，《彖传》称其“中正”，是师壮而得克也，岂得以私匿病之哉！\n" +
                "又一说：长国家而欲和同众人，其间有猜疑而离间者，使之隔绝而不相遇，极之号咷悲泣，使离间者亦服其德，复得和同而笑乐也。",
                占:
                "【问时运】目下正当欢乐之时，从前苦志，今得遂愿。\n" +
                "【问商业】虽小有挫折，终获大利。\n" +
                "【问家宅】防有惊惶之虑，然终得平和也。\n" +
                "【问疾病】先危后安。\n" +
                "【问讼事】须请大好辩护士，方能得直。\n" +
                "【问行人】防中途有阻，须缓得归。\n" +
                "【问六甲】生男。"
            },
            {
                原: "上九：同人于郊，无悔。",
                象: ["同人于郊，无悔。"],
                析: "“郊”者，国都之外，旷远之地。此爻在五爻之上，为无位之地。《同人》一卦，卦中五阳皆欲同于六二一阴，三爻与二相比，其欲同之意尤切。四爻非应非比，然以介在二五之间，亦欲强同于六二。五爻与二为正应，惟此爻居上，与二非应非比，孤介特立，置身荒郊之外，较初之于门更远。无私匿之情，免争夺之患，在六爻中，最为完善，谓之“同人于郊，无悔”。盖《同人》之量，“愈远则愈大，国外曰郊，郊外曰野，“于郊”较野殊近，故“于野”则亨，于郊”则第曰“无悔”。《象传》曰“志未得也”，志即“为能通天下之志”而言，其仅曰“于郊”。犹未能通天下之志也，故曰“志未得也”。\n" +
                "此卦为归魂之卦，若占命数而得此卦，至上爻必死。《师》之上爻，可参看也。",
                占:
                "【问时运】目下顺适，诸事无所障碍，但宜在闲散之地。\n" +
                "【问商业】宜立业于市尘之外，无忧耗损，一时亦未能获大利益。\n" +
                "【问战征】宜在荒地屯营。\n" +
                "【问失物】于郊外觅之。\n" +
                "【问讼事】恐难得直。\n" +
                "【问家宅】平顺无灾。"
            },
        ]
    },
    {
        x:"111101",//大有
        e:{
            原: "大有：元亨。",
            象: ["火在天上，大有，君子以遏恶扬善，顺天休命。"],
            彖: ["《大有》，柔得尊位，大中而上下应之，曰“大有”。其德刚健而文明，应乎天而时行，是以元亨。"],
            析: "通观此卦，以五阳函一阴，一阴具离明之德，升五爻之天位，诸阳崇之，天子富有四海之象也。《比》卦以一阳统五阴，受《师》之后，宜继乱用刚；此卦一阴统五阳，受《同人》之后，宜继治用柔。《离》火为阳精，与天同体，天体高而火炎上，高明无极。上九“自天佑之，吉无不利”者，为君同于天之象。六爻皆以贡上为义，初为民，二为臣，三为诸侯，四为辅政之大臣，五为天子，上为天人。天子富有天下，天下百物之利，九壤之赋，皆天之所生。五者天之子也，以天之物，养天之子，造化之定理，谁得而干之！士君子涉世饮啄皆天也，况其大者乎？此《大有》之占也。",
            占:
            "【问时运】目下亨通，如日在天上，有光明遍照之象。\n" +
            "【问商业】可放胆大做，有富有日新之象。\n" +
            "【问家宅】必是祖基素封，积善之家，宜诫劝子弟，培植善根，家业可永保也。\n" +
            "【问战征】主将星明耀，赏罚得中，万军用命之象。\n" +
            "【问行人】必满载而归，大利。\n" +
            "【问六甲】生男。\n" +
            "【问疾病】不利。\n" +
            "【问讼事】主公明断结，否则亦必和息。"
        },
        ye:[
            {
                原: "初九：无交害，匪咎，艰则无咎。",
                象: ["《大有》初九，无灾害也。"],
                析: "“交害”者，涉害也。九居一卦之初，虽卦属富有，初阳在下，未与物交，所以未涉于害也，何咎之有？凡处富有之时，易致自满，满则骄生，骄生则害即随之，有害即有咎。惟时时克思厥艰，斯小心敬惧，有而不自以为有，即出而无相交，必矢刻苦自劝之心，不敢稍存骄盈之念，故曰“艰则无咎”。盖富有本非有咎，在初时未交于害，以为“非咎”，则一交而遂得咎者，咎由自取之耳。能思其艰难，则可以保其有，即可以免其咎。《象传》曰“《大有》初九”，言当《大有》初爻，无所交涉，不关灾害也。一说，训“无交害”三字，为国无交而害者，盖以初九之应在九四，两刚相遇，其情不相得。此意亦可备一解。",
                占:
                "【问时运】目下尚未交盛运，须刻苦自勉，待好运到来，自然得利。\n" +
                "【问商业】想是基业初创，百货未曾交办，须要谨守其初，自得无害而有利也。\n" +
                "【问战征】必是初次动众，尚未交锋，须要慎始，自无后患。\n" +
                "【问家宅】必是新富之家，艰难创业，自得后福。\n" +
                "【问讼事】尚未投告，还宜和息为善。\n" +
                "【问行人】尚未有归志也。\n" +
                "【问六甲】生男，产期尚远。\n" +
                "【问失物】一时难以即得，待久可有。"
            },
            {
                原: "九二：大车以载，有攸往，无咎。",
                象: ["大车以载，积中不败也。"],
                析: "此爻以阳居二，阴阳刚柔，适得其宜。当大有之时，居臣下之位，上应六五之君，是具大有为之才，遇大有为之时，以一身而任国家之重者也。二阴柔，是以能容，九阳刚，是以能行，象车。初、三两刚，比辅于左右，为“大车”，故曰“大车以载”，谓其才之足以任重而行远也。二以刚中之德，恢有容之量，能以天下之人才，属之于群，量才器使，俾得各效厥职，而无有丛脞，故曰“有攸往，无咎”。占者如此，则位足以酬其志，德足以堪其任，上不负君之所托，下不失民之所望，何咎之有？《象传》曰“积中不败也”者，言大车得初三左右两刚比辅，车体完厚，虽积重于中，行远而不败，犹九二才力刚强，能肩当天下之重，断无败事之虞也。此爻变则为《离》，《离》六二辞曰，“黄离，元吉”，可以参考也。",
                占:
                "【问时运】目下正交好运，一路顺风，无往不利。\n" +
                "【问商业】贩运货物，贸迁有无，极之域外通商，无不获利。\n" +
                "【问战征】利于陆战，率军直进，攻取皆捷。\n" +
                "【问家宅】平安无咎，若谋高迁，更吉。\n" +
                "【问疾病】宜出外就医，吉。\n" +
                "【问行人】因在外谋事，诸多利益，一时未归。\n" +
                "【问讼事】得胜。\n" +
                "【问六甲】生男，逾月则生女。"
            },
            {
                原: "九三：公用亨于天子，小人弗克。",
                象: ["公用亨于天子，小人害也。"],
                析: "“亨”与享同。“公用亨于天子”者，谓天子设筵，宴会公侯也。九三与之，此爻居下卦之上，公侯之象。九五之君，虚己下贤，一时四方公侯，感化来宾，如《诗》所咏“喜宾安乐，寥获湛露”之义是也，故曰“公用享于天子”。盖诸侯之于天子，藩屏王家，天子喜其功，宴享而劳之。此爻以阳居阳，具纯正之才德，可得与此宠荣，若使小人当此，捧富有，擅威福，慢上凌下，必招祸患，安得与享礼之优待乎？上无比应，君上必不信任，故曰“小人弗克”，《象传》亦曰“小人害也”。\n" +
                "一说“享于天子”者，谓能以所有贡奉于君上。凡土地之富，人民之众，皆天子之有也，诸侯谨守臣节，忠顺奉上，抚育黎庶，以效屏藩，丰殖货财。以资贡献，享之天于，以其有为天子之有也。若小人而居此位，则私有其富，不复知奉公之道，故曰“小人弗克”。此义亦通。\n" +
                "按：凡《易》辞曰“先王者，以垂统言；曰“帝”者，以主宰言；曰“天子”者，以正位言；又“后”者，天子诸侯之通称；“大君”者，天子之尊称也。",
                占:
                "【问时运】目下正当显荣之时，利为公，不利营私。\n" +
                "【问仕途】恰得宠任荣赏之象，若取赂必败，宜慎。\n" +
                "【问商业】不特得利，且可得名。\n" +
                "【问战征】有犒赏三军之象，得获胜仗，恐于兵众有《损》。\n" +
                "【问家宅】有喜庆宴会之象，家食丰富，但使用婢仆中，须当留意。\n" +
                "【问讼事】若为饮食起衅，恐难得直。\n" +
                "【问六甲】生男。主贵，但幼小时，防多疾厄。"
            },
            {
                原: "九四：匪其彭，无咎。",
                象: ["匪其彭，无咎，明辨析也。"],
                析: "“彭”者，盛多貌。《诗》曰“行人彰彭”，曰“出车彭彭”，曰“驷彭彭”曰“四牡彭彭”皆形容人马之强盛也。此爻以刚居柔，当《大有》之时，在执政之位，有刚明之才德，立众贤之上，与六五之君，阴阳亲比，君上之眷顾至渥，宠遇殊盛，所谓位极人臣，威权富贵，萃于一身，是处过盛之势者也。过盛则可危，惟能体《离》之明，居柔善逊，见几而避，虽处其盛，以为非已之盛也，故曰“非其彭，无咎”。《象传》释“无咎”曰，“明辨析也”，“析”者明之体，“明辨”者，得外卦《离》日之象。\n" +
                "一说以“匪”为篚，此爻威权之盛，天下之人，辐辏其门，非无赠贿之嫌。身居大臣之地，运值《大有》之时，琐琐赠贿，何足动其心乎？是谓“非其彭，无咎”。《易》之取象广大，不容偏执一义也。",
                占:
                "【问时运】六爻已值其四，是目下已到极盛之会，当持盈保泰，知止不辱。\n" +
                "【问商业】已得利益，毋过贪求，斯无害。\n" +
                "【问家宅】必苟完苟美，如卫公子荆之居室，则善矣，否则未免盈满有损。\n" +
                "【问疾病】防有膨胀之患。\n" +
                "【问六甲】生男。\n" +
                "【问讼事】得明决之才，判断得直。\n" +
                "【问失物】在竹篚内寻之。"
            },
            {
                原: "六五：厥孚交如，威如，吉。",
                象: ["厥孚交如，信以发志也；威如之吉，易而无备也。"],
                析: "“孚”者，所以通上下之情；“威”者，所以严上下之分也。情不通则高，分不严则亵。“交如”者，交接之义；“威如”者，威严之义。孔子曰，“正其衣冠，尊其瞻视，俨然人望而畏之”，此之谓也。此爻以柔中居尊位，虚心礼贤，下应九二，上下五阳，皆归其德，故曰“厥孚”。明良一德，朝野倾心，如良友之善交，故曰“交如”。然君心贵和，而君体贵尊，所谓有仪可象，有威可畏，故曰“威如”。盖《大有》之世，在下者有协助之志，在上者又能诚信接下，足以感发之，故《象传》曰“信以发志也”。又《象传》曰“易而无备也”者，六五居群刚之间，独用柔道，未免为人所易慢，而无畏怖之心也。",
                占:
                "【问时运】必其平生为人所信服，且有威望，晚运亨佳之会也。\n" +
                "【问商业】一时众商信服，货物通行，可永保其富有也。\n" +
                "【问战征】众军勇跃，威令远扬，尤宜警备，以防敌军。\n" +
                "【问家宅】主一家和睦，恐有盗窃，宜备防也。\n" +
                "【问失物】所窃者即信用之人，以威逼之，必交还也。但恐得而复失。\n" +
                "【问六甲】生男。\n" +
                "【问讼事】被告者必畏威而和。\n" +
                "【问行人】如期而归。"
            },
            {
                原: "上九：自天祐之，吉无不利。",
                象: ["《大有》上吉，自天佑也。"],
                析: "此爻居《大有》之极，不居其有者也。以刚在六五国君之后，可谓尽人事而待天命者也，是贤师付也。为能则天道，以计划国政，使《大有》之君，应天时，统万机，积德行，享有全盛之福。此非“自天佑之”，岂能享其有哉！所谓不期而自致者。当此时得天助之，凡百事业，无不吉利，故曰“自天佑之，吉无不利”。夫圣人之作《易》其要在天助人归，如云“天之所助者顺也，人之所助者信也”。此爻之辞，可谓一言足以蔽三百八十四爻也。",
                占:
                "【问时运】目下一路好运，万事皆吉。\n" +
                "【问商业】百货皆获利。\n" +
                "【问家宅】一门福庆。\n" +
                "【问战征】即此一战，军功大捷，可罢师也。\n" +
                "【问行人】即归。\n" +
                "【问疾病】默得神佑，吉。\n" +
                "【问六甲】生男。\n" +
                "【问失物】就高处寻觅，可得。"
            }
        ]
    },
    {
        x:"001000",//谦
        e:{
            原: "谦，亨，君子有终。",
            象: ["地中有山，谦，君子以裒多益寡，称物平施。"],
            彖: ["谦亨。天道下济而光明，地道卑而上行。天道亏盈而益谦，地道变盈而流谦，鬼神害盈而福谦，人道恶盈而好谦。谦尊而光，卑而不可逾，君子之终也。"],
            析: "通观此卦，《谦》者兼也，卑而能尊，故曰兼。六爻之象，下《艮》上《坤》，《艮》止《坤》顺，能止而不上，所以“谦”也。夫造化之理，不足者常益，有余者常损。君子以不足留有余，以有余待不足，故有余者终不至过盈，不足者终不至大损。此两兼之道，称平之权也。诸卦以第三爻为凶地，惟《谦》能保终；诸卦以第五爻为尊也，惟《谦》独用武。盖以《谦》为主，则卑者尊；以无为盈，则高者危；以平为福，则盈者留，是“裒多益寡”之理也。下卦三爻，皆吉而无凶，上卦三爻，皆利而无害。为君而利，为臣面亦利；处常而吉，涉险而亦吉；平治利，即勘乱而亦利。爻象初六《谦》之始，“卑以自牧．也”。六二《谦》之中，积中以发也。九三《谦》之至，以功下人也。六四《谦》之过，不失其则也。六五《谦》之尊，以武服柔也。上六《谦》之极，反而自治也。盖自初至三，自谦而进之；自四至上，自谦而反之。进至三而止，能济险，能扬善，能立功，一以谦行之，有以触退之象；反至六而止，能顺则能服人，能克己，自上反下之象。盖其谦也，非以不足而谦，正以有余而用谦也。故君子之谦，非委靡也，器大而识远，基厚而养定。震世之事功，处之以虚怀，及其当大任，决大疑，勘大乱，翦大恶，世之退诿所不敢任者，君子未常不兼任之也。有可为之才，而不敢为，象山之止，不得不为而后为，象地之顺，谓之“君子有终”也。",
            占:
            "【问时运】目下平顺，有步步渐高之象。\n" +
            "【问商业】物价均平，利益顺适，此业可保永远。\n" +
            "【问家宅】此宅想近山麓，家道平顺，大利。\n" +
            "【问战征】营屯宜近山，须整齐队伍，严明赏罚。至五爻进师，六爻可以攻取城邑，大胜。\n" +
            "【问讼事】宜平和，不宜纷争。\n" +
            "【问疾病】是内郁之症，宜宽怀调治。\n" +
            "【问行人】舟行而归，吉。\n" +
            "【问失物】须于积土中寻见。\n" +
            "【问年成】风雨调顺，在不丰不歉之间，平平。"
        },
        ye:[
            {
                原: "初六：谦谦君子，用涉大川，吉。",
                象: ["谦谦君子，卑以自牧也。"],
                析: "此爻柔而居《谦》卦之初，是《谦》中之谦者，为笃行之君子，而在下位者也。克善其始，知必克全其终也，故曰“谦谦君子”。大凡涉江海之险，轻率急进则多失，宽容缓济则无患，故曰“用涉大川，吉”。“用涉”与“利涉”不同，“用涉”者，谓用谦道以涉之，不言期其利，而要无不利者也，故吉。《象传》曰“卑以自牧也”者，正以释“用涉大川”之义。“牧”者，驯养六畜之名。夫牧牛马，守之不使奔逸，君子之牧心，亦犹此也，能安其卑，不与人争先。此爻变则为《明夷》，《明夷》之初九，有垂翼之辞，君子涉难之象。但“卑以自牧”，不求闻达，则大难可以涉，所以吉也。又互卦（二三四）有《坎》，大川之象。一说牧为郊外之地，大川在郊外，故曰“用涉大川”。",
                占:
                "【问时运】目下万事亨通，利涉大川。\n" +
                "【问商业】经营之始，宜谦逊谨慎，可获宏利。\n" +
                "【问家宅】辛苦起家，积资成富，家业可长保也。\n" +
                "【问疾病】明夷之伤。\n" +
                "【问失物】失而不可得。\n" +
                "【问六甲】生女。\n" +
                "【问讼事】彼此耗费，必有一伤。\n" +
                "【问功名】可成事。"
            },
            {
                原: "六二：鸣谦，贞吉。",
                象: ["鸣谦贞吉，中心得也。"],
                析: "此爻柔顺中正，与三相比，与五相应，服三之刚，从五之柔，并用《谦》退之道，故得令闻传于远近，世人盛称其德，谓之“鸣谦，贞吉。”“鸣谦”者，非自鸣其谦，谓谦德积中，必闻于外，名誉彰著，而人皆知其谦，称为谦德之君子也。誉称其情，非自我而干誉，名符其实，非向人以沽名。谦者德之本。六二者，臣位也，人臣而过谦，恐流佞媚之嫌，惟其贞而正，故吉也。《象传》“中心得也”“中心”者，谓积中而发也。",
                占:
                "【问时运】目下名称藉藉，定多得意。\n" +
                "【问商业】得利。\n" +
                "【问家宅】家中积产富足，外面名声亦好。\n" +
                "【问战征】可鸣鼓直前，攻取中营，大捷。\n" +
                "【问疾病】是用心过劳之症。\n" +
                "【问功名】有必得之喜。\n" +
                "【问讼事】鸣冤得伸。\n" +
                "【问失物】即得。\n" +
                "【问六甲】生女。"
            },
            {
                原: "九三：劳谦，君子有终，吉。",
                象: ["劳谦君子，万民服也。"],
                析: "此爻以一阳居众阴之中，众阴皆顺之，有一人信任，万民归服之象。盖三爻为成卦之主，大公无我，人好其德，未尝期人之服，而人自服之。且民为身，互卦二三四为《坎》，《坎》为险难，三四五为《震》，《震》为动，为知惧。身在险难，动而知惧，所谓有劳而不自居其劳者，故曰“劳谦”。爻以一阳居下卦之上，位高而责重，处己而求贤，有吐哺握发之风，《系辞》所云劳而不伐，有功而不德者也。其器度之大，识量之高，是足令天下众民畏服，如此则天下无与争功者，其位可终保矣，故曰“君子有终，吉”。以《乾》九三之君子，入《坤》而为《谦》，故《谦》之三，亦曰“君子”。《艮》者万物成终之象，故曰“有终”。变而之《坤》，《坤》六三曰“或从王事，无成有终”，是可见其《谦》之德也。",
                占:
                "【问时运】一生劳苦，目下万事亨通，老运更佳。\n" +
                "【问商业】经营之始，百般勤劳，今基业已成，可以永远获利。\n" +
                "【问家宅】必是辛苦起家，积资成富，能复持盈保泰，家业可长保也。\n" +
                "【问疾病】恐病成劳弱，天命有终。\n" +
                "【问失物】后可复得。\n" +
                "【问六甲】生男。\n" +
                "【问讼事】枉者自服，即可了结。\n" +
                "【问功名】得此劳绩，自必《升》用。"
            },
            {
                原: "六四：无不利，撝谦。",
                象: ["无不利，撝谦，不违则也。"],
                析: "此爻居大臣之位，上戴柔顺谦德之君，下有劳谦大功之君子，己处其中，位得其正，故上无所疑，下无所忌，《谦》之善者也，故曰“无不利”。然以阴居阴，德不及五，功不及三，不敢自安，动作施为，无在而不“撝谦”。“撝”字，注作挥，《本义》作发挥，撝与挥本通，即《文言》“六爻发挥”之挥，谓发越挥发也。《象传》释之曰“不违则也”。“则”者，法则也，谓其发挥《谦》德，能合夫法则也。《尚书·〈泰〉誓》曰，如有一臣，断断兮无他技，其心休休焉，其如有容焉。人之有技，若己有之，人之彦圣，其心好之，不啻如自其口出，实能容之，以保我子孙黎民，尚亦有利哉。亦可见其发挥休休有容之度也。若无功而受其禄，无实而窃其名，是失其则矣。\n" +
                "一说此爻在大臣之位，初六“谦谦”，如一味谦虚，未免反失权势，恐开轻蔑之渐，故戒之曰“撝谦”。盖谓谦而违其则，必招轻侮，惟不违其则，斯为之“撝谦”也。",
                占:
                "【问时运】目下正当好运，万事吉利。\n" +
                "【问商业】任从指挥，无不获利；凡买卖但宜留些余步为好。\n" +
                "【问家宅】盍家以谦和作事，事事吉利。\n" +
                "【问战征】指挥如意，必得大捷。\n" +
                "【问疾病】宜表散之，吉。\n" +
                "【问六甲】生女。"
            },
            {
                原: "六五：不富以其邻，利用侵伐，无不利。",
                象: ["利用侵伐，征不服也。"],
                析: "“不富”者，谓不以己之爵位为富，即谦逊之意。本《虞书》“臣哉邻哉”，邻即臣也。“以其邻”者，谓愿与臣邻同心图治，亦即德必有邻之义也。此爻居尊位，有柔中之德，以为温恭克让之君。为君而能谦顺，不以崇高自满，则天下之人，莫不归心焉，是谦德之至也。然谦虽美德，专尚柔和，或致有轻慢而不服者，故柔宜济以刚，则“利用侵伐”，威德并著，然后能怀服天下，安往而不利哉！故曰：“不富以其邻”，“利用侵伐，无不利。”谦柔之过，或失威武也，圣人故发此义，防其过。一说九三一爻，以全卦言，为劳谦之君子；自六五而言，为过刚不服之臣。《易》之取象，变动而不拘如此。\n" +
                "《大有》六五，以不自有而能有人，《谦》之六五，以不自用而能用人，《谦》之用，可谓大也。\n" +
                "（附言）山入地中，地变也，有地脉陷落之兆。余十七岁时，与静冈藩士早川和右卫门氏相知，时氏已八十余岁，语余以少时之事。天明年间，该氏修文武之业，经历诸国，时或卖卜，以充旅费。一年夏，偶至羽州象泄辏，船舶辐辏，风景奇绝，为北海之大辏，氏留此数旬。一日午后，结发于旅店楼上，见室内船虫婚聚，初疑为此地常有，问旅店主，答曰：未尝有也。转顾左右壁上天井，悉皆船虫，因益骇异。筮得《谦》之《蹇》。此卦山入地中，有地陷之象，《易》爻经验，未尝或爽，然如此大数，未可妄言告人，惟中心畏惧，急切收拾行李而行。时已将暮，主人劝留明朝，不听，提灯直发。山路险恶，至夜半，渐行四里许，猛闻山谷震荡，神魂惊骇，伏地傍惶。既而震息，灯火已灭，昏黑不能行，踌躇无计，远远闻有人马之声。往前问之，答以因惊受地震，驮倒货覆也。于是谓马丁曰：黑夜难以前往，不如焚火，以待天明，众皆以为然。迨晓，见有赍飞信过者，问之曰：昨夜地大震，象泻辏变陷成海，其他山谷倾倒，顿改旧形，闻之毛发悚然。《易》爻之昭示未来，灵应如此，益为惊服，至今追思，心犹凛凛。推之古老传言，洪水之年，獭凿穴于高处；大风之年，鸟不巢于乔木之梢；昔江户有大火灾，前数夜，鼠连绵结队，转渡桥栏之外，避就他处。他如老狐能知未来，鹊知前吉，鸦知前凶，皆有令人所不可解者。蠢然动物，尚感天地，预知祸福，人为万物之灵，不克前知，可谓人而不如禽兽者也。",
                占:
                "【问时运】目下虽处正运，然或有龃龉，宜自振作，不可一味姑息也。\n" +
                "【问商业】所获利益，防为他人分取，致生事端。\n" +
                "【问家宅】能以择邻而处，自得守望相助之义。\n" +
                "【问婚姻】得邻近之女议婚，大利。\n" +
                "【问疾病】利用消伐之剂，吉。\n" +
                "【问讼事】宜取邻人作证，得直。\n" +
                "【问失物】于邻家觅之，得。"
            },
            {
                原: "上六：鸣谦，利用行师，征邑国。",
                象: ["鸣谦，志未得也。可用行师，征邑国也。"],
                析: "此爻不中而在上卦之极，即处《谦》之极。处极谦之地，而未得其志，所谓不得其平则鸣，故曰“鸣谦”，与六二之“鸣谦”，诚中而发者，辞同而义异。六以柔处柔，柔而未得其志，不能不济之以刚，故曰“利用行师，征邑国”。《象传》换“利”字以“可”字，可者，谓当其时之可，可则用，不可则已。上六之用师，岂得已乎？故断曰“可”。然邑国属己之小国，上六才柔，未足克大敌，力柔不足兴王师，是以有不能昭神武于天下，振王威于华夷之意。《象传》曰“志未得也”，中心未得之意，亦可见也。《豫》之利行师，用其顺而动也；《谦》之利行师，用其顺而止也。",
                占:
                "【问时运】盛运已过，目下未见得意。\n" +
                "【问商业】有名无实，宜整顿旧业。\n" +
                "【问家宅】防有怪祟，时作响动，用法镇压治之。\n" +
                "【问疾病】宜自调养心志。\n" +
                "【问六甲】生女。"
            }
        ]
    },
    {
        x:"000100",//豫
        e:{
            原: "豫，利建侯行师。",
            象: ["豫，刚应而志行，顺以动，豫。豫顺以动，故天地如之，而况建侯行师乎？天地以顺动，故日月不过，而四时不忒；圣人以顺动，则刑罚清而民服。豫之时义大矣哉！","雷出地奋，豫。先王以作乐崇德，殷荐之上帝，以配祖考。"],
            析: "按：“豫”字从象，从牙，左旁之牙垂地，象之大者也。象性柔缓，进退多疑，以其外行安舒，一俯一仰，而不抑藏，故以安舒不抑藏为豫，遂以《豫》名卦。卦体《坤》下《震》上，《坤》下顺而载乎上，《震》上动而振乎下，盖谓扬舒于外，而不抑藏于内，是以为《豫》也。《豫》与《谦》对，《序卦》曰，“有大而能《谦》必《豫》，故受之以《豫》”，此《豫》所以次于《谦》也。\n" +
            "通观此卦，其要旨不出“顺以动”三字。凡顺之至者，不动则不悦，动而顺应，故悦。未顺则不先，既顺则不后，由气机之自然而已。豫之时心劳意足，其乐已极，处乐之极，遂至纵情逸欲，流连忘返，亦恒情所不免也。圣人忧之，故未《豫》而先者为“鸣豫”，不动者为“介”豫，坐而观者为“盱”，当豫而顺者为“由，”过豫而不忘者为“疾”，极豫而忘返者为“冥”。在初爻则戒其“穷”，在六三则警其“悔”，在六五则防其“疾”，在上六之“渝”，则危不可长，幸其终改。“鸣”、“盱”、“疾”、“冥”四者，居《豫》之咎，所谓失豫者也。惟六二之“介于石”，为能熟察忧乐治乱之机，故顺莫善于“贞”，动莫善于“由”，“贞”以待顺，“由”以行动，由未豫而豫必至，既豫而豫不忧。天地圣人之悦豫无疆者，惟其能处乎豫也。读此卦而圣人谆谆于世之意，可见矣。",
            占:
            "【问时运】目下如春雷发动，正得时会，万事皆吉。\n" +
            "【问商业】时当新货初到，市价飞腾，绝好机会，必得大利。\n" +
            "【问家宅】防有变动，宜礼神祭祖，以祈福佑，得安。\n" +
            "【问疾病】宜祷。\n" +
            "【问战征】雷厉风行，必胜之兆。\n" +
            "【问功名】所谓平地一声雷，指日高升之象。\n" +
            "【问失物】自然出现。\n" +
            "【问六甲】生男。"
        },
        ye:[
            {
                原: "初六：鸣豫，凶。",
                象: ["初六鸣豫，志穷，凶也。"],
                析: "“鸣豫”者，自鸣得意之谓，悦豫之情动于心，而发于声者也。初爻阴柔不才，居最下之位，与四相应，恃其爱眷，心满意溢，不胜其悦，应而自鸣，其凶可知也，故曰“鸣豫，凶”。《象传》曰“志穷，凶也”。“穷”谓满极，初才得志，便为满极，盖时方来而志已先穷矣，故凶。一说穷在凶下，谓志凶穷也。\n" +
                "按：《豫》初六，与《谦》上六相反，《谦》上曰“鸣谦”，应九三而鸣也；《豫》初曰“鸣豫”，应九四而鸣也。鸣人之谦吉，鸣己之豫凶，故曰：“《谦》可鸣。《豫》不可鸣也。”",
                占:
                "【问时运】初运颇佳，但一经得意，使尔夸张，以致穷也。\n" +
                "【问商业】初次必得利，不可过贪。\n" +
                "【问家宅】恐鸟啼猿啸，致有怪异之惊，凶。\n" +
                "【问疾病】不利。\n" +
                "【问讼事】鸣冤不直，宜自罢讼。\n" +
                "【问失物】不得。"
            },
            {
                原: "六二：介于石，不终日，贞吉。",
                象: ["不终日，贞吉，以中正也。"],
                析: "“介于石”者，谓操守坚固，而不可移动也。夫逸豫之道，恣则失正，故《豫》之诸爻，多不得正，惟此爻以中正居阴，其与九四之刚，非应非比，有自守独立之操，其节之介，犹石之坚也。夫人之处豫也，或洋洋而自得，或恋恋而不舍，或昏迷而不悟，是皆失其正中矣，遂致豫方来而祸即随之，世之不知自守者，往往如此。六二独节操坚固，不为外物所动，知豫乐之不可恋，而去之不待终日，其察理甚明，其操身甚固，其审几甚决，其避患甚速，故曰“介于石，不终日，贞吉”。“介”者，坚确不拔之谓，所谓“不以三公易其介”者是也。惟其能介，是以中正也，《象传》曰“以中正也”；惟“以中正”，故能辨之明，知之速也。按此爻互卦为艮，《艮》为石，故有“介于石”之象。",
                占:
                "【问时运】其人品行高尚，不随世为隆汙，吉。\n" +
                "【问商业】能决定己志，不为奸商摇惑，贩运快速，获利。\n" +
                "【问家宅】主家者宜严正持之，凡非人来往，速宜斥绝。吉。\n" +
                "【问战征】所谓守之如山，发之如火，能审机也。\n" +
                "【问疾病】新疾即愈，夙疾即亡，终日间也。\n" +
                "【问六甲】生女，即产。"
            },
            {
                原: "六三：盱豫，悔，迟有悔。",
                象: ["盱豫有悔，位不当也。"],
                析: "“盱”者，为张目企望之象，譬如见乌之飞，仰瞻太空，见鱼之泳，俯眄深渊，不胜眷恋，故曰“盱豫”。六三阴居阳位，不中不正，其所盱者，盖上视九四之权势，而欲趋附之也。九四为一卦之主，居大臣之位，独擅威福，众阴皆归附之，六三是以惟盱瞻视，欲冀攀援，以固豫悦，谓之“盱豫”。九四以其窥探窃视，不得中正，为所鄙弃，是以有悔也。既知其悔，当翻然立改，效六二之介，决意远避，不俟终日，悔复何有？若一念以为悔，一念以为豫，迟疑不决，流连不返，悔必难免矣，故曰“悔，迟有悔”。“迟”之一字，可谓当头一棒，提醒昏昏，教其及早审悟也，最当玩味。《象传》曰“位不当也”，谓其柔居阳位，优柔不决，不当其位也。此爻变则为《巽》为不果，故知悔而犹不改，有迟疑不决之象。",
                占:
                "【问时运】目下运非不佳，在自己作为不正，是以有悔。\n" +
                "【问商业】能窥探商情，为商家之能事，然一得消息，卖买宜决，若一迟疑，便落人后。\n" +
                "【问家宅】须防窃盗，宜速警备。\n" +
                "【问失物】速寻则得，迟则无矣。\n" +
                "【问讼事】宜速了结。"
            },
            {
                原: "九四：由豫，大有得。勿疑，朋盍簪。",
                象: ["由豫，大有得，志大行也。"],
                析: "九四以一刚统率众阴，为一卦之主，凡众阴之所豫，皆由九四之豫而为《豫》，故曰“由豫”。四近五，居大臣之位，承柔弱之君，负天下之重，包容诸柔，独得倚任，任大责重，故曰“大有得”也。但当此信任过重，易致招疑，惟能开诚布公，自然无复疑虑矣。“勿疑”，乃能率众柔以奉上，犹如簪之贯众发而不乱也。“盍”，合也；“朋”，即众柔也。四刚而位居阴，犹得与诸柔相类为朋，故曰“勿疑，朋盍簪”。夫疑则生隙，隙则生忌，忌则众情离散，百事丛脞，虽有安豫之鸿业，必不能得其终也，故戒以“勿疑”。斯猜疑悉绝，上下同心，秉至诚以图事，合群力以从公，众贤汇萃，德泽宏施，足以成天下之豫者，斯之谓欤？《象传》曰“志大行也”，即所谓得志则泽加于民，功施于后。大道之行，可由豫而致也，庶乎交泰之道矣。此卦自初爻观之，为权臣，其豫者逸豫也；自四爻观之，为任政之贤臣，其豫者和豫也。《易》道之变动不居如此。",
                占:
                "【问时运】目下正大运方通。\n" +
                "【问商业】会萃众货，大得利也。\n" +
                "【问家宅】门庭豫顺，得财得福，大有之家。\n" +
                "【问功名】即卜弹冠之庆。\n" +
                "【问讼事】由此罢讼，两造豫悦。\n" +
                "【问行人】必主满载归来。\n" +
                "【问出行】由此前行，一路顺风，大得喜悦，可“勿疑”也。\n" +
                "【问六甲】生男，易长易成，且主贵。\n" +
                "【问失物】即得。"
            },
            {
                原: "六五：贞疾，恒不死。",
                象: ["六五贞疾，乘刚也；恒不死，中未亡也。"],
                析: "“贞疾”者，痼疾，谓不可愈之疾也。上下耽逸乐，即“贞疾”之症。此爻柔中而居尊位，信任九四，九四阳刚得权，众皆归之，六五柔弱之君，受制于专权之臣，欲豫而不能自由，战兢恐惧，中心凛凛，常如痼疾之在身，故曰“贞疾”。疾者豫之反也，《书·金滕》曰，“王有疾，不豫”是也。顾六五虽阴柔，其得君位者，贞也，其受制于下者，疾也，虽失权，其位未亡，故曰“恒不死”。《孝经》曰，“天子有诤臣七人，虽无道，不失其天下”，此之谓也。夫升平之久，人主恒耽逸豫，非以刚暴失势，必以柔懦失权。势孤于上，权移于下，虽未遽亡，而国事日非，为人君者，安可不戒哉！《象传》曰“中未亡也”，盖为四所逼，心恒有疾，幸而得中，故未亡，然曰“未亡”，亦几几乎将至于亡矣，危矣哉！\n" +
                "按：六二与六五，并贞者也。贞者不志于利，故不言豫，然其所以贞不同，故六二得吉，六五得疾。六二本不屑从四，可则进，否则退，故吉；六五以阴居阳，力不能以制四，而心甚疑忌之，故其贞适足为疾而已。贞虽为疾，其中之所守未亡，故“恒不死”，可知居贞之可恃也。",
                占:
                "【问时运】知其人本尊贵，因素性柔弱，不能自振。\n" +
                "【问商业】其基业甚好，因用人不当，钱财落他人之手，几致亏耗。\n" +
                "【问家宅】恐被借居者侵占，业主反不得自主。\n" +
                "【问战征】以偏将擅权，主帅失威，虽未丧师，亦幸免也。\n" +
                "【问疾病】是带病延年之症。\n" +
                "【问六甲】生男，必有病。\n" +
                "【问失物】可得。"
            },
            {
                原: "上六：冥豫，成有渝，无咎。",
                象: ["冥豫在上，何可长也。"],
                析: "“冥豫”者，昏冥于豫，而不知返者也。此爻以阴柔之性，居豫乐之极，纵欲而不顾，极乐而无厌，故谓之“冥豫”。上六居《豫》之终，在卦之上，纵情逸欲，不觉其非，如入幽冥之室。下卦《坤》，《坤》为冥，是过顺之咎也；上卦《震》，震则动，动则变，变则渝，是以有“渝，无咎”。凡人之溺情私欲者，亦苦于不知改变耳。此爻有雷厉之性，虽昏迷既成，一旦阳刚发动，便能改志变行，复归正道，夫复何咎？《象传》曰，“冥豫在上，何可长也，”示逸豫之不可长，以劝人之反省自新也。故爻辞不责其“冥”之凶，而反称其“渝”之“无咎”，意深哉！此爻变则为《晋》，则无冥暗之咎。凡《易》曰“渝”者，当以变卦观之也。",
                占:
                "【问时运】目下歹运已极，好运将来，翻然振作，大有可为。\n" +
                "【问商业】宜作变计，改旧从新，必得利益。\n" +
                "【问家宅】老宅不利，或迁居，或改造，吉。\n" +
                "【问战征】宜别遣主帅，改旗易辙，乃可得胜；或更就别路进兵。\n" +
                "【问讼事】宜罢讼和好，无咎。\n" +
                "【问六甲】逾月可产，得女。"
            },
        ]
    },
    {
        x:"100110",//随
        e:{
            原: "随，元亨利贞，无咎。",
            象: ["泽中有雷，随。君子以向晦入宴息。"],
            彖: ["随，刚来而下，柔动而说，随。大亨贞，无咎，而天下随时，随时之义大矣哉！"],
            析: "《随》：泽上雷下，《震》奋下，《兑》虚上，其中疏流，则内动不自主，而顺从外，从外，故曰“随”，遂以《随》名卦。《兑》为少女，《震》为长男，以少女从长男，是随之义也；兑为泽，《震》为雷，雷震泽中，泽随而动，是随之象也。其义其象，皆取以阳下阴，阴必悦随，朱子所谓“此动彼悦，成随”是也。《序卦》曰，“《豫》必有随，故受之以《随》”，盖为豫悦之道，物来随己，己亦随物，此《随》之所以次于《豫》也。\n" +
            "通观此卦，三阳三阴，初九以阳与六二遇，阳之随阴也；九五之孚上六，亦阳之随阴也；六二以阴居阴，是阴之从阴也，故曰“系”。有系必有失，不言凶咎，而凶咎可知。六三以阴居阳，是阴之从阳也，以阴故亦曰“系”，然系所当系，系即随，故曰“利居贞”。九四是以阳而随阴，逼近于五，刚而有获，臣道凶矣；惟能感之以诚，保之以哲，复有何咎乎？九五尊位，上动下悦之主，取人以为善，吉莫大矣。上六以柔顺居《随》之极，极夫随者也，能善用其系，系亦得其正也。总之，《随》之道，宜随时为动，从宜适度，处以至诚，出以大公，不特可感格群民，且可用享上帝，将率天下为随时矣。君子观此爻，而知随时之义甚大。盖前卦自《豫》来，悦以随时，无拂逆之情。《序卦传》曰，“《豫》必有随，故受之以《随》”，人能谦以致豫，则能悦以随时。不谦则安能豫？不豫则安能随？三者道同，而机会相因，机会者，惟在于时而已，而适时莫如随。然“随必有事”，有事而后蛊，此所以《蛊》次于《随》也。是故《随》如文王之事殷，《蛊》如武王之造周。夫《易》者不测之神藏，圆妙之灵府也，观之于万物，推之于万事，无所不在，无所不赅，非神圣之道，则安能如此乎？",
            占:
            "【问时运】目下气运平常，宜暂时晦藏，明年利于远行，至第五年，则可得利。\n" +
            "【问战征】宜退守，明年当小有功，必俟六年，斯敌皆就缚矣。\n" +
            "【问商业】有货一时难售，来春可以获利。\n" +
            "【问家宅】防有伏怪，夜间致多惊惧。\n" +
            "【问讼事】恐有牢狱之灾，明年又防征役远行。凶。\n" +
            "【问失物】宜在枕席间觅之。\n" +
            "【问六甲】生女。\n" +
            "【问行人】即归。\n" +
            "【问出行】以明年为利。"
        },
        ye:[
            {
                原: "初九：官有渝，贞吉。出门交有功。",
                象: ["官有渝，从正吉也。出门交有功，不失也。"],
                析: "此卦六爻，各以随人立义，专取相比相从，不取应爻。“官”，谓心之官，凡人作事，皆以心官主之。“渝”者变也，“有渝”者，谓变易其所主司也。官虽贵有守，处随之时，不可不知权变，变者趋时从权之谓也。此爻刚而得正，为成卦之主，主者不可随人，故不言随。“有渝”而得其正，故曰“贞吉”。“出门”则所见者广，所闻者多，不溺于私，惟善是从，则随不失时，变不失正，虚己听人，广交而有功也，故曰“出门交有功”。",
                占:
                "【问时运】目下正当换运之时，交入新运，一动便佳，尤利出门。\n" +
                "【问商业】货物当贩运出外，得利。\n" +
                "【问家宅】当以修造吉，或迁居出外，更利。\n" +
                "【问战征】击东者变而击西，击南者变而攻北，吉。\n" +
                "【问疾病】恐药不对症，宜改变药饵，乃吉。或于远方求医，更利。\n" +
                "【问失物】门外寻之，得。\n" +
                "【问六甲】生男。"
            },
            {
                原: "六二：系小子，失丈夫。",
                象: ["系小子于，弗兼与也。"],
                析: "刚有以自立，谓之随，柔不足自立，谓之系，故初、四、五，刚不言系，二、三、上，皆柔曰系。随则公，故无失；系则私，故有失。六二以柔居阴，与四隔位，遂系乎四，四阳而居阴，谓之“小子”，是隔位为系之谓也。系四则不能比初，初爻为《随》之主，是谓“丈夫”，故曰“系小子，失丈夫”。旧说谓二系初，失在初，阳犹微，谓之小子，五居尊位，谓之丈夫。然初为卦主，何得曰小子？五为君位，何可曰丈夫？且阳爻为丈夫，初阳爻也，目为小子，其说亦反。夫人之所随，得正则远邪，从非则失是，六二系失所系，虽无凶咎之辞，其不吉可不言而知。《象传》曰“弗兼与也”，谓天地之道，无两全之义，“系小子”，必“失丈夫”，理之当然也。",
                占:
                "【问时运】目下气运颠倒，宜自审慎。\n" +
                "【问商业】有贪小失大之惧。\n" +
                "【问家宅】阴阳倒置，有女子小人弄权，反致家主受制之象。\n" +
                "【问战征】只能捉捕敌兵，未获斩将拔旗之捷。\n" +
                "【问六甲】生女。\n" +
                "【问失物】小品可得，大件必失。\n" +
                "【问婚嫁】恐非良缘。"
            },
            {
                原: "六三：系丈夫，失小子。随有求得，利居贞。",
                象: ["系丈夫，志舍下也。"],
                析: "“丈夫”，指初九；“小子”，指九四。初为《随》卦之主，以刚居阳，出门有功，谓之“丈夫”；四以刚居阴，其义有凶，谓之“小子”，系初失四，故曰“系丈夫，失小子”，正与二爻相反。初爻本欲出门求交，得三之《随》，必与之亲善，故三之《随》初，有求而得也。初以随求人，苟枉己徇人，虽得亦失，故云“利居贞”。六三才虽弱，位得其正，系“贞吉”之初，失“贞凶”之四，是得居贞之利，即随道之善也，所以求道而得道，求仁而得仁，无求而亦自得焉。互卦《巽》为近利，故“有得”。“居贞”者，谓守常止分，以道自固，以义自裁，不以动而妄求也。《象传》曰“志舍下也”，阳上阴下，三居阳位，所系在阳，所失在阴，故曰“志合下也”。一说丈夫指四，小子指初，与二爻以五谓丈夫，前后不同。且四“贞凶”，何得云丈夫？初“有功”何得云小子？于以刚从柔为随，以柔从人为系之说，亦不合。",
                占:
                "【问时运】目下交正运，求财求名，无不如意。\n" +
                "【问商业】小往大来，必得利益。\n" +
                "【问战征】主生擒敌将，必得大捷。\n" +
                "【问家宅】家道丰富，但防小儿辈有灾。\n" +
                "【问疾病】大人无妨，小人恐有不利。\n" +
                "【问六甲】恐生而不育。\n" +
                "【问失物】得。\n" +
                "【问婚嫁】主结高亲。"
            },
            {
                原: "九四：随有获，贞凶。有孚在道，以明何咎？",
                象: ["随有获，其义凶也。有孚在道，明功也。"],
                析: "获者，取非其有之辞，“有获”者，谓得天下之心，使之随己也。是私据其所有，而不归于五，失臣道也，故曰“贞凶”。为臣之道无他，惟在以诚相孚而已，“诚则明”，明则无疑，无疑则君臣一心，德施于民而民随之。其得民之随者，相率而共随于君，足以成君之功，致国之治者，皆在此相孚有道耳，复何有咎？否则上下疑猜，即所当获，不免启挟功凌上之嫌，虽正亦凶也。九四具阳刚之才，处大臣之位，才高致谤，位重启嫌，一涉偏私，便招凶祸。惟其中之所存，一秉于诚，外之所行，一循夫理，尽其道以事上，明其几以保身，位虽高不疑于迫，势虽重不嫌于专，君嘉其让，民服其谦，得随之时，协随之宜，何咎之有？故曰“有孚在道，以明，何咎”。“有孚”者，谓有孚于九五也；“明”者，谓自明其志也。自古人臣处功名之际，不克保终者，多由我心之不孚，与不能自明其志也。如汉萧何韩信，皆受君重任，韩信求封于齐，求王于楚，无欲而不获者也，久之积疑生嫌，卒不免祸。萧何虽素知高帝之心，得保首领而终，不免械击之辱，是于“有孚”“以明”之义，犹未尽者也。如唐郭子仪权倾天下，而上不忌，功盖一世，而上不疑，可谓得“有孚在道”者矣。《象传》曰“有孚在道，明功也”，以功云者，释爻之“何咎”。盖“有孚”者，即以孚随之道；“明功”者，即明其随之功也。\n" +
                "一说“随有获”者，谓以权在我，任己所为之意；“贞”者谓所系国家之正务；“凶”者有僭逼之疑；“有孚”者心尽其诚；“在道”者行尽其道；“何咎”者，无失臣职之意也。亦通。",
                占:
                "【问时运】目下有凶有吉，利在单月，不利双月，明年则吉。\n" +
                "【问商业】获利后，防有意外之祸，必俟辨明方可。\n" +
                "【问家宅】或新买，或新造，皆不吉。\n" +
                "【问战征】小胜后，防大败。\n" +
                "【问疾病】先凶后吉。\n" +
                "【问讼事】始审凶，上控则无咎。\n" +
                "【问失物】一时难觅，待后方见。"
            },
            {
                原: "九五：孚于嘉，吉。",
                象: ["孚于嘉，吉。位中止也。"],
                析: "“嘉”者，善也，谓择善而从之。随其善者，非随其人也。“孚”者，以真实诚一之心，相与感通也。“吉”者，谓君明臣良，天下从之，无不服从其化也。舍己从人，乐取于人以为善，即所谓“孚于嘉”是也。五爻阳刚中正，位居至尊，为全卦悦随之主，是圣君至诚相感，以乐从天下之善者也。夫人主之尊，其所随之可否，悉系国家之休戚。尚贤而信之，其所以吉也，如此则不失人，亦不失己，随道之正也，谓之“孚于嘉，吉”。《象传》曰“位中正也”，以阳刚居阳位，得其正也，处中正之位，行中正之道，是以嘉也。\n" +
                "一说此爻以阳刚，比上六之柔正，谓上六以柔居阴，有女子之象。今九五孚之为婚，是取婚礼为嘉礼之义。盖随之道，莫切乎夫妇，天下之政化，始于闺门，故曰“孚于嘉”。亦通。",
                占:
                "【问时运】目下处盛运，万事获吉。\n" +
                "【问商业】以其货物嘉美，获利百倍。\n" +
                "【问家宅】必是积善之家，众咸信从，为一乡之望也。\n" +
                "【问战征】军众同心，必获胜捷，吉。\n" +
                "【问婚嫁】百年好合，大吉。\n" +
                "【问讼事】和好。\n" +
                "【问疾病】吉。\n" +
                "【问六甲】生男。"
            },
            {
                原: "上六：拘系之，乃从维之，王用亨于西山。",
                象: ["拘系之，上穷也。"],
                析: "“拘”者，执而不弃之谓也；“维”者，交结也。管子曰：“礼义廉耻，谓国之四维，乃维民之道也。”盖其所随，极其诚意缠绵，固结而有不可解者矣。至诚之极，可以孚君心，可以享鬼神，是随之极则也。“王”者，指周王而言；“西山”指歧山而言。此爻以阴居《随》之极位，天下之臣民，随顺化服之极也，故不复言随，反将拘系九五，九五亦从其所系而维之。居《随》之极，效至诚于君，相知之深，相信之笃，终始无间者也。譬如一物，人所爱好，惟恐或失之，既“拘系之”，又从而维之，即所谓拳拳服膺，而不失之意也。昔周大王避戎狄之难，去豳移居歧山之下，民之从之者如归市，是“拘系之”也，大王亦即以道维之。夫大王之去豳也，势穷而人益随之，故周室之业，自此而兴。文王之时，天下之人，无思不服，而文王尚守臣节，享大王于封内之西山，不敢僭郊之禘礼。固结其鬼神，正所以固结于君也，故有此上六之诚意，足以通神明，神明亦随之，谓之“王用享于西山”。凡《易》之爻曰“王用享”者三，皆谓王者用，此爻则以贤臣而享山川，非指其爻而为王也。若夫使之主祭，而百神享之，可以见王者之克当天心，莫大于用贤也。《象传》“上穷也”者，“上”，即尚字，是谓随道之极，无以复尚之也。",
                占:
                "【问时运】目下左支有绌，不甚如意。\n" +
                "【问商业】坚固结实，稳当可做，但未能事事舒展。\n" +
                "【问家宅】恐防范约束过严，家人怨苦。\n" +
                "【问疾病】祷之则吉。\n" +
                "【问婚嫁】有赤绳系臂之缘。\n" +
                "【问讼事】恐有桎梏困系之患。\n" +
                "【问失物】是自己包裹藏之，未尝失也。\n" +
                "【问六甲】生女。"
            },
        ]
    },
    {
        x:"011001",//蛊
        e:{
            原: "蛊：元亨，利涉大川。先甲三日，后甲三日。",
            象: ["山下有风，蛊。君子以振民育德。"],
            彖: ["蛊，刚上而柔下，巽而止，蛊。《蛊》元亨而天下治也。利涉大川，往有事也。先甲三日，后甲三日，终则有始，天行也。"],
            析: "此卦《巽》下《艮》上，《艮》为山，《巽》为风，山下有风之象。风者空中之气，流通气候，往来寒暑，发育万物者也。今风入山下，闭息而不得振，风不通，则物腐而生虫。又《巽》为臭，为气，《艮》为止，为覆器，《艮》上《巽》下，是藏臭物于器中，夏从而覆之也，故腐败而生虫。一虫而化为三，愈生愈多，虫在皿中无所食，遂至同类相食，是乱之义也。“蛊”字从三虫，在一皿中，故《春秋传》曰：“皿虫为蛊”。朱子曰：“言器中聚那毒虫，教他自相并，总是败坏之意，故名此卦曰《蛊》。”《说文》，“腹中蛊，悔深所生”，故又有淫溺惑乱之义；又转训事，或为修饬之义。《序卦传》曰“蛊者事也”，《杂卦传》曰“蛊则饬也”。凡遇蛊败，必有谨饬修治之事，犹训乱为治之意。是以卦名取败坏之义，爻辞用为事之义也。\n" +
            "通观此卦，艮以刚止在上，上亢而不下济，巽以柔入在下，下卑而不上承，刚柔不接，两情乖隔。下者愈卑而愈巽，逡巡不进，上者愈高而愈亢，忽略苟安。其中日积日敝，渐积渐坏，内腐而外朽，其破败有不可救药者矣。故曰“刚上而柔下，巽而止，蛊”，是自卑于内，苟止于外，所以成蛊也。古书曰：“流水之不腐，以其逝故也；户枢之不合，以其运故也。”故器欲常用，久不用则蠹生；体欲常动，久不动则疾生。则知蛊之生由于止，其所由者非朝夕矣。《象》曰“山下有风，蛊”，风欲行，遇山阻之而止，旋转于山而不能达。风字从虫，故曰蛊以风化。君子欲治其蛊，则莫如“振”，“振”者动而不止也。“振民育德”，即“明德”“新民”之道也。是以诸爻皆曰“干”。“干”者植立之谓，所以饬治而扶起之，其义与“振”同，皆反夫止而用之也，反其止则蛊治矣。若四爻之“裕”，是益其蛊也，故“吝”。五爻皆言干蛊，有子道焉。上爻居五爻之上，处一卦之极，有为父之象，故不言于蛊。以干蛊之事，属之五爻之王，诸爻之侯，而上爻不复事其事。故曰“不事王侯，高尚其事”者，谓其事更有高出王侯之上者也。是将以一言而为天下法，一行而为天下则，其不言治蛊，而所以治蛊者。其道可为万世法则，故《象》曰“志可则也”。若以“不事王侯”，谓隐居高尚者所为，仍蹈苟止卑巽之习，非饬蛊，适以滋蛊矣，于爻义未合。总之此卦，五爻所言，称“父”，称“母”，称“子”，皆家事，上爻则曰“王”，曰“侯”，乃国事。邱氏曰，“以此为子，是诤父之子；以此为臣，是诤君之臣”，此言得之矣。",
            占:
            "【问时运】目下好运方来，须力图振作，可改旧观。\n" +
            "【问商业】防货物堆积致坏，宜急起贩运出售。\n" +
            "【问战征】屯营宜就旷地，不宜近山，防有风鹤之惊。\n" +
            "【问家宅】须整肃门庭，凛诲淫蛊惑之戒。\n" +
            "【问疾病】防巫蛊咒诅，或腹患蛊毒之症。\n" +
            "【问讼事】想是听人蛊惑所致，急宜罢讼。\n" +
            "【问婚嫁】恐有男女私情。\n" +
            "【问失物】其物已坏。\n" +
            "【问出行】防阻风。\n" +
            "【问六甲】防有异胎。"
        },
        ye:[
            {
                原: "初六：干父之蛊，有子考无咎，厉终吉。",
                象: ["干父之蛊，意承考也。"],
                析: "“干”者本之正干，得枝叶以附立之，所以维持木身也。故称人能耐事负重任曰“干事”。蛊者事也，“有子”者，赞美之词，即所谓有子克家是也。“考”者，父也，殁曰考。蛊者，物腐虫生之谓，其所由来，非一朝一夕之故，是以《蛊》之诸爻，皆系父子而言之。孝子家庭之间，不幸而父有蛊，蛊而待干，子心戚矣；然幸而得干，则“考无咎”，子亦得以无厉，故吉。",
                占:
                "【问时运】好运初交，克勤克俭，克光前业，吉。\n" +
                "【问商业】旧业重兴，必多获利。\n" +
                "【问家宅】想是祖先旧宅，当改造重从，大利。\n" +
                "【问战征】如勾践复吴，子胥伐楚，必获重兴。吉。\n" +
                "【问讼事】前不得直，复宜上控，无咎。\n" +
                "【问疾病】虽危无妨，若无子者，占此不利。\n" +
                "【问婚嫁】佳儿佳妇，吉。\n" +
                "【问六甲】生男，必能兴家，吉。"
            },
            {
                原: "九二：干母之蛊，不可贞。",
                象: ["干母之蛊，得中道也。"],
                析: "干蛊之解，见初爻下。此爻体巽，以刚中之才，上应六五，巽顺而得中道者也。初爻言“考”，二爻言“母”，是父没而母存也。《蛊》六爻，称“父之蛊”四，称“母之蛊”一，盖以妇人无专制也，在亚细亚古来所戒，如《书》所云“牝鸡司晨，惟家之索”是也。九二以刚中谏其母，故曰“于母之蛊”。必若凯风七子之歌，斯为得矣。以此卦属之君臣，则二爻为大臣，五爻必是幼主，或母后也。幼主则为周公之相成王，劝进豳风，婉转开导，期归于善是已。女主则为陈平、周勃之辅吕后，狄仁杰、娄师德之相武后，从容巽顺，辅翼国政，不使蛊时至大坏者也。盖治蛊固不可过柔，亦不可过刚，过刚则伤恩，过柔则流慢。此爻刚得其中，故能酌量损益之宜，有用刚之实，无用刚之迹，以柔济刚，弥缝得法，自不致蛊之复炽也，故《象传》曰“得中道也”。",
                占:
                "【问时运】目下贵将顺调剂，不可草率。\n" +
                "【问商业】防有旧债积弊等事，宜宽缓调处。\n" +
                "【问家宅】恐有母党擅权启衅，宜忍耐善处。\n" +
                "【问战征】防有阴险，不可直进。\n" +
                "【问疾病】壮年防是疟母痞块等疾，小儿或是胎气不足，宜服柔和之剂。\n" +
                "【问行人】在半途，后日可归。\n" +
                "【问失物】得。\n" +
                "【问婚姻】当得佳妇。"
            },
            {
                原: "九三：干父之蛊，小有悔，无大咎。",
                象: ["干父之蛊，终无咎也。"],
                析: "干蛊之解，见初六下，至九三而蛊已深，非有阳刚之才德，难革此弊。此爻承父破坏之后，若复因循坐视，不思补救，是长父之恶，非为子之道也；然过刚不中，或径情直行，欲补父过，致伤父心，亦未免有悔也。非刚阳之才，未易言干，幸能干之，虽“小有悔”，可“无大咎”，谓之“干父之蛊，小有悔，无大咎”。“小有悔”者，所以警之也；“无大咎”者，所以劝之也。“小有悔”者，固非善于事亲，若因悔而不干，则咎益大矣。是以三爻干而有悔，终胜于四爻之裕而得吝也。",
                占:
                "【问时运】目下直痛革前非，纵小有挫折，终得有济。\n" +
                "【问商业】宜重兴旧业，改立章程，或有小失，必得大利。\n" +
                "【问家宅】恐栋宇年久，多致蛀腐，毋惜小费，急宜改造。\n" +
                "【问战征】刚武直进，未免小败，然必无大害。\n" +
                "【问失物】得则必得，防有小小口舌之灾。\n" +
                "【问六甲】生男，但生下小孩，未免小有疾厄。\n" +
                "【问疾病】无妨。"
            },
            {
                原: "六四：裕父之蛊，往见吝。",
                象: ["裕父之蛊，往未得也。"],
                析: "“裕”者竟也，与“干”相反。“裕父之蛊”者，谓因循苟且，惮于改作，是宽容其蛊而蛊益深也。此爻以柔居柔，不能有为，爻至四，蛊已过半，治之宜如救焚拯溺，迅速从事，斯克有济。父既柔懦而积成其蛊，子复柔弱而不能救，持是以往，必见吝也，故曰“裕父之蛊，往见吝”。此爻变则为《鼎》，《鼎》九四之辞曰“鼎折足，覆公餗，其形渥，凶”，亦可以见其益吝也。初六、六四，共阴柔，同当干蛊之象，而爻辞不同。初六居《蛊》之初，其败未大，故虽阴柔，其功易成，是所以为吉也；六四《蛊》败过半，其坏较甚，而犹气馁力屈，不能贞固干事，是以见吝也。",
                占:
                "【问时运】运亦平常，但一味因循，终致自误。\n" +
                "【问商业】徒知守常，不知革弊，长此以往，难以得利。\n" +
                "【问战征】威不肃，令不严，未可前往也，往必见败。\n" +
                "【问家宅】父业虽裕，敝败已深，难保其往也。\n" +
                "【问疾病】外形尚裕，内患已深，不急图治，后必莫救。\n" +
                "【问六甲】生女。"
            },
            {
                原: "六五：干父之蛊，用誉。",
                象: ["干父用誉，承以德也。"],
                析: "此爻以柔居刚，又得中而居尊位，与九二刚中之贤臣，阴阳相应，专心委任，使翼为辅弼，匡救坏乱之旧弊，故曰“干父之蛊”。五爻君位，爻辞曰“父”，知帝王必有父也。卦中初、三两爻，皆曰“干父之蛊”，三则曰“有悔”，故仅得免咎；初则“考无咎”，故曰“终吉”，不可谓非干之善者也。至五爻不特其父无过，且因而得誉，补其过，更扬其名。恶归己而善归亲，其曲委弥缝，非善继善述者不能臻此。《象传》曰“干蛊用誉，承以德也”，盖干蛊则可以才济之，“用誉”则必以德承之，故曰“承以德也”。",
                占:
                "【问时运】虽门祚衰薄，能自振作，自足立身扬名。\n" +
                "【问商业】旧业虽不甚佳，此番从新改作，必能获名获利。\n" +
                "【问家宅】祖遗之产不厚，幸能扩充前业，必至光大门楣。\n" +
                "【问战征】能克复城池，军声远播，吉。\n" +
                "【问疾病】当延名医治之。\n" +
                "【问六甲】生男。\n" +
                "【问嫁娶】定是名门贵族。"
            },
            {
                原: "上九：不事王侯，高尚其事。",
                象: ["不事王侯，志可则也。"],
                析: "此爻为成卦之主，以刚明之才，居艮止之极，不比九五，亦不应九三，逍遥于外，高居卦极，不关世之毁誉荣辱，其清风高节，足以振起颓俗，激动人心，其益世岂鲜少哉！九五者王也，九三者侯也，不比应之，故曰“不事王侯，高尚其事”。上九高尚，固非放情物外者所可托也，是不仅治一时之蛊，实足治万世之蛊也。其志之可则，岂有过哉！故《象传》曰“志可则也”。\n" +
                "一说：此卦自初爻至五爻，皆以蛊言，不言君臣，而言父子，人臣之事君，与人子之事父一也。此爻位居最上，独以“不事王侯”言者，盖非君非臣，亦非子，是身居父位者也，故高尚其志，不复事天下之事，而其志之所存，实足为天下法则者矣。\n" +
                "凡读《易》者，须先熟察其卦爻之象，与卦爻之时，然后能读得其辞义也，不然而徒拘泥文字，虽终身读《易》，不能得其要。如此爻《象传》无难，难得其旨，何则？“不事王侯，高尚其事”之人，虽有才德，不为人所知，不为世所用，古今来亦不乏其人。若必指是等人，而称之曰其“志可则”则圣贤君子之用世者，反将曰其志不可则，不几大妨名教，有害纲常者乎？盖上九备阳刚之德，居全卦之极，当此蛊坏日甚，不忍坐视天下，是以自初六至六三，奋振其才力，以济时艰，以光前业；迨蛊坏既除，人人得浴太平富贵之泽，上爻独脱然勇退，“不事王侯，高尚其事”，是见几而作之君子也，其志岂不可则哉！",
                占:
                "【问时运】宜以退为进。\n" +
                "【问商业】目下货价，必将逐渐增高，不必急售。得利。\n" +
                "【问家宅】宜傍高阜之地，吉。\n" +
                "【问疾病】卦为归魂，恐天年有阻。\n" +
                "【问婚嫁】必是女贞男良，天缘巧合。\n" +
                "【问战征】想已值战胜凯旋之时。\n" +
                "【问出行】宜行商，不宜求名。"
            },
        ]
    },
    {
        x:"110000",//临
        e:{
            原: "临：元亨利贞，至于八月有凶。",
            象: ["临：刚浸而长，说而顺，刚中而应，大亨以正，天之道也。至于八月，有凶，消不久也。","泽上有地，《临》。君子以教思无穷，容保民无疆。"],
            析: "“临”字从人从臣从品。人者以君上为尊；臣者以臣民统之；品者，以品类别之。言人君临御天下，统率臣民，品别品类之贤否，而器使之，是谓君临民，尊临卑，上临下也，临又有监守之义，故监字从临省文。又按临卦，《兑》下浸上，《坤》上陵下，下陵过乎上，有密迩切近之形。卦体兑为泽，坤为地，地在泽上，是地临泽也；上四阴，下二阳，阳欲上进，是以阳临阴也，故《彖》辞曰，下悦而依附乎上，上顺而反降乎下。附乎上，自下附上，降乎下，是上莅下，总其象谓临莅也。自有临辞，遂以临为卦名。\n" +
            "通观此卦，明主在上，为天下大悦之时也。地势卑而下顺，泽水浸而上悦，水土本相亲近，犹人主平易而近民，民皆欢乐而附上也，临之所以为临也。初九、九二，同为“咸临”，泽水自山而下也。初九泽犹未盈，故曰“行”；九二泽水已满，故“无不利”；六三水既及岸，故为“甘”；六四地与水接，故曰“至”；六五地泽正应，有智者乐水之象，故曰“智临”；上六，地愈厚，泽愈深，故曰“敦临”。“咸”者临之速也；“甘”者临之贼也；“至”者临之诚也；“智”者，临之明也；“敦”者，临之久也。“咸临”见其德之能感；“甘临”见其性之过柔；．“至临”见其位之得当；“智临”见其道之克明；“敦临”见其志之笃厚。盖六五之君，不以独临，而能任人，故以“智临”称之。用其“咸”，用其“至”，用其“敦”，而君子之道长；去一“甘”，而小人之道消。阳悦而长，阴顺而消，于是天时正，人事和，上下同德，熙熙皞皞，而天下治矣。是诚临民之极则也。",
            占:
            "【问时运】目下作事，恰如一潭活水，流行自在，好运正长。\n" +
            "【问商业】泽为货物，地为贩运之地也，得此占，其获利厚而尤远，大吉。\n" +
            "【问家宅】此宅必近水泽之乡，家业正旺，财丁两盛，大吉。\n" +
            "【问战征】其阵宜临水处，不特一时得胜，且有万民归服之象。\n" +
            "【问疾病】其命可保，其病必延久，一时难愈。\n" +
            "【问讼事】恐久久不了。\n" +
            "【问婚嫁】两姓和合，五世其昌，大吉。\n" +
            "【问六甲】生女。\n" +
            "【问行人】一时未归。\n" +
            "【问失物】在川岸处觅之，保可得也。"
        },
        ye:[
            {
                原: "初九：咸临，贞吉。",
                象: ["咸临贞吉，志行正也。"],
                析: "山泽通气之卦，名之曰咸；此卦泽上有地，阴阳之气相感，故初、二两爻，皆曰“咸临”。初居卦之始，其阳犹微，与四相应。四以柔而当位，初以刚而得志，行各得其正，乃能应而进于五，相与得行其道，以佐大君“智临”之治也，故曰“贞吉”。《象传》曰“志行正也”，盖初爻位居其正，是以志之所行，莫不正也。",
                占:
                "【问时运】目下新运初交，能守其正，行无不利。\n" +
                "【问商业】时当新货初出，市价平正，尽可贩行，无不如志。吉。\n" +
                "【问家宅】必是忠厚中正之家，现下适有吉事临门。大利。\n" +
                "【问战征】初次临阵，宜从大路进军。吉。\n" +
                "【问疾病】病是初起，正气充足，可保即愈。\n" +
                "【问婚嫁】门户相当，品行端正，佳偶也。\n" +
                "【问讼事】一经临审，即可了结。\n" +
                "【问六甲】生男，临盆有喜。"
            },
            {
                原: "九二：咸临，吉无不利。",
                象: ["成临，吉无不利，未顺命也。"],
                析: "此爻成卦之主，以刚中之才，与六五柔中之君，阴阳相应，虽在大臣之位，任官之日犹浅，不保无众阴嫉之也。故直临则必有咎，宜待在上之君长，感我才德，而后临之，然后可得吉也。此爻曰“吉”，曰“无不利”，于六爻中特见赞美，盖初爻以正感，二爻以中感也。《象传》曰“未顺命也”，谓此爻在下体而不当位，故小人未尽从其命也。",
                占:
                "【问时运】目下正佳，又得贵人照应，大吉。\n" +
                "【问商业】初次既获吉，二次更利。\n" +
                "【问家宅】有福星照临之象，前后皆吉。\n" +
                "【问战征】再接再励，所向皆吉，但防偏裨中，有不从令者，以致败事。\n" +
                "【问婚嫁】咸利，惟属羊者最佳。\n" +
                "【问讼事】却不致败，但一时未得顺从。\n" +
                "【问六甲】生男，但未产也。\n" +
                "【问行人】在外者归期未定。"
            },
            {
                原: "六三：甘临，无攸利。既忧之，无咎。",
                象: ["甘临，位不当也。既忧之，咎不长也。"],
                析: "“甘”者，五味之中，为人之所最嗜，为怡乐之义。“甘临”者，谓不能临人以德，而以甘言谄之，必无诚心实意也。三爻近二爻，见二爻未从其命，遂欲巧言求进。究之，言虽甘，而位不当，何利之有？既知其非而“忧之”，反邪归正，去恶从善，则以今日之是，亦足补前日之非，则可以免咎，谓之“既忧之，无咎”也。《象传》曰“位不当也”，以阴居阳，是位之不得其正也；“咎不长也”，幸以其忧之速，故其咎未至于长也。",
                占:
                "【问时运】运既不佳，行亦不正，幸能知悔，后运可望。\n" +
                "【问商业】店基不得其位，惟贩运糖业则佳。\n" +
                "【问家宅】屋运不佳，宜迁徙为吉。\n" +
                "【问战征】屯营地位不当，迁营则吉。\n" +
                "【问疾病】药不对症，宜进苦辛之剂，无咎。\n" +
                "【问婚姻】不合。\n" +
                "【问行人】外不得利，近时可归。\n" +
                "【问失物】可得。\n" +
                "【问六甲】生女，恐难长养。"
            },
            {
                原: "六四：至临，无咎。",
                象: ["至临无咎，位当也。"],
                析: "此爻位近至尊，才志俱弱，以柔顺之资，居台鼎之贵，能略分忘势，下应初九之刚正，尊贤尚德，情意恳至，故曰“至临”。盖大臣有休休好善之诚，无矜矜自足之意，以至诚之心，感应初九，初九之贤，亦感而悦服，共谋国事，是以无咎，临政之吉，莫大于此，《象传》曰“位当也”，谓得柔正之德也。",
                占:
                "【问时运】好运已至，无不得当，有吉元凶。\n" +
                "【问商业】目下贩运，正当其时，无往不利。\n" +
                "【问家宅】宅位得当，家业兴隆，无咎。\n" +
                "【问战征】其时已至，正可临敌获胜。\n" +
                "【问疾病】虽至危笃，尚可无咎。\n" +
                "【问婚姻】彼此欢洽，门户亦当。\n" +
                "【问行人】即至。\n" +
                "【问失物】即得。"
            },
            {
                原: "六五：知临，大君之宜，吉。",
                象: ["大君之宜，行中之谓也。"],
                析: "“知”者，智也，“智临”者，知人善任之谓也。夫以一人之身，临天下之广，自任其智，适足以为不智，惟能取天下之善，任天下之事，如此则“知周万物，道济天下”，是恭己无为之郅治也。此爻具柔中之德，居至尊之位，下应九二，知其贤而任之，所谓“聪明睿知，足以有临”，此爻得之矣，故曰“大君之宜”。舜之称大智，合天下之智以为己智，曰“舜好问而察迩言”，亦此意也。《象传》曰“行中之谓也”，谓五有柔中之德，倚任刚中之贤，以成“智临”之功，中道而行，是即不偏之谓也。",
                占:
                "【问时运】目下运得其时，又得好人相助，事事宜成，吉。\n" +
                "【问商业】知往知来，通晓商情，自然获利。吉。\n" +
                "【问家宅】有五福临门之兆。吉。\n" +
                "【问战征】能得军心，斯知己知彼，战无不胜也。\n" +
                "【问疾病】当得良医，详知病由，治之自然得愈。\n" +
                "【问婚姻】宜家宜室。大吉。\n" +
                "【问失物】有人拾得，久后自知。\n" +
                "【问六甲】生男，主贵。\n" +
                "【问行人】尚在半途，后日可归。"
            },
            {
                原: "上六：敦临，吉无咎。",
                象: ["敦临之吉，志在内也。"],
                析: "“敦”者，笃也，厚也。此卦六五既应九二，上六又从而附益之，谓之“敦临”，犹复六四既应初九，六五亦从而附益之，谓之“敦复”，其义一也。此爻为《坤》之极，居《临》之终，阴柔在上，与二虽非正应，而志在从阳，屈尊从卑，降高就下，礼意敦笃，是临道之善持其终者也，故曰“敦临，吉，无咎”。凡卦于上爻为极，过极每多危象，此爻曰“敦临”，有“安土敦仁”之义，无过极之虑也，是以吉而无咎。《象传》曰“志在内也”，内者，指内卦二阳，虽与内卦无应，上六之志，惟在于内，故曰“志在内也”。可与《泰》初九之《象传》“志在外也”对看。",
                占:
                "【问时运】目下好运已终，惟其存心忠厚，故得无咎。\n" +
                "【问商业】贩卖内地，吉。\n" +
                "【问家宅】世代忠厚，内外肃穆，吉。’\n" +
                "【问战征】宜增兵益饷，以保护内地为要。\n" +
                "【问疾病】培养元气，勿药有喜。\n" +
                "【问六甲】生女。\n" +
                "【问失物】即在家内，未尝失也。\n" +
                "【问行人】即日可归。"
            },
        ]
    },
    {
        x:"000011",//观
        e:{
            原: "观：盥而不荐，有孚颙若。",
            象: ["风行地上，观。先王以省方观民设教。"],
            彖: ["大观在上，顺而巽，中正以观天下。《观》，盥而不荐，有孚颙若，下观而化也。观天之神道，而四时不忒，圣人以神道设教，而天下服矣。"],
            析: "按：“观”字，从雚，从见。雚即鹳，似鸿而大。鹳有白黑二种，白鹳巢树。鹳又能察时审变，每天阴晴雨雪，大风大水，气候不常，向树上瞻望，随所见之上下，以为趋避。故土人亦皆视鹳之飞鸣止食，以占常变。见，视也，常见曰见，非常曰“观”，故合雚与见为观。此卦下《坤》上《巽》，巽为风，坤为地。风本无形可观，以其触于物者而观之，犹上之德化无形，以施于政者观之，下之性情无形，以发于事者观之，有相观而化之义也。是以名其卦曰《观》。《序卦》曰，“物大然后可观，故受之以观”，此观之所以次于临也。" ,
            占:
            "【问时运】目下正当振作有为，宜出外历览，不宜杜门静守。\n" +
            "【问商业】贩运洋货，风险须防。\n" +
            "【问家宅】宅中或旧有供奉神佛，或皈入教门之家，或是家主设馆教徒。\n" +
            "【问战征】有风雷疾卷之势，可以掠得土地，收获民众。吉。\n" +
            "【问疾病】是风湿之症，宜流行活动，血调而风自息。\n" +
            "【问出行】远游吉，传教更好。\n" +
            "【问讼事】得平匀断结。\n" +
            "【问六甲】生男。\n" +
            "【问天时】有风即晴。\n" +
            "【问失物】初在地上，被风吹远，宜遍寻之，可得。"
        },
        ye:[
            {
                原: "初六：童观，小人无咎，君子吝。",
                象: ["初六童观，小人道也。"],
                析: "“童观”者，谓无远大之识见，犹童稚蒙昧，不能振拔以观道德之光。此卦六爻，各取义于观，以地之远近，分观之浅深，故其所观，一爻胜于一爻，此义不可不知也。初爻以阴柔在下，是幼稚之氓，抱昏愚之性，处荒僻之区，所居既远，所观亦微，故曰“童观”。“小人”者，以其昏昧，无远大识见，固不足怪，是以“无咎”，若君子而如是，不亦可吝乎？故曰“小人无咎，君子吝”。《象传》曰“人道也”，以其位卑识微，只得如是。“道”，即“小人道长”之道也。",
                占:
                "【问时运】初运未佳，幸无大碍。\n" +
                "【问商业】初立场面，只宜就小，无咎。\n" +
                "【问家宅】防有童仆偷窃之患。\n" +
                "【问战征】防有小胜大败。\n" +
                "【问疾病】小人无碍，大人不利。\n" +
                "【问行人】宜就近，无咎。\n" +
                "【问六甲】生女。\n" +
                "【问婚嫁】自幼结亲，吉。\n" +
                "【问失物】防为小儿抛弃。"
            },
            {
                原: "六二：窥观，利女贞。",
                象: ["窥观女贞，亦可丑也。"],
                析: "《艮》为门；《坤》，阖户，“窥观”者，盖从门隙而窃窥之也。二爻以阴居阴，位得中正，虽进于初爻，其位尚卑，见识亦劣，不能观刚阳中正之大道。孟子“齐人一妻一妾”章，其妻曰“吾将阚良人之所之矣”。窥、窥字皆从门，义同，是女子之行也，故曰“利女贞”。在丈夫，当目观天地之广远，心观万理之幽微，内观自己之身心，外观天下之形势，岂得以潜探暗窥为得计乎？《象传》曰“窥观女贞，亦可丑也”，女以贞为利，女子而“窥观”，尚未为失，若丈夫则丑矣。“亦”字承初爻“吝”字来，初爻以小人励君子，二爻以女子激丈夫。",
                占:
                "【问时运】目下运不佳，只宜株守，若妇女占之，大利。\n" +
                "【问商业】蚕丝业大利，余不佳。\n" +
                "【问家宅】必是妇女主家，利。\n" +
                "【问疾病】是阴寒之症，无害。\n" +
                "【问出行】须携眷同往，若行人，必携眷偕归。\n" +
                "【问六甲】生女。\n" +
                "【问失物】恐在门隙之间，窥探得之。"
            },
            {
                原: "六三：观我生，进退。",
                象: ["观我生，进退，未失道也。"],
                析: "“我生”者，指动作施为之自己出者，意思之发动，亦谓之生。“观我生，进退”者，谓省视我志之正邪，我行之通塞，而进退之也。又‘进”者谓往刚，“退”者谓返柔，《系辞》曰“变化者，进退之象”是也。三爻居上下之间，在下卦之上，可以进，可以退，地位较二爻稍近，其见识亦稍胜，故能审观“我生”之所宜，以卜进退。度德而就位，量能而居官，随其可否而进退，谓之“观我生进退”。一出而成天下之事，是所行之通也，则可从而进；虽出不能成天下之事，是所行之塞也，则可从而退，其出处进退，于己取之而已。《象传》曰“未失道也”，谓其观己之才德，察时之可否，以用意于进退去就，虽未得道，要无误身失时之忧也。",
                占:
                "【问时运】目下运却平平，能度德量力，不自妄动，虽无所得，亦无失也。\n" +
                "【问商业】谨慎把握，随买随卖，听时计价，决无失也。\n" +
                "【问家宅】宜旧宅，不宜转移。\n" +
                "【问战征】宜审察军情，随机应变，决不致败。\n" +
                "【问行人】归心犹豫未决。\n" +
                "【问六甲】生女。\n" +
                "【问疾病】宜息心自养，可保无虞。\n" +
                "【问失物】即得。"
            },
            {
                原: "六四：观国之光，利用宾于王。",
                象: ["观国之光，尚实也。"],
                析: "“王”指九五。阳明阴暗，九五阳爻，有光明之象。不言君而言国者，君者专属当阳一人，国则统朝廷百官而言之也。“观国之光”，谓观国中风俗之美恶，政教之隆替。“光”者，国之光华也。“宾于王”者，谓古有贤者，人君宾礼之，故土之值进王朝者，谓之宾。明主在上，怀抱才德之士，皆愿进仕王朝，辅翼君上，以康济天下，此君子之志也。四爻近五位之尊，为一卦之主，黼黻王献，光被四表，故曰“观国之光，利用宾于王”。项氏曰：“履正故为宾，不正即为敌”，是国有光可观，则宾，国无光可观，则敌。四以柔居阴，位得其正，《纂言》曰得阴之正，故有效顺而无跋扈也。《象传》曰“尚宾也”，宾即《书》所云“宾于四门”之谓，盖敬礼之也。此卦四阴二阳，与剥之五阴一阳，阴盛逼阳，势皆危险，六四为四阴之魁，进逼君侧，五爻以宾礼尚之，是隆其礼而不假以权也，可谓善处其观者矣。《剥》之六五曰“贯鱼”，曰“以富人宠，无不利”，此爻与《剥》之六五，交互参看，可以察其义也。",
                占:
                "【问时运】目下当盛运，求利可，求名尤佳。\n" +
                "【问商业】宜贩运出洋，不特获利，且可得名。\n" +
                "【问家宅】主有喜事临门，光增闾里。\n" +
                "【问战征】必得大捷，论功邀赏，垂名竹帛。\n" +
                "【问疾病】不利。\n" +
                "【问行人】不归。\n" +
                "【问六甲】生男，且主贵。\n" +
                "【问讼事】得直。"
            },
            {
                原: "九五：观我生，君子无咎。",
                象: ["观我生，观民也。"],
                析: "“观我生”者，与六三同辞，其义殊异。五爻尊位，居中履正，是当阳首出之一人也，阳刚在上，为观之主，四海之内，由我而化，治道之隆替，风俗之美恶，皆自我生而推暨，故不观人而观我。观之而我之教化善焉，则天下皆有君子之风，是可以无咎矣，谓之“观我生”，即《中庸》所云“本诸身，征诸庶民”者是也。《象》曰“观我生，观民也”，王者以中国为一人，民心之向背，无不自我，观我即所以观民也。",
                占:
                "【问时运】目下运得其正，直道而行，无往不利。\n" +
                "【问商业】当由我把定主意，买卖贩运，无不利。\n" +
                "【问家宅】此宅必由我建造，君子居之，大利。\n" +
                "【问战征】当审察己营，所谓知己，乃能知彼也。可获大胜。\n" +
                "【问疾病】有命在天，无咎。\n" +
                "【问行人】即返。\n" +
                "【问失物】仍在身边，未失也。\n" +
                "【问六甲】生贵子。"
            },
            {
                原: "上九：观其生，君子无咎。",
                象: ["观其生，志未平也。"],
                析: "上爻具刚明之才德，居五爻之上，处一卦之终，虽高而无位，其一动一静，为众人所瞩目。既为众人所观，不能不自“观其生”，与五同德，故亦与五同观。“观我生”，观发施之政教；“观其生”，观平时之行义，稍有不同耳。而要皆以君子为归，庶无咎也。《象传》曰“志未平也”，言上处极必危，虽无其位，未忘恐惧；曰“志未平”，其谨畏可知也。",
                占:
                "【问时运】盛运已过，反躬自省，亦无失也。\n" +
                "【问商业】此种货物，已将告罄，由我得价，自然获利。\n" +
                "【问家宅】是老宅基，生息繁盛，有利无咎。\n" +
                "【问战征】军事将终，即可旋凯。\n" +
                "【问疾病】命运不久。\n" +
                "【问讼事】即结。\n" +
                "【问六甲】生男。"
            }
        ]
    },
    {
        x:"100101",//噬嗑
        e:{
            原: "噬嗑：亨，利用狱。",
            象: ["雷电《噬嗑》，先王以明罚敕法。"],
            析: "“噬”，啮也，“嗑”，合也，啮而合之也。卦全象颐，以初、上二刚为两唇，以二、三、四、五四阴为齿，上下龂腭，有噬之象。以四爻一刚，梗于其间，如物之在口，初上二刚，以四为梗，遂致上下不得合。下唇动，上唇止，必噬乎四之梗，梗消而两唇乃合，谓之《噬嗑》。卦承《观》来，《序卦》曰：“可观而后有合，故受之以《噬嗑》，嗑，合也。”既有可观，后必来合，《噬嗑》所以次《观》也。\n" +
            "通观此卦，其象取全体象颐，又取上下雷电二象，为治狱之用，雷以抉伏，电以烛奸，动则能断，明则能察，合而施之，刑法昭彰。六五虽不当位，以柔居阳，为治狱之主，专用初上两刚相合为治，刚柔合而间去，间去而狱平。卦旨如此，在六爻则又有各取其义。或以初上两爻无位，为受刑之人，中四爻为用刑之人。就卦体观之，以四爻一刚，为受刑之人，余五爻为用刑之人，然爻辞皆主“利用狱”，未尝有用刑受刑之别也。但两刚不能独噬，必合诸柔而共噬，故诸爻各有所噬，而噬之中，又分其坚柔焉。二“噬肤”，肤柔而易噬，其罪轻；三“噬腊肉”，较肤而稍坚矣，故有“毒”；四“噬乾胏”，胏肉而带骨，较腊肉而益坚矣，“利艰贞”；五“噬乾肉”，乾肉者，言狱之已成也。五为主狱，其所治者，皆刑官之已决者也，五重省之，故“贞厉”。初曰“屦校”，初在下，刚犹微，故刑在足，是薄罚也。上曰“苛校”，上居终，刚已极，故刑在首，则过猛矣。两爻独不言噬，或之所为受刑者，其以此乎？总之六爻用狱，各有次第，得其当，故皆曰“无咎”；“利艰贞”，则曰吉；用其极，则曰“凶”。平则劝之，过则戒之，慎之至也，故《象传》曰“雷电噬嗑，先王以明罚敕法”，言先王明威并用，即刑期无刑之意《易》之言用狱，《噬嗑》与《丰》二卦最详，《丰》田“折狱致刑”，《噬嗑》曰“明罚敕法”，其审决精详，足惩后世爰书之滥。此全卦之义也。" ,
            占:
            "【问时运】目下正当好运发动，有威仪，有光耀，声名远播上达之象，吉。\n" +
            "【问商业】买者卖者，一时会集，有货物旺销之象，吉。\n" +
            "【问家宅】天盘地盘皆动，防有火灾，须小心谨慎，可以免祸。\n" +
            "【问疾病】是郁热之症，导直透发，或热极作狂，须慎。\n" +
            "【问讼事】判决明允。\n" +
            "【问天时】有雷雨骤降之象，雨后即霁。\n" +
            "【问婚嫁】阴阳一气，定必百年好合，吉。\n" +
            "【问行人】即归。\n" +
            "【问失物】恐被人吞没。"
        },
        ye:[
            {
                原: "初九：屦校灭趾，无咎。",
                象: ["屦校灭趾，不行也。"],
                析: "《震》为足，初刚居阳在下，象足；初为《震》之下画，亦象屦。“校”刑具，木校也，加校于屦，即加于足也。“灭”没也，以校之小，仅没其趾，罪小而罚轻也。初阳犹微，用刑亦宽，小惩之，使不复为恶而己，故用刑与受刑，两“无咎”也。《象》曰“不行也”，古人制刑，有小罪则校其趾，禁止其行，使不敢复蹈前非，故曰“不行也”。" ,
                占:
                "【问时运】目下防有小灾，幸无大患，宜慎。\n" +
                "【问商业】木材交易，最为不利，余商亦宜谨慎。\n" +
                "【问家宅】有兴工改造之意，无咎。\n" +
                "【问疾病】或足患疮疡，或患脚气，症是初发，医治自易。\n" +
                "【问战征】防有埋伏，宜慎。\n" +
                "【问婚嫁】不利。\n" +
                "【问行人】未归。\n" +
                "【问六甲】生男。恐小儿有脚疾。"
            },
            {
                原: "六二：噬肤灭鼻，无咎。",
                象: ["噬肤灭鼻，乘刚也。"],
                析: "“肤”者，柔软无骨之肉，噬之甚易，喻狱之易治；“灭鼻”者，喻得情之深。二爻应五，居中得正，是用刑之得其中正也。刑得中正，则罪人易服，虽“噬肤”而“灭鼻”，“无咎”也。互卦艮为鼻，此爻居艮之初，上有互卦之《坎》，以《艮》陷《坎》下，有灭鼻之象。《象传》曰“乘刚也”，乘初之刚，以济其柔，故噬之，而深没其鼻也。" ,
                占:
                "【问时运】目下平平，因才力浅肤，宜乘大力者行事。\n" +
                "【问商业】现时货物，有辐辏而合之象，不妨深藏待价，乘时出售。吉。\n" +
                "【问战征】“肤”大也，“鼻”始也，从今伊始，可奏肤功，吉。\n" +
                "【问家宅】“鼻”为祖，“灭鼻”即灭祖，老宅不利。\n" +
                "【问疾病】现下邪在肌肤，致恐深入为患。\n" +
                "【问行人】偕伴而归。\n" +
                "【问婚嫁】定是兴旺之家，可成。"
            },
            {
                原: "六三：噬腊肉，遇毒，小吝，无咎。",
                象: ["遇毒，位不当也。"],
                析: "“腊肉”者，肉中藏骨，难噬之物也。骨藏肉中，人所不察，此爻以阴居阳，外柔内刚，有腊肉之象。干肉历久，噬之有肉败生毒，互卦（三、四、五）为《坎》，《坎》者毒之象。肉毒，如罪人强暴，治之而遇反噬，是可吝也。然用刑非为不当，故虽可吝，吝亦小焉，终无咎也。《象传》曰“位不当也”，柔居阳位，不得其当，故罪人不服，而反遇毒也。" ,
                占:
                "【问时运】目下气运不正，于得意事中，每多失意，或待人而反受人怨，幸无大害。\n" +
                "【问商业】明明可获利之业，或反有小损，多以处置不得其当。\n" +
                "【问战征】屯营不得其地，防有小败，宜谨守。\n" +
                "【问家宅】宅神不安，恐有小灾，宜祷。\n" +
                "【问疾病】药不对病，幸小病无碍。\n" +
                "【问行人】因事未归。\n" +
                "【问六甲】生女。"
            },
            {
                原: "九四：噬乾胏，得金矢，利艰贞吉。",
                象: ["利艰贞，吉，未光也。"],
                析: "“乾胏”，干肉之有骨者也，其坚至矣。坚以象九四之刚；肉柔骨坚，以象九四之阳居阴位。四刚在中，其治狱，必合初上两刚而并治。初刚一画为《乾》，《乾》为金，故初有金象；上刚一画属离，《离》为矢，故上有矢象。四近比五，为治狱之大吏，初上皆从之，故曰“得金矢”。金刚矢直，刚与直，为治狱之要道，九四得之，有何狱之不可治也！故乾胏虽坚韧，不难噬，犹言罪人虽强悍，不患不服矣。在四以柔居刚，刚或过严，故利用艰；柔或过宽，故利用贞，艰且贞，则吉矣。六爻中独四称吉。《象传》曰“未光也”，谓治狱则吉，而四居《离》之初，高明犹微，故曰“未光也”。" ,
                占:
                "【问时运】目下改旧从新，正当盛运，万事皆吉。\n" +
                "【问商业】譬如食肉得金，有利过于本之象，大吉。\n" +
                "【问家宅】家业素丰，安不忘危，常不忘变是保家要道，吉。\n" +
                "【问战征】能获敌粮饷，获敌弓矢，无坚不摧，所向皆利。但胜时，更宜谨慎为吉。\n" +
                "【问婚嫁】以勤俭之家，吉。\n" +
                "【问疾病】此症非易治，须谨慎调养，吉。\n" +
                "【问六甲】生男。\n" +
                "【问行人】在外得利，尚未归也。"
            },
            {
                原: "六五：噬乾肉，得黄金，贞厉，无咎。",
                象: ["贞厉，无咎，得当也。"],
                析: "“噬乾肉”者，喻肉之无骨易噬。“得黄金”者，黄为正，取正中也；金为刚物，取坚刚也。此爻备刚明之德，尊居五位，即断狱之君也。乾肉为肉已干，狱而至于人君亲决，亦必狱之已成者，罪虽已定，而人君犹有罪疑惟轻之意，故曰“贞厉”。如是而用刑，复何有咎？《象传》曰“得当也”，谓能以柔用刚，守正虑危，治狱之道，得其当也。" ,
                占:
                "【问时运】运正得时，所求所谋，无不如意，吉。\n" +
                "【问商业】所贩运货物，皆是上品，干净完美，大得利益；不特一时，此业可保长久。吉。\n" +
                "【问家宅】方位得当，大利。\n" +
                "【问战征】主敌城柔弱易攻，吉。\n" +
                "【问疾病】肉食宣忌，久亦可危，须谨慎调摄。\n" +
                "【问行人】正获利归来。\n" +
                "【问六甲】生男。\n" +
                "【问失物】即得。"
            },
            {
                原: "上九：何校灭耳，凶。",
                象: ["何校灭耳，聪不明也。"],
                析: "上居极位，在五之上，为《离》上画，刚明过盛。“校”，木校，刑具也。初阳在下，故校在足；上阳在上，故校在首。“何校灭耳”，校之厚，知刑之酷也。治狱之道，与其失人，不如失出，宜以钦恤为心。上九刚强自用，重刑示威，安能无凶乎？故曰“凶”。《象传》曰“聪不明也”，谓讼之听，全在于聪，刚而不中，失其聪，即失其明，故曰“聪不明也”。" ,
                占:
                "【问时运】目下大运已终，能以柔和处世，可保无虑，若任用强，难免凶矣。\n" +
                "【问商业】得利即止，不可过贪，斯无大损。\n" +
                "【问家宅】防有意外之灾凶。\n" +
                "【问战征】切勿前进，前进必凶。\n" +
                "【问疾病】或耳鸣耳聋，或项上生毒，凶。\n" +
                "【问六甲】生男，防有聋耳之疾。"
            }
        ]
    },
    {
        x:"101001",//贲
        e:{
            原: "贲：亨，小利有攸往。",
            象: ["贲亨，柔来而文刚，故亨。分刚上而文柔，故小利有攸往，天文也。文明以上，人文也。观乎天文，以察时变；观乎人文，以化成天下。","山下有火，贲，君子以明庶攻，无敢折狱。"],
            析: "“贲”从卉从贝。此卦上卦《艮》，《艮》，山也。《诗》“山有嘉卉”，故贲上从卉。且艮为果蓏，有卉之象。下卦《离》，《离》为鳖为蟹，为赢，为蚌，为龟，皆贝也。《尔雅》：“龟三足名贲”，故《贲》下从贝。《序卦》曰“贲饰也”，卉贝皆具彩色，是以谓饰。付氏云：“贲古班字，文章貌，言斑驳陆丽有文也。”《彖》辞所谓“天文”“人文”，由此来也。为卦山下有火，山生草木，下有火照彻，则草木皆被其光彩。《书》曰“贲若草木”，亦足证焉。卦上承《噬嗑》，《序卦》曰：“嗑者，合也，物不可以苟合，故受之以贲。”苏氏曰，“直情而行之谓苟，礼以饰情之谓贲”。礼以饰情，在乎相与为敬，敬则其合可久，此《贲》所以次乎《噬嗑》也。\n" +
            "通观此卦，内《离》外《艮》，《离》文明也，卦德由内达外，以文明为主，故名卦曰《贲》，取贲饰之象也。《彖传》所言柔文刚、刚文柔、观天文、观人文，皆以文致饰，亦以文得亨，是《贲》之象，由《离》而来，得艮而济，此全卦之体也。《象传》不曰火在山下，而曰“山下有火”，是隐然有以山止火之象。“以明庶政”，明也，“无敢折狱”，止也，亦见文不过质之意。六爻言贲，内三爻，《离》本卦，初二两爻，贡犹微，惟三爻贲为盛；上三爻，自《离》入艮，其言贲，皆黜华崇实，是救贲之偏而返其本也。故四虽“疑”而“无忧”，五虽“吝”而“终吉”，六“无咎”而“得志”。将使之自文还质，无偏胜之患，斯为贲道之大成也。全卦之义如此。" ,
            占:
            "【问时运】目下正当发动，百事顺适，但上有阻止，未能遂意径行。\n" +
            "【问商业】主经理人才干强明，足以任事；但精明者必刻利，还宜留意。\n" +
            "【问家宅】恐宅中时有火光发动，幸即扑灭，无大害也。\n" +
            "【问战征】前面有山，未易进攻。\n" +
            "【问疾病】是郁火上蒸之症，宜息火，犹不可过用寒剂，致真火扑灭。\n" +
            "【问行人】欲归又止，尚未定也。\n" +
            "【问六甲】生女。"
        },
        ye:[
            {
                原: "初九：贲其趾，舍车而徒。",
                象: ["舍车而徒，义弗乘也。"],
                析: "初刚在下，故曰贲趾，“徒”，徒行也。古者从大夫之后，不可徒行，初无位，故“舍车而徒”。贲趾者，是践仁履义，以仁义“贲其趾”者也，不以乘车为贲，而以徒行为贲。乘车者，世之所贲，君子所耻，是以舍之。《象传》曰“义弗乘也”，喜初之能守义也。" ,
                占:
                "【问时运】生性清高，不合时趋，以德亨，不以名亨。\n" +
                "【问商业】必是肩负买卖，非舟车贩运之业，虽小亦亨。\n" +
                "【问家宅】是勤俭起家，颇有知足不辱之风。\n" +
                "【问战征】陆军利。\n" +
                "【问行人】中途遇阻，步行而归。\n" +
                "【问疾病】症在初起，不食药而可愈也。\n" +
                "【问讼事】恐有惩役之灾。\n" +
                "【问失物】已舍去之，寻觅徒劳。"
            },
            {
                原: "六二：贲其须。",
                象: ["贲其须，与上兴也。"],
                析: "二以柔居柔，其爻自《噬嗑》六五柔来，变为六二，即《彖传》所谓“柔来而文刚”也。取象于颐，此爻曰“须”，须，随颐而动，故注曰：须之为物，上附者也。柔来文刚，文刚者，贲也，故曰“贲其须”。须眉为人生之仪表，所谓严其瞻视者，此也。《象传》曰“与上兴也”，“上”，谓上卦《噬嗑》，“兴”，动也。《噬嗑》内卦为《震》，《震》为动，须附上，爻自《噬嗑》来，故曰“与上兴也”。" ,
                占:
                "【问时运】目下平平，只可依人成事。\n" +
                "【问商业】与富商合业，必大兴旺，吉。\n" +
                "【问战征】必须与大军同进，方可得胜。\n" +
                "【问家宅】叨上人之福泽，藉以光大门楣。\n" +
                "【问婚嫁】“归妹以须，”尚宜待也。\n" +
                "【问六甲】生女。"
            },
            {
                原: "九三：贲如濡如，永贞吉。",
                象: ["水贞之吉，终莫之陵也。"],
                析: "三以一刚介二阴之间，当贲之盛，“贲如濡如，”润泽之象。顾阴能贲人，亦能溺人，诫之以“永贞”，在我有常贞之操，斯彼无凌逼之嫌，故曰“吉”。《象传》曰“永贞之吉，终莫之凌也”，“终”字与“永”字相应，盖贞而不永，则非有终者也。谓我刚正而永贞，彼自不能凌侮也。" ,
                占:
                "【问时运】当此盛运，光华润泽，名利双收，大亨。\n" +
                "【问商业】财源如水，大得清润，基业亦可保长久，大吉。\n" +
                "【问家宅】屋宇华洁，又得流水掩映，可以久居，吉。\n" +
                "【问战征】一军皆感被德泽，欢洽同心，可称王师无敌。\n" +
                "【问讼事】得直，彼亦不敢复犯。\n" +
                "【问婚嫁】百年偕老，吉。\n" +
                "【问六甲】生男。\n" +
                "【问行人】衣锦荣耀而归。\n" +
                "【问失物】向水中寻之，得。"
            },
            {
                原: "六四：贲如皤如，白马翰如，匪寇婚媾。",
                象: ["六四，当位疑也；匪寇婚媾，终无尤也。"],
                析: "四在上卦之下，《贲》已过中。“皤”，素白色也，“翰”，白色马也。卦体三、四、五互《震》，《震》为白马，故取白马之象。《震》上六曰“婚媾”，故亦有婚媾之象。四与初为正应，为三所隔，不获相贲，故曰“皤如”，“白马翰如”，亦未获其贲也。然九三刚正，“非寇”，乃求婚媾耳。四与初正应，必相亲贲，不能终隔也。《象传》曰“当位疑”，四疑二也。曰“终无尤”，谓初四正应。终必相合，故云“终无尤”也。" ,
                占:
                "【问时运】目下运有阻碍，安分则吉，明年便可亨通。\n" +
                "【问商业】宜迅疾贩售，迟缓，防货物变色。\n" +
                "【问家宅】一宅之内，既有丧事，又逢婚事，前塞后通，无咎。\n" +
                "【问战征】有和亲通好之议。\n" +
                "【问疾病】中胸有阻，故上下不调，积阻消化，便无咎也。\n" +
                "【同行人】有爱女眷恋，一时未归。\n" +
                "【问六甲】生女。"
            },
            {
                原: "六五：贲于丘园，束帛戋戋，吝终吉。",
                象: ["六五之吉，有喜也。"],
                析: "“丘园”者，园之依丘陵者。艮有丘之象，“贲于丘园”者，谓留意于农桑之事。“束帛”者，赠人之物，“戋戋”者，浅少之意。不贲市朝而贲丘园，敦本也。“束帛戋戋”，谓六五以柔居尊位，能修柔中之德，黜祛奢华，敦崇俭约，如大禹之卑宫室，菲饮食也，故曰“贲于丘园，束帛戋戋”。“吝”，谓居尊位，而留心鄙事，未免吝也，然不失黜华崇实之旨，故曰“终吉”。《象传》曰“有喜也”，有喜者，谓实有可喜也。天下之俗成于俭，败于奢，一人倡之，世风可返于淳朴，则所喜非在一人，喜其能移风易俗也。\n" +
                "一说，丘园为隐士所居，六五能以“束帛”，聘求丘园之遗贤，共辅文明之治。聘贤仅以“戋戋”束帛，礼意未隆，故曰“吝”；在贤者不以币帛为悦，而以恭敬为悦，是以币帛虽微，贤者亦应聘而来，故终有吉也。亦通。" ,
                占:
                "【问时运】目下恰行正运，然作事一宜俭勤为吉。\n" +
                "【问商业】买卖最直木材绸物二行，货物不必多，而获利颇佳。\n" +
                "【问家宅】农桑为业，勤俭家风，吉。\n" +
                "【问战征】宜招用野老，以作向导，可以得胜。\n" +
                "【问婚嫁】聘礼虽微，却好得一贤妇，大喜。\n" +
                "【问六甲】生男。"
            },
            {
                原: "上九：白贲，无咎。",
                象: ["白贲，无咎，上得志也。"],
                析: "上处《贲》之终，终极不变，弊将无质，故《贲》之义，始因天下之质，饰之以文，并将天下之文，归之于质。“白贲”者，素朴自然，是无色也，如宝玉不雕，珍珠不饰，不使文掩其质，“白贲”之谓也。《象传》曰“上得志也”，居卦之上，处事之外，矫世俗之文饰，而敦尚朴素，独行其专，优游自得耳。\n" +
                "凡卦如《泰》与《否》、《剥》与《复》、《涣》与《萃》等，皆有对偶，惟《贲》无对，独于卦中，分贲与不贲两义为对。是读《易》之诀也。《中孚》一卦亦然。",
                占:
                "【问时运】好运已终，劳者宜归于逸，动者宜返于静，优游自适，聊以取乐耳。\n" +
                "【问商业】现在货价已高，时令将完，不必装饰，即可出售，定得利也。\n" +
                "【问家宅】清白家风，位置亦高，吉。\n" +
                "【问战征】身当上将，堂堂之阵，正正之旗，不用谲计奇谋，自然获胜。吉。\n" +
                "【问疾病】病在上焦，宜用清淡之剂，吉。\n" +
                "【问行人】得利归来。\n" +
                "【问六甲】生男。\n" +
                "【问失物】向高处寻觅，可得。"
            },
        ]
    },
    {
        x:"000001",//剥
        e:{
            原: "剥：不利有攸往。",
            象: ["山附于地，《剥》，上以厚下，安宅。"],
            彖: ["《剥》，剥也，柔变刚也。不利有攸往，小人长也。顺而止之，现象也。君子尚消息盈虚，天行也。"],
            析: "“剥”字从刀，录声。录，《说文》“刻木也”《归藏》则作刀刀，从两刀。卦体上《艮》下《坤》，《艮》为山，《坤》为地，“山附于地”也。卦德五阴一阳，一阳居上，五阴在下。所谓山者，亦贲耳，阴盛阳微，有发发乎山崩为地之象。《彖传》不曰山在地上，而曰“山附于地”，“附”，寄托也，已难保安止而不动矣。日削日剥，势所必至，故名此卦曰《剥》。《剥》继《贲》而来，以《贲》之饰极，反而为《剥》，《离》变为《坤》，火化为土，土旷山微，所始培塿，《剥》之易易，是小人众而君子孤也。对卦为夬，夬五阳盛长，决去一阴，故曰“利有攸往”；《剥》五阴盛长，剥落一阳，故曰“不利有攸往”。\n" +
            "通观此卦，阴盛剥阳，九月之卦，肃杀之气，剥落万物之象也。夫阴阳消长，天行也，治乱盛衰，世运也。造化之理，文胜必敝，朝华之草，夕而零落，此《剥》所以次《贲》也。夫祸起于微，悔生于终，强与之争，终必致灾，安而自守，可保厥初，《系辞》所以戒其攸往，勉其顺止者，即此理也。初为祸之始，《剥》之渐也；二则较凶矣；三知从正，其势自孤；四虽剥至于肤，灾切近矣；五居尊位，独能调剂群情，招怀以恩，女子小人，各安其分，使相率以从阳，不至进而剥上，上爻硕果之得以存者，赖有此耳。善变者，转祸为福，不善变者，化吉为凶，是以剥则始凶，而终则不凶也。" ,
            占:
            "【问时运】运不甚佳，宜安定自守，无咎。\n" +
            "【问商业】须厚其资本，聚积货物，附运出洋，必获利也。商以剥人之财为利，故吉。\n" +
            "【问家宅】寄居之宅，可出资买归，自己之宅反不利。\n" +
            "【问战征】防敌袭击，宜厚其兵力。\n" +
            "【问疾病】魂不附体，恐不吉。\n" +
            "【问行人】附伴而行，即可归宅。\n" +
            "【问六甲】生女，始危后安。\n" +
            "【问失物】得则得矣，恐有残缺。"
        },
        ye:[
            {
                原: "初六：剥床以足，蔑贞凶。",
                象: ["剥床以足，以灭下也。"],
                析: "床者，人所坐卧也，此卦上实下虚，床亦上实下虚，故取其象。阴之剥阳，自下而上，初在下，象床之足，故先剥以足。床有足而立，剥足则倾矣，倾则凶。“蔑”，灭也，“贞”，正也，阴之剥阳，即邪之灭正，是小人之害君子也，故曰“蔑贞凶”。《象传》曰“以灭下也”，以床言，足在下，以爻言，初亦在下，故曰“灭下也”，是剥之始也。一说，“贞”即桢，《程传》“辨”谓干，则以贞为桢，可备一解。俞氏以“剥床以足蔑”为句，谓固执而不乱，变则凶，是又一解也。",
                占:
                "【问时运】目下运当剥削，防有足疾。\n" +
                "【问商业】堆积货件，防底部朽烂，或载运出洋，船底受水，被坏。\n" +
                "【问家宅】防柱础门限，有损将倾。\n" +
                "【问战征】防敌攻地道。\n" +
                "【问行人】有足疾，不能归也。\n" +
                "【问疾病】是足少阴之症，正不胜邪，凶。"
            },
            {
                原: "六二：剥床以辨，蔑贞凶。",
                象: ["剥床以辨，未有与也。"],
                析: "“辨”，《程注》谓“床之干也”，是床足之上，床身之下，分辨处也。初剥足，二剥辨，阴渐而进也。剥至于辨，床愈危矣，邪盛蔑正，凶与初同。《象传》曰“未有与也”，指上九言，谓二与初，同恶相济，谋《剥》上九，上九孤阳在上，未有应与。《象》盖为上九危也。",
                占:
                "【问时运】自去年来，逐渐低下，被人剥削，不能辨白。凶。\n" +
                "【问商业】置办货物，价渐剥落，不能获利也。凶。\n" +
                "【问家宅】“辨”，亦通变。言家宅速宜变迁，方得避凶。\n" +
                "【问行人】办装即归。\n" +
                "【问战征】未有应接之军，不可动也，动则凶。\n" +
                "【问疾病】病人已著床，未有良医，防不治也。凶。\n" +
                "【问六甲】生女难育。\n" +
                "【问失物】未能复有。"
            },
            {
                原: "六三：剥，无咎。",
                象: ["剥之无咎，失上下也。"],
                析: "以阴居阳，与上相应，其类属阴，故其心在助阳。当群阴剥阳之时，为三独应刚，是以小人而保全君子者也，许以“无咎”，不没其善也。《象传》曰“失上下也”，谓其处上下诸阴之间，独能去党而从正，是失其党也，故曰“失上下也”。",
                占:
                "【问时运】运虽不正，能反其所为，可以免咎。\n" +
                "【问商业】同帮皆望高价，已独潜行脱售，虽失同帮之意，而独得利。\n" +
                "【问家宅】去其椽瓦，平其基地，剥落改造，无咎。\n" +
                "【问战征】是军中最有计谋者也。虽不与诸军约会，独自进攻，可得胜也。无咎。\n" +
                "【问疾病】宜消导攻伐之剂，服之得愈。"
            },
            {
                原: "六四：剥床以肤，凶。",
                象: ["剥床以肤，切近灾也。"],
                析: "剥之灾，萌于初爻，至四爻，渐逼渐近。四以阴居阴，与初二同恶相济。在初二居内卦，卦分内外，床隔上下，距上爻远，所剥仅在“足”与“辨”。四爻与上同卦，愈近则剥愈甚，故直及于“肤”。就爻次第观之，初为床足，二为床辨，三爻为床身，四爻则为床上之人身。艮为指，为喙，有人身之象，故曰“剥床以肤，凶”。《象传》曰“切近灾也”，剥及于肤，灾及其身矣，故曰“切近灾也”，深为一阳危焉。剥者，小人剥君子，宜为君子凶矣，初、二、四三爻，不曰君子凶，而第浑言曰凶，知剥之害，国破家亡，君子固凶，而小人亦难免于凶也，故统象之曰“凶”，意微哉！一说以“肤”作箦，箦，床板也，足备一解。",
                占:
                "【问时运】运大不佳，有身体受伤之惧。\n" +
                "【问商业】恐剥耗过甚，又防意外之祸。\n" +
                "【问家宅】此宅必破败不堪，居人亦寥落，致防倾塌。\n" +
                "【问战征】恐主将有灾。\n" +
                "【问疾病】凶。\n" +
                "【问六甲】生女，产妇亦可危。"
            },
            {
                原: "六五：贯鱼以宫人宠，无不利。",
                象: ["以宫人宠，终无尤也。"],
                析: "五为尊位，以阴居阳，与上比近，知群阴上逼，一阳已危，无可再剥，阴存护阳之计；以阳制阴，阴众阳孤，必不受制，不如率阴以从阳也。曰“鱼”，曰“宫人”，皆阴象。曰“贯鱼”，犹言率众阴而成贯也；曰“宫人宠”，是以宫人而受一阳之宠也。一阳既得免剥，众阴亦得免凶，故曰“贯鱼，以宫人宠，无不利”。《象传》曰，“终无尤也”，六五为群阴之首，能率群小而慑服于君子，硕果之得保存者，五爻之力也，故曰“终无尤也”。剥者，众阴皆欲剥阳，惟三五阴而居阳，能为一阳委曲保护。初以阳居阴，只知有《剥》，《剥》之灾，实起于初，盖以初卑微下贱，非仁之九者也。",
                占:
                "【问时运】目下气运堂皇，事事圆到，百无不利。\n" +
                "【问商业】可得满贯满万之利，北海海产生业尤佳。\n" +
                "【问家宅】有妇女主家之象。\n" +
                "【问战征】须行离间敌军之计，可获胜也。\n" +
                "【问疾病】是阴亏之症，须自珍爱，尚可无忧。\n" +
                "【问行人】有外宠，必将携伴而归。\n" +
                "【问六甲】生女。"
            },
            {
                原: "上九：硕果不食，君子得舆，小人剥庐。",
                象: ["君子得舆，民所载也。小人剥庐，终不可用也。"],
                析: "《艮》为果，果在树上，故于上爻，有硕果之象。艮止也，故“硕果不食”。“舆”，地也，地以载物，“得舆”者，得民之所承载也。“庐”，屋也，用以庇人，“剥庐”者，无所用其庇也。此爻一阳在上，譬如硕果仅存，高出卦外，非群阴所得蚀食，故曰“硕果不食”。原其不食之故，以天道观之，无众阳消灭，而群阴独存之义；以人事观之，无君子俱亡，而小人独存之理。天地之间，岂可一日无善类乎？《剥》当十月，正万木摇落之时，大果尚存木杪，果中有仁，足以复生，即剥未尽而阳复生之象。且剥极则乱，乱极则思治，故众心爱戴君子，谓之“君子得舆”，小人剥去君子，终自失其所庇，故曰“小人剥庐”。《象传》曰：“君子得舆，民所载也。小人剥庐，终不可用也，君子德泽长流，故民必载之，小人恶迹显著，故“终不可用也”。此爻变则为《坤》，是终不可用之象也。",
                占:
                "【问时运】目下气运衰微，一年后即值好运。\n" +
                "【问商业】卖出者尚得微利，买入者必多剥耗。\n" +
                "【问家宅】忠厚之家，尚有余泽，刻薄起家者，恐有墙屋倾圯之患。\n" +
                "【问战征】守者无咎，攻者必败。\n" +
                "【问疾病】有饮食不进之虑。\n" +
                "【问六甲】生男，是独子也。"
            },
        ]
    },
    {
        x:"100000",//复
        e:{
            原: "复：亨。出入无疾，朋来无咎，反复其道，七日来复，利有攸往。",
            象: ["雷在地中，复，先王以至日闭关，商旅不行，后不省方。"],
            彖: ["复，亨。刚反，动而以顺行，是以出入无疾，朋来无咎。反复其道，七日来复，天行也。利有枚往，刚长也。复，其见天地之心乎？"],
            析: "“复”从彳，行貌，从复，行故道也，有去而复来，消而复息之义。所谓以《坤》牝《乾》，灭出复震，为余庆也，故名曰《复》。为卦《坤》上《震》下，一阳在五阴之下，阴极而阳复，与《剥》相反，与《姤》旁通。《序卦》曰：“物不可以终尽，剥穷上反下，故受之以复。”此《复》之所以次《剥》也。\n" +
                "通观此卦，《剥》之一阳在上者，《复》即阳生于下，如雷藏地中，无中含有。乾元资始者，于是露其机，贞下起元；坤元资生者，于是呈其候。天地生物之心，非至是而始有，乃至是而始见也。顺而动，动无不亨；顺而往，往无不利。出柔而入刚，刚有何病？以我而求朋，朋来何咎？一反一复，其道即在旬日间耳。六爻皆以复道为辞，初九之“不远复”，如克己复礼之颜子，贤而希圣，生而知之者也。六二之“休复”，下比初九之刚，如友直、谅、多闻之士，亲贤取友之宓子贱，学而知之者也。六三之“频复”，如日月至焉之诸子，士而希贤者也。六四之“中行独复”，如悦周公孔子之道之陈良，亦圣人之徒也，困而学之者也。六五之“敦复”，如反乎身之汤武，圣而希天者也。上九之“迷复”，则如飞廉恶来，怙终而不悛其恶者也，困而不学者也，不惟为一身之祸，且为天下祸，故曰“迷复，凶，有灾眚，终有大败”。圣人于六三之“频复”，犹曰“无咎”，而独罪上六之“迷复”，如此，其重改过而恶怙终也切矣。《系辞传》曰，“圣人之情见乎辞”，其此之谓乎？",
            占:
            "【问时运】好运初来，尚未发动，静以待之，自然获吉。\n" +
            "【问商业】货物完备，时价亦动，宜暂停售，必得利也。\n" +
            "【问家宅】此宅现时闭歇，须待春时，方可迁居。吉。\n" +
            "【问战征】防敌军埋伏地雷，须暂停战，以养兵力。吉。\n" +
            "【问疾病】是痰火之症，饮食不进，交冬令宜防。\n" +
            "【问讼事】一时不能审结。\n" +
            "【问六甲】生男，交春分产。\n" +
            "【问婚嫁】现因媒人尚未往说，春初可成。吉。\n" +
            "【问行人】冬季不归，开春归来。\n" +
            "【问失物】一时难觅，日后可得。"
        },
        ye:[
            {
                原: "初九：不远复，无祗悔，元吉。",
                象: ["不远之复，以修身也。"],
                析: "此卦初九一阳，自《乾》阳来，入《坤》群阴中，忽复本位，名之曰《复》。卦之《复》就造化言，爻之《复》就人心言是也。此爻《复》之初，为《复》道之始。七日即复，故曰“不远”，是以不至悔而得“元吉”也。“元吉”者，即复《乾》之吉也。“祗”者至也，人虽圣贤，不能无过，惟贵速改，过而不改，则有悔而凶可知也。《象传》曰“以修身也”，修者所以补其缺，正其误也。占者知此，则人欲日消，天理日明，可以为圣，可以为贤。“修身”二字，包括深远，不可不知也，何则？六二之《传》日“仁”而称美之，六四之《传》曰“道”而赞叹之。“修身”二字，兼仁与道，其所关至大。心内而身外，以存养言，则在心；以修为言，则在身：身心一也。",
                占:
                "【问时运】好运即来，渐渐发动，一往顺利，大吉。\n" +
                "【问商业】前所耗失，即可复得，可免悔恨，大吉。\n" +
                "【问家宅】旧业复兴，即在目前，大吉。\n" +
                "【问战征】即日可转败为成，大吉。\n" +
                "【问讼事】始审不直，再控必胜，大吉。\n" +
                "【问婚嫁】主散而复成，大吉。\n" +
                "【问行人】不日即归，吉。\n" +
                "【问疾病】静养即可复，元吉。\n" +
                "【问六甲】即日生男。\n" +
                "【问失物】即日可得。"
            },
            {
                原: "六二：休复，吉。",
                象: ["休复之吉，以下仁也。"],
                析: "此爻以阴居阴，得其中正，与初九切比，志从于阳。嘉初之能复于道，甘心下己，以友其仁，切磋琢磨，恶念潜消，善心日生，故曰“休复，吉”。初爻得《乾》阳之正，开《复》道之首，故曰“元吉”；六二取人为善，自能从容改图，其功次于初矣，故曰“吉”。《象传》曰“以下仁也”，初复于仁，二比而下之，是以吉也。《易》三百八十四爻，未尝言仁，此爻言之。所谓“复其见天地之心”者，天地之心，即仁也；所谓仁，元善之旨也。",
                占:
                "【问时运】目下气运亦好，事事能择善而从，故事事得吉。\n" +
                "【问商业】能与人共利，其业必兴，吉。\n" +
                "【问家宅】家庭多休祥之征，自能兴复旧业。吉。\n" +
                "【问战征】一时暂休攻克，姑示其弱，以养锐气。吉。\n" +
                "【问疾病】宜初治之医，复诊视之。吉。\n" +
                "【问行人】必从长辈而归。\n" +
                "【问六甲】生女。\n" +
                "【问失物】就低下处寻之。"
            },
            {
                原: "六三：频复，厉无咎。",
                象: ["频复之厉，义无咎也。"],
                析: "三爻位不中正，志刚而质柔，质柔则见事而不明，志刚则狂躁而妄动，故屡复而屡失，是以有“厉”，亦屡失而屡复，终可“无咎”也。虽有失身亏行之惧，自无长傲遂非之过，故曰“频复，厉，无咎”。周公之系辞，隐其屡过之罪，称其“频复”之善；孔子释之曰“义无咎也”，是开人以改过迁善乏门也。意深哉！" ,
                占:
                "【问时运】一好一歹，时有得失，能据其得而不失，是在人也。\n" +
                "【问商业】有亏有盈，能使盈多亏少，亏而复盈，亦可获利。\n" +
                "【问家宅】有迁移不定之象。\n" +
                "【问疾病】屡治屡发，虽危，可保无害。\n" +
                "【问讼事】有频翻口供，转致危厉之象。\n" +
                "【问行人】归志未决。\n" +
                "【问六甲】生男，颇涉难产，无害。\n" +
                "【问失物】失非一次，当可寻得。"
            },
            {
                原: "六四：中行独复。",
                象: ["中行独复，以从道也。"],
                析: "此爻居五阴骈列之中央，独应初爻之卦主，故能杰出群阴之间，依附仁人，是心知好善，不移习俗，而能复道者也，故曰“中行独复”。所谓“择乎中庸，得一善，则拳拳服膺，而不失之”者也。然其所复犹微，故不曰吉。《象传》曰“以从道也”，谓初复于道，而四从之，故曰“从道”。" ,
                占:
                "【问时运】气运柔弱，意欲振兴，惜力不能逮。\n" +
                "【问商业】谋划精当，不失其正，资本未充，为可惜也。\n" +
                "【问家宅】女眷多，男丁少，未免有独寐寤歌之慨。\n" +
                "【问战征】防中道设伏。\n" +
                "【问疾病】虚弱之症，宜从初治之医调治。\n" +
                "【问行人】至中路复回，得伴再归。\n" +
                "【问婚嫁】宜从前媒。\n" +
                "【问失物】半途觅之。"
            },
            {
                原: "六五：敦复，无悔。",
                象: ["敦复无悔，中以自考也。"],
                析: "五有柔中之德，尊居君位，位得中，故能“复”，《坤》为厚，故曰“敦”。自知其非，不惮迁善，既能复之，又加以“敦”，是知之明，力之笃也，则一得而弗失之矣，何悔之有？故曰“敦复无悔”。《象传》曰，“中以自考也”，谓初之复，复在近，可免于悔，五之《复》，复于厚，悔之有无未知，时当返而“自考”也。盖初之“不远复”，入德之事，五之“敦复”，成德之事也。" ,
                占:
                "【问时运】目下气运当正，事事从厚，有前功，无后悔\n" +
                "【问商业】资财充足，往复获利。\n" +
                "【问家宅】祖基深厚，旧业复光，吉。\n" +
                "【问战征】军力厚实，可以攻复城池也。\n" +
                "【问疾病】病者精神充足，气体丰腴，无患也。\n" +
                "【问六甲】生男。\n" +
                "【问失物】宜自忖度。"
            },
            {
                原: "上六：迷复，凶。有灾眚，用行师，终有大败，以其国君凶，至于十年不克征。",
                象: ["迷复之凶，反君道也。"],
                析: "上爻居《复》之终，《坤》之极，《坤》为迷，故曰“迷复”。迷而不复，故必有凶。“有灾眚”，灾自外来，眚由自作，迷溺至此，无往非害。《坤》为众，《震》为行，故“用行师”。《坤》上六所云“龙战于野，其血玄黄”，即行师大败之证也。“行师”既至“大败”，国君焉得不凶？兵连祸结，至十年而未已。十年者数之终，一败而终不能振，即谓有迷而终不能复矣。盖天下之祸，无不由一念之迷溺而来，迷在于身，则一身被祸，迷在于国，则一国被祸，深著迷复之害也。《象传》曰“反君道也”，《复》之君，初九阳也，《姤》之君，初六阴也，上迷复，不奉《复》之九，而奉《姤》之六，是阴阳相反也，故曰“反君道也”。" ,
                占:
                "【问时运】气运颠倒，作事乖张，谨慎免祸。\n" +
                "【问商业】货物不齐，期约不准，市价不的，必致大耗；时不能《复》业，凶。\n" +
                "【问家宅】防有怪崇，居者多不利。\n" +
                "【问战征】辙乱旗靡，大败之象。\n" +
                "【问疾病】症已危险，久病延年，犹为幸也。\n" +
                "【问行人】在外多凶，十年内恐不能归也。\n" +
                "【问六甲】生女。此女长成，亦大败之命。"
            }
        ]
    },
    {
        x:"100111",//无妄
        e:{
            原: "无妄：元亨，利贞。其匪正有眚，不利有攸往。",
            象: ["天下雷行，物与无妄，先王以茂对时育万物。"],
            彖: ["无妄，刚自外来，而为主于内。动而健，刚中而应，大亨以正，天之命也。其匪正有青，不利有攸往，无妄之往，何之矣？天命不枯，行矣哉？"],
            析: "“无妄”，诚也，是即《中庸》“至诚无息”之谓也。《序卦》曰：“复则不妄矣，故受之以无妄。”盖《无妄》之诚，天之道也；《复》而《无妄》，此为“诚之”者，人之道也。为卦《乾》上《震》下，《乾》健也，《震》动也，健而动，动合夫天也，合乎天即诚也。古圣经传皆言诚，无咎二字，独见于《易》。朱子解《中庸》“诚”字，谓“即真实无妄”，而解《易》“无妄”，谓“即实理自然”。要之理之出于自然者，天也，天即诚也，诚即《无妄》也，其旨一也。\n" +
            "通观此卦，上《乾》下《震》，动合夫天，刚而得中，故名曰《无妄》。无妄者浑全实理，绝无意外期望之谓也。是以循其实理之自然，则往无不利；出乎实理之所非，则动必得咎。虽祸福之来，亦有不测，福自天降，天所佑也；祸而天降，如六三之灾，九五之疾是也；祸而自致，则“非正”之“眚”是也。六爻中，言“吉”，言“利”，言“灾”，言“疾”，言“喜”，言“眚”，皆所谓祸福也。初爻为卦之主，浑全元善，故“吉”。二爻循乎自然，不假造作，故“利”。四爻止所当止，守之以恒，故“无咎”。上爻居卦之终，极而复动，故“有眚”。凡爻象，初动者必终静，初静者必终动。此卦初“往吉”，二往利，皆取其动也；三“灾”，四“贞”，五“疾”，皆勉其守而勿动也；上“有眚”则戒其动之穷也。卦体《乾》健《震》动，故初象多动，动极反静，故终必静也。知夫此，可以谈《无妄》之卦。",
            占:
            "【问时运】目下运得其时，百事咸宜，吉。\n" +
            "【问商业】正如大旱望雨，响雷一声，人人翘望。货物一到，无不旺销，百般获利，大吉。\n" +
            "【问家宅】此宅中时有作响，但无忌碍，屋运甚旺，人口繁盛，吉。\n" +
            "【问战征】有风雷席卷之势，务须正正之旗，堂堂之阵，若欲以诈取胜，反恐有祸。\n" +
            "【问疾病】是胸有积物，动而未化，宜随时运动，物自消化，“勿药有喜”。\n" +
            "【问行人】现时已动身，即日可归。\n" +
            "【问婚嫁】两家素有往来，门媚相对，大吉。\n" +
            "【问六甲】生男，临时安产，吉。\n" +
            "【问失物】或鼓旁，或磨下，或并臼之侧，寻之可得。\n" +
            "【问天时】一雨即晴。"
        },
        ye:[
            {
                原: "初九：无妄往，吉。",
                象: ["无妄之往，得志也。"],
                析: "初为内卦之主，《震》初之刚，自《乾》而来，故《彖传》曰“刚自外来”。初阳始生，诚一未分，不杂未起，率性而动，动罔不臧，以其动合乎天也；由兹而往，往无不吉焉，故曰“往吉”。《象传》曰“往得志也”，诚无不通，志无不遂，故往而得志也。" ,
                占:
                "【问时运】目下吉，但宜出而有为，不宜杜守家居。\n" +
                "【问商业】利行商，不利坐贾。\n" +
                "【问家宅】宜迁居，吉。\n" +
                "【问战征】宜进攻，吉。\n" +
                "【问疾病】宜出外就医，吉。\n" +
                "【问行人】或有事他往，吉。\n" +
                "【问六甲】生男，来月可产，吉。\n" +
                "【问婚姻】赘婿吉。\n" +
                "【问失物】宜往外寻之。"
            },
            {
                原: "六二：不耕获，不菑畬，则利有攸往。",
                象: ["不耕获，未富也。"],
                析: "《乾》为郊野，《震》为禾稼，故爻取农象。耕而有获，菑而有畲，原非意外期望；然以耕而期获，以菑而期畲，心有期望，无妄之望，即是妄也。爻曰“不耕获，不菑畲”，谓当耕则耕，耕未尝有心于获，宜菑则菑，菑未尝有意于畲，任乎先天，不假后起，犹之谋道者非为干禄，修德者非为求名，尽其在我，不计外来。如是则为《无妄》，《无妄》则“利有攸往”，言无妄心，自无妄行，则往无不利也。《象传》曰“未富也”，谓二爻居柔得正，中虚无欲，未尝有心于富也；未富而不妄意于富，此即所谓《无妄》也。" ,
                占:
                "【问时运】目下运得其正，自有意外财饷，大利。\n" +
                "【问商业】不谋而获，却得大利，吉。\n" +
                "【问家宅】此宅想是承继之产，或为人经管庄舍。\n" +
                "【问战征】前途倒戈，有不胜而胜之象。\n" +
                "【问疾病】“勿药有喜”。\n" +
                "【问婚姻】是招赘之亲。\n" +
                "【问行人】在外得利，一时未归。\n" +
                "【问六甲】生女。"
            },
            {
                原: "六三：无妄之灾，或系之牛。行人之得，邑人之灾。",
                象: ["行人得牛，邑人灾也。"],
                析: "“无妄之灾”，谓非己之所致而灾，天数之灾厄，或有不可免也。六三位不中正，故事出意外，有如“或系之牛”。“系”者而曰“或”，原不知为谁氏之牛也；“行人”，行路之人也，见其牛以为无主也，而窃得之。在邑之人，未之知也，而捕者则必就邑人而诘之，是邑人无故而受灾也，即所谓“无妄之灾”也。三至五《离》，《离》为牛，下互《艮》，《艮》为拘，上互《巽》，《巽》为绳，有系牛之象。《乾》健行，象行人，《震》为守，象邑人。《乾》之行，至上止，上为行人，故上曰“行有眚”，是得牛而遭眚也。《震》之守，属于三，三为邑人，故曰“邑人之灾”。上得其牛，而三罹其灾，是三为“无妄之灾”。上之《象》曰“穷之灾也”，上乃自致之灾，所谓自作之孽也。《象传》曰“邑人灾也”，此意外之灾，惟顺受焉而已。" ,
                占:
                "【问时运】目下运值尴尬，防有意外之事，宜谨慎。\n" +
                "【问商业】防他人占利，而己耗财。\n" +
                "【问家宅】此宅恐为外人侵占。\n" +
                "【问战征】行军得胜，守军防有损败。\n" +
                "【问疾病】此病恐是外来人传染，可虑。\n" +
                "【问行人】归则归矣，恐家人有灾。\n" +
                "【问婚嫁】宜与远人结亲，吉。\n" +
                "【问失物】已被行人拾去。"
            },
            {
                原: "九四：可贞，无咎。",
                象: ["可贞无咎，固有之也。"],
                析: "四阳刚而居《乾》体，刚而无私，无妄者也。然位当上下之交，初《乾》阳刚犹柔，恐固守未定，或有偶涉于妄者乎？故诫之曰“可贞”。盖以《乾》之健，乘《无妄》之体，更当以《乾》之贞，葆无妄之诚。斯无妄之理，静以存之，固以守之，自无过失矣，故曰“无咎”。《象传》曰“固有之也”，无妄之心，即天心也，秉于生初，非由外铄，故曰“固有”也。" ,
                占:
                "【问时运】目下气运平顺，循分则有获，妄动则有咎。\n" +
                "【问商业】坚守旧业，自然亨通。\n" +
                "【问家宅】此宅本是祖基，宜永保之，毋坠。\n" +
                "【问战征】已占入外卦之地，宜坚守城池，切勿妄进。\n" +
                "【问疾病】此时宜安静调养，来月“勿药”而愈。\n" +
                "【问行人】一时未归，在外无咎。\n" +
                "【问六甲】生男。\n" +
                "【问失物】必可复得。"
            },
            {
                原: "九五：无妄之疾，勿药有喜。",
                象: ["无妄之药，不可试也。"],
                析: "“疾”犹灾也。五动体《坎》，《坎》为疾，故曰疾。疾之来也，有由自致者，有因天时而非自致者，非由自致而疾者，即所谓“无妄之疾”也。“无妄之疾”，如在天为日之食，风之暴，雨之淫，雷之迅，皆一时阴阳之偏，偶触而来，时过则平，未可以药救也。在人，“无妄之疾”亦犹是焉，不容以药治之也，故曰“勿药有喜”。“有喜”，谓疾去而为喜也。当疾之时，以药治之耳，五爻刚中得位，天德全，《无妄》之至者也，复何遗憾？爻之取象于疾者，盖以汤之幽夏台，文之囚羑里，或有为盛德之累者焉。此则谓无妄之疾也，顺以守之，祸患自释，即“勿药”之义焉。《象传》曰“无妄之药，不可试也，”“无妄之疾”，本非真疾，药之反成疾矣，故曰“不可试”，慎之至也。" ,
                占:
                "【问时运】目下气运当正，意外之事，不必介意，全乎在我而已。\n" +
                "【问商业】凡一时物价，无故上落，皆无害商业，过时自平，切勿扰动。\n" +
                "【问家宅】防有风扫雪压倾圯之患，然无大害，致有喜兆。\n" +
                "【问战征】防军队中有时疫流行之患，宜洁净营屯，勿妄用药。无咎。\n" +
                "【问行人】恐中途有涉意外之事，然即归来\n" +
                "【问讼事】有意外牵涉，不辩自释。\n" +
                "【问六甲】生男。\n" +
                "【问失物】不寻自得。"
            },
            {
                原: "上九：无妄行，有眚，无攸利。",
                象: ["无妄之行，穷之灾也。"],
                析: "上爻阳居卦之终，为《无妄》之极，极而复行，行必有眚，有何利焉！《彖》辞所谓“非正有眚”，盖指上也。上与三应，三为“邑人”，上为“行人”，三之灾，自上致之；三既被灾，上岂能无眚乎？《象》曰“穷之灾也”，位已上穷，复欲进行，是穷极而为害也。" ,
                占:
                "【问时运】好运已终，宜安守勿动，动则终凶。\n" +
                "【问商业】历来贸易，颇称得利，兹值岁终，或当时令交换之际，宜暂静守，切勿再进，防有损耗。\n" +
                "【问家宅】此虽旧宅，居之则吉，慎勿他迁，迁则有眚\n" +
                "【问战征】地步已极，不可复进，进则有害。\n" +
                "【问疾病】必是老年，宜颐养自适。\n" +
                "【问行人】即日可归，归后切勿出行。\n" +
                "【问六甲】生男。\n" +
                "【问失物】恐穷追不得。"
            },
        ]
    },
    {
        x:"111001",//大畜
        e:{
            原: "大畜：利贞。不家食，吉。利涉大川。",
            象: ["天在山中，大畜，君子以多识前言往行，以畜其德。"],
            彖: ["大畜，刚健，笃实，辉光，日新其德。刚上而尚贤，能止健，大正也。不家食，吉，养贤也。利涉大川，应乎天也。"],
            析: "“大畜”为卦，下《乾》上《艮》，《乾》，健也，《艮》，止也，畜亦止也。大对小而言：《小畜》《巽》在《乾》上，五阳一阴，以一阴畜《乾》三阳，《巽》体柔顺，其力不固，故为《小畜》；《大畜》二阴四阳，《艮》体笃实，能厚其储，故为《大畜》。《杂卦传》曰，“大畜时也”，《大畜》以《艮》畜《乾》者也，《乾》之纯阳，进而不止，而《大畜》能畜之，若不欲其进者，时未可也。不惟其止，惟其动，健而又动，《无妄》所以为灾也；不惟其动，惟其止，健而能止，《大畜》所以为时也。《序卦》曰：“有无妄然后可畜，故受之以《大畜》。”此《大畜》之所以次于《无妄》也。\n" +
            "通观此卦，六爻专言畜止之义。初九抱刚健之德，初阳尚微，能受六四之畜，知难而自止者也，故有“有厉利己”之辞。九二履得其中，有知时之明，知其功之不可遽成，止而不行者也，故有“舆脱輹”之辞。九三以阳居阳，志刚而才强，未免锐进之嫌，惟“艰贞”自处，见可进而进，则可以济世，又可以保身也，故有“利艰贞，利有攸往”之辞。六四当《大畜》之任，处《艮》之始，能止《乾》阳之初泄，故曰“童牛之牿”。六五处得尊位，制恶有道，柔能制刚，是以吉也，故曰“豮豕之牙”。上九所谓“刚上而尚贤”者也，居通显之地，体至公之道，舍己从人，以汲引从贤，此《大畜》之义，君子之道大行之时也，故曰“何天之衢，亨”。总之，初九居《乾》之始，其阳犹稚，故称曰“童牛”，戒其进也。九二以刚居柔，位刚势弱，故不能进也。九三纯秉《乾》德，《乾》为马，故称曰“良马”，又恐其径进也。君子之难进如此！",
            占:
            "【问战征】宜养精蓄锐，乘时而动，自然战无不克，攻无不利，定获大胜。\n" +
            "【问时运】目下心意纵奢，未可动也，必待二年后，运来福至，如骏马腾空，往无不利。\n" +
            "【问营商】暂宜株守，近则三月，远则三年，自得逐渐推广，日积月新，利源不竭，大有庆也。\n" +
            "【问家宅】宅居宜近山，或在岭上，或在谷中，必是素封之家。近来声名显达，家业日隆，大吉之兆。\n" +
            "【问功名】少年意气轩昂，未免稍有阻抑，至三十岁后，一举成名，云霄直上，为国为家，经纶焕著，诚大用之材也。\n" +
            "【问六甲】生男，且主贵。\n" +
            "【问讼事】始被屈抑，后得申理。\n" +
            "【问疾病】占得初爻至五爻，皆吉，上爻则恐寿源有阻。\n" +
            "【问婚姻】大吉。"
        },
        ye:[
            {
                原: "初九：有厉，利已。",
                象: ["有厉，利己，不犯灾也。"],
                析: "此爻体《乾》，刚健而在下，势将锐意干进，然初爻《乾》阳尚微，距五位主爻犹远，应在四爻。四爻属《艮》，《艮》止也，初爻欲进而四爻止之，是应爻不相援，而悉相敌也。初九能知危而止，故“不犯灾也”，谓之“有厉利己”。" ,
                占:
                "【问战征】宜守不宜攻，斯无害也，必待四爻援兵得力，方可大进获胜。\n" +
                "【问营商】目下资本犹浅，宜谨慎自守，免致灾害，后得帮手相助，自能获利。\n" +
                "【问家宅】是新造之宅，为前面山势压制，屋宅不能过高，然无咎也。\n" +
                "【问功名】才学虽高，而初次求名，不宜发泄太早，宜自抑止，所贵大器晚成也。\n" +
                "【问六甲】可占一索生男。\n" +
                "【问讼事】不宜健进，健进则有灾。\n" +
                "【问婚姻】初阳为四爻所畜，是夫将受制于妻也；在夫能顺从其畜，亦无灾也。\n" +
                "【问出门】现宜暂止，以待时运。\n" +
                "【问疾病】现虽有病，可保无虞。\n" +
                "【问失物】待后自可寻获。"
            },
            {
                原: "九二：舆说輹。",
                象: ["舆说輹，中无尤也。"],
                析: "“舆”者，车也，喻进行之义；“輹”者，车轴之缚也。天之转旋，有大车之象。“舆脱輹”者，谓车脱輹，不能驾乘，而废进行之用。此爻变则为《离》，有脱离之义，故曰“说輹”。《艮》以畜《乾》，将畜止下民之冒进，使之自止也。二与五相应，五处畜盛，未可犯也，知势之不可而不进，可谓知风识时者矣。《象传》曰“中无尤也”，谓其得中，无躁进之尤也。按初九曰“有厉”，其辞缓，九二曰“舆说輹”，其辞急。初与三应，初为《乾》之始，始阳尚柔，故辞缓；二与五应，五居尊位，势不可犯，故辞急。况五之畜二，非徒因其进而止之，殆将尚其贤而用之也。盖时有盛衰，势有强弱，有不可已者，学《易》者所宜深识焉。" ,
                占:
                "【问战征】若锐意径进，防有辙乱旗靡之祸，致一败而不可复收，惟以退为进，斯无尤矣。\n" +
                "【问营商】凡有货物，宜早脱售，虽无大利，亦无耗失。\n" +
                "【问家宅】必是破败旧家，惟其能退然自守，家业自有复兴之象，故无尤也。\n" +
                "【问功名】宜待时，毋躁进也。\n" +
                "【问婚姻】《小畜》三爻“舆说輹，夫妻反目”，是不吉也；此二爻得中，与五相应，五居尊位，必是贵婿，大吉。\n" +
                "【问疾病】定是腹疾，一时难愈，然无害也。\n" +
                "【问六甲】生男，防有足疾。\n" +
                "【问讼事】败而复和。"
            },
            {
                原: "九三：良马逐，利艰贞。日闲舆卫，利有攸往。",
                象: ["利有攸往，上合志也。"],
                析: "三辰在辰，上值轸，轸主车驾，故有“马”有“舆”，有“卫”。又三为《坎》中，《坎》为艰，故“利艰贞”。此爻内卦为《乾》，《乾》为马；“逐”，并进也。《乾》畜至三，其德已成，可以进矣，故其象为“良马逐”。“闲”，习也；“卫”，所以防不虞，《艮》在外为止，即卫之象。三之应在上，上处“天衢”之亨，途径大通，进行无阻，而犹必以艰贞自惕。如调马者，虽驰骋自得，犹必“曰闲舆卫”，乃可以“利有攸往”。《传》曰“上合志也”，此正畜极而通之时也。夫善骑者坠，善泳者溺，当此得意之日，故最宜戒慎，平常犹此，况《大畜》之时乎？“良马”以见锐进之义，“舆”以明徐行之象，逐马而继以舆卫，锐进徐行之两义，当参观而得之。" ,
                占:
                "【问战征】有马到功成之象，然必先临事而惧，斯无往不利也。\n" +
                "【问营商】三爻与应合志，是必卖买同心；曰“良马逐”，是必留适快捷；曰“利艰贞”，是虽遇险无虞也。大吉。\n" +
                "【问功名】有云霄得路之象。\n" +
                "【问家宅】必是勤俭起家，目下履当其位，家业日进，犹能安不忘危，故无往不利。\n" +
                "【问婚姻】三以上九为应，上九处畜之极，是全盛之象，占婚姻而得此爻，男女合志，大吉之兆。\n" +
                "【问疾病】宜谨慎调养，可保无虞。\n" +
                "【问六甲】生男。"
            },
            {
                原: "六四：童牛之牿，元吉。",
                象: ["六四元吉，有喜也。"],
                析: "六四爻辰在丑，丑为牛，四得《艮》气，《艮》为童，故曰“童牛”。以四畜初爻，动而体《离》，《离》为童牛，牛谓初九也。“牿”，《说文》云“牛马牢也”，引《书·费誓》，“今惟牿牛马”。《大畜》错卦萃，萃“用大牲吉”，童牛祭天之牛也。《礼记》：“郊特牲”，牛用犊贵诚也。《周礼》云“人祀五帝之牲，拴系于牢”，《郑注》“牢闲也”，必有闲防禽兽触啮。童牛系之于牢，备郊祀也。“童牛”谓初九，为之牿，四也。初阳最稚，始进而即闲之，如“童牛之牿”，牿之使不抵触，故吉而有喜也。夫天下之事，防未然者易为力，制己然者难为功，逆折其方长之奸，潜消其未萌之逆，则上不劳禁制，而化自行，下不伤刑诛，而奸自止。初阳尚微，刚暴之习未成，六四畜之，所以不劳力也。“元吉”者，柔以制刚，刚不敢犯，畜之盛也，喜莫大焉。" ,
                占:
                "【问战征】有强邻压制小国之象，幸四与上相应合志，得以保全。有喜。\n" +
                "【问营商】爻曰“童牛”，谓初阳也，意以贸易新出，时货为利。“牿”，谓牢也，意以畜积固藏为利，故曰“元吉”。\n" +
                "【问功名】六四辰在丑，上值斗，石氏曰“斗，将相爵禄之位”；又“丑，土也，其禽为牛”。孔子曰：“犁牛之子，骍且角，虽欲勿用，山川其舍诸。”盖童牛者，祭天之牛也，其必进用也明矣，故《传》曰吉而有喜也。\n" +
                "【问家宅】《乾》为门，《艮》为庭，为庐，为居，为舍，皆有家宅之象。“童牛”者，谓初九也，牿之者四也。初九者，阳之初也，必是初造之宅，为四所牿；必门前途径有阻，不能进行。然终必亨通，故曰“有喜”。\n" +
                "【问疾病】曰“童牛”者，意必老牛舐犊，灾在幼子。\n" +
                "【问六甲】生男。\n" +
                "【问婚嫁】四在丑，丑上值牵牛；四应初九，初九辰在子，上值女。曰童牛，必是少年结姻，大吉。\n" +
                "【问讼事】“童牛之牿”，《说文》云，“牿，牛马牢也”，恐有囚牢之灾。至上九曰天衢亨，当解脱而有喜也。"
            },
            {
                原: "六五：豮豕之牙，吉。",
                象: ["六五之吉，有庆也。"],
                析: "五为二之应，九二《坎》爻，辰在子，上值室。《广雅》云，“营室曰豕”；又《说文》，“亥为豕”；《分野》略云：“自危十六度，至奎四度，于辰在亥，为陬訾谓之豕韦。”戍亥，乾位也，则豕属《坎》，亦属《乾》。“豮”，《尔雅》释兽“豮，豕子，豮豕幺幼”；《郭注》“俗呼小豮猪，为豕子”。六五爻辞曰“豮豕”，盖指九二而言，九二《乾》阳尚稚，故曰“猪豕”，犹童牛之属初九也。“牙”，郑读为互，《广韵》互字下注云“俗作牙”，是昔人以牙为互，后人转而作牙，误也。《周礼》修闾氏掌比国中宿互柝者，注云，“互，谓行马所以障互禁止人也。”互亦通枑，《韵会》：“枑者交互其木，以为遮拦”，正合止畜之义，与初爻牿为牛马牢，其义相同，皆所以禁止其骤进也。五爻居尊位，为民士之所归向，下应九二，九二之士，能脱輹潜修，畜养其德，待时而动，斯喜在一人，庆在天下，是以吉而有庆也。" ,
                占:
                "【问战征】豕属《坎》，又属亥，是必在坎险湿泽之处，最宜畜意禁止，以防敌军豕突。能谋而后动，自然获吉。\n" +
                "【问营商】互，有互市之义，谓财物交互成市，正合近时通商之象。“豮豕”，谓小豕，譬如初次贸易，资本尚微，能受畜止，乃吉。\n" +
                "【问功名】此必年少求名，未免躁进，宜知自止，故曰“豮豕之牙，吉”也。\n" +
                "【问家宅】豕属亥，水也，前必有二水，交互而流，是以吉也。\n" +
                "【问疾病】六五辰在卯，东方为木，又豕属亥，亥为水，是必木旺水亏之症，宜自《节》止调养，方能有庆也。\n" +
                "【问六甲】生女。\n" +
                "【问婚嫁】六五爻辰在卯，为兔，五应二，九二爻辰在寅，为虎，寅卯相合。爻曰“豮豕”，豕属亥，亥与寅卯，木水相生，皆得制伏，大吉。"
            },
            {
                原: "上九：何天之衢，亨。",
                象: ["何天之衢，道大行也。"],
                析: "“衢”者，四通八达之道，“天之衢”者，犹曰天路也，谓旷达而无障蔽，以喻其通也。案：上九《艮》爻，位近丑，上值牛，《文献通考》，“牛七度，日月五星之中道，其北二星，主道路”，故曰“衢”。又乾为天，《艮》为路，故曰“天衢”。“何”作荷，“荷天之衢”，犹《诗》所云“荷天之休”、“荷天之宠”也。此卦四畜初，五畜二，上畜三，上为卦主，所谓“刚上而尚贤”者是也，故《象传》曰“道大行也”。盖《艮》之畜，非畜之使不行，正畜之以成其才，大其畜，即所以大其行也。畜极则通，通则为《泰》，此爻之所以变即为《泰》也。" ,
                占:
                "【问战征】上九爻辰在戌，上值奎、娄、胃，奎象白虎，主兵，娄星主兴兵聚众，胃星主征诛，皆军事也。爻曰“荷天之衢”，言旌旗载道，一战成功，故《象》曰“道大行也”。\n" +
                "【问营商】上应三；三曰“利艰贞”，知当时贸易尚多艰苦。至上为畜之极，畜极则通，故曰“荷天之衢，亨”，即三所云“利有攸往”者是也。《象》曰“道大行”，是必大获其利。\n" +
                "【问功名】爻曰“荷天之衢”，是即可谓青云得路之时也，大吉。\n" +
                "【问家宅】爻曰“荷天之衢”，衢大道也，知此宅必在大道之旁。“荷天”者，得天之佑也。“亨”，吉也，其宅必吉。\n" +
                "【问六甲】生男。\n" +
                "【问婚嫁】想是天作之合，吉。"
            },
        ]
    },
    {
        x:"100001",//颐
        e:{
            原: "颐：贞吉，观颐，自求口实。",
            象: ["山下有雷，颐。君子以慎言语，节饮食。"],
            彖: ["颐，贞吉，养正则吉也。观颐，观其所养也。自求口实，观其自养也。天地养万物，圣人养贤以及万民，颐之时大矣哉！"],
            析: "“颐”从臣，从页，臣为”颐”本字。页本首字，《说文》曰“头也”，从口，从一，一者，象舌，有养之义。卦体《艮》上《震》下，《艮》为山，《震》为雷，雷动也，山止也。卦以上下二阳象上下唇吻，内四阴象虚而求食。《颐》张而不合，有求食之状，故可以观《震》阳下动食象也。艮主止，止观象也。然《震》非自动也，系于艮以动，艮不上止，《震》虽欲动而不能，则其所以为《颐》之主，艮也。上下实而中虚，动而能止，曰《颐》，此卦之所以名《颐》也。\n" +
            "通观此卦，上卦三爻，皆所以养人，下卦三爻，皆所以自养。养之道，以养人为公，自养为私；自养之道，以养德为大，养体为小。故初、二、三皆养口体，私而小者也；四、五、上皆以养德而养人，公而大者也。无论为养人为自养，要皆以得正为吉，故《象》曰：“山下有雷，颐，君子以慎言语，节饮食”。谓《颐》之为用，吐露言语，咀嚼饮食，皆由颐而出，君子观《颐》之象，而知所直慎宜节也。初爻以阳处下，为动之始，是动而自求养也，舍“灵龟”而观“朵颐”，是以凶也。六二处下体之中，无应于上，返而养初，故曰“征凶”。六三虽应上爻，上九而拂颐养之节，自纳于上以馅媚者也，故至“十年”而犹“勿用”，复何利之有？六四身处上体，居得其位，应于初爻，以上养下，得养之宜，又能威严寡欲，所以得吉。六五以阴居阳，而比于上，行则失位，居则“贞吉”，故“不可涉大川”。上九以阳处上而履四阴，众阴皆由此得养，故曰“由颐”：然其所以得此养者，不知几历危厉而始得吉也，故曰“厉吉”；养至此，则无往不他故曰“利涉大川”而“有庆”也。盖《颐》之全卦，专言养生之道，其本在初。曰“龟”，曰“虎”，曰“颠”，示其用也；曰“拂”正其趋也；曰“由”竟其委也。圣人所以握造化之机，而尽性命之理者，于《颐》之一卦见之矣。",
            占:
            "【问战征】上止下动，防队下有妄动招乱者，或机密漏泄，或酗酒启衅，最宜谨慎。\n" +
            "【问功名】山下有雷，雷发声而山亦鸣，有声名腾达之象。\n" +
            "【问经商】《颐》象内动外止，主货物内地升动，外地低落之象；又恐贩货出外，一时不能销售。其货物大约不离食品。\n" +
            "【问家宅】《艮》山欲止，《震》雷欲动，山在上，雷在下，恐地盘震动，宜防火灾。\n" +
            "【问疾病】上止下动，山属土，雷属火，主上焦寒闭，下焦热泻之象，必待五爻，《象》曰“顺以从上”，庶上下通顺乃吉。一爻一日，必至五日可愈。\n" +
            "【问行人】内卦动而外卦止，必已动身，为外事阻止。上九日“利涉大川”，知必从水路而来。近则六七日可到，远则六七月方归。\n" +
            "【问六甲】生男。\n" +
            "【问失物】山下有雷，知其物为重物压止，一时不见，待后可得。\n" +
            "【问讼事】主为言语饮食细故启衅；下欲动而上止之，必有上官出而阻止，不终讼也。\n" +
            "【问婚姻】颐养也，妇主中馈，有养之义。外夫内妻，内动而外止，有妇从夫之象，吉。"
        },
        ye:[
            {
                原: "初九：舍尔灵龟，观我朵颐，凶。",
                象: ["观我朵颐，亦不足贵也。"],
                析: "凡爻辞尔与我对言，是《易》中比应，互为宾主之一例。此爻尔我云云，自应位之六四告初九之辞，“尔”指初九，“我”则六四自称也。龟为四灵之一，不饮不食，服气吐纳，渊默自养者也。《颐》初上两阳而包四阴，《离》象也，《离》为龟，故曰“灵龟”。初九一阳之始，胚胎万有，是即吾身之灵龟，不待养于外者也。舍“灵龟”而观“朵颐”，是捐其廉明之德，以行其贪窃之情，蠢兹众生，可悲可叹，故戒之曰“凶”。《象》曰“不足贵”者，谓养小失大，纵得所欲，亦不足贵也。" ,
                占:
                "【问战征】古者行军必先占卜以定吉凶，爻辞曰“舍尔灵龟，观我朵颐”，是不畏神明，而徒贪财物，故曰“凶”也。\n" +
                "【问营商】初爻为一阳之始，变而为《剥》，《剥》者解《剥》也，《象》曰“不利有攸往”，营商恐难获利。爻辞曰“尔”“我”者，主宾也；“朵颐”者，口之动而食物也。舍“灵龟”而观“朵颐”，有利亦恐为他人食没也，故凶。\n" +
                "【问功名】“灵龟”者内心也，“朵颐”者外貌也，舍内而求外，舍己而观人，徒慕虚声，必无实学，功名难成。\n" +
                "【问家宅】宅中六神不安，恐有外鬼作祟，动来求食，凶。\n" +
                "【问疾病】病由饮食不节所致，宜问神祈祷，可愈。\n" +
                "【问婚嫁】尔我者，男女两姓也，“舍尔”“观我”，显见两姓不谐，其故在争论礼物，必不成也，成亦必凶。\n" +
                "【问讼事】必由口舌启衅。曰“舍我”，曰“观尔”，是两造各执一见，一时不能就理。凶。"
            },
            {
                原: "六二：颠颐，拂经。于丘颐，征凶。",
                象: ["六二，征凶，行失类也。"],
                析: "二爻比初应五，阴柔不能自养，犹女不能自处，而必从男，阴不能独立，而必从阳也。“颠”倒也，“拂”违也，“经”义也，“丘”所履之常处也。夫颐养之道，以自上养下为常，今二爻虽与五为应，阴柔不能养五，反而求养于初爻，辞曰“颠颐，拂经”，是颠倒而违于常理也。以此求养，未见其福，以此而行，未见有与，故曰“颐，征凶”。《象》曰“行失类也”，《震》为行，阴阳各从其类，二爻不知养内卦之《乾》，反养外卦之《坤》，是为“失类”，故“征凶”也。" ,
                占:
                "【问战征】行军之要，首在纪律严明，步伐整齐。爻曰“颠颐，拂经”，是必背违纪律，步伐错乱也。凶莫大矣。\n" +
                "【问营商】二爻变《损》，《损》，耗损也，于商不利。爻辞曰“颠”，曰“拂”，是明言买卖出入不合常理也，故曰“征凶”。\n" +
                "【问功名】“颠颐，拂经”，是不循常道，侥幸求成，虽得终凶。\n" +
                "【问婚嫁】六二阴柔居下，不奉上而反养下，是谓颠倒拂乱，不得其正，妇道不可问矣。故《象》曰“行失类也”，凶可知矣。"
            },
            {
                原: "六三：拂颐，贞凶。十年勿用，无攸利。",
                象: ["十年勿用，道大悖也。"],
                析: "三爻居内卦之极，阴柔而不中正。《颐》三变而为《贲》，《吕氏春秋》；孔子卜得《贲》，曰不吉，以《贲》不得五色之正也。《颐》三比二应上，谄媚以奉上，是拂夫《颐》养之贞，故凶。上下互《坤》，《坤》为十年；故曰“十年”：《坤》又为用，以其拂贞，故曰“勿用”。三至六为《剥》，《剥》，《彖》曰“不利有攸往”，注谓当《剥》之时，强亢激拂，触忤陨身，是以“不利有攸往”。《颐》三拂贞，故直曰“无攸利”，是无所可往，无所得利也。《象传》曰“道大悻也”，极言于《颐》养之道，大相拂乱，故至“十年”而“勿用”，深责而弃绝之也。" ,
                占:
                "【问战征】师以贞为吉，拂贞则不吉。颐养也，养兵以备用，养拂其道，则兵不可用。《象》曰“道大悖也”，是犯上好乱，其败亡必矣，故凶。\n" +
                "【问营商】商业专在获利，曰“无攸利”，无论营业之大小，无论贩货之远近，皆无所得利也。极之“十年勿用”，是久久而不成事也，故凶。\n" +
                "【问功名】功名之道，要在出而用世，得以利济群民，是将以道养天下也。若拂夫《颐》之正，而极之“十年勿用”，则将终其身而不得见用也，故曰“无攸利”。\n" +
                "【问家宅】是宅必久无人居住矣，且恐有鬼祟出而求食，家宅不安，住之不利。\n" +
                "【问婚姻】主闺门不贞，其婚事亦必过十年可成。\n" +
                "【问六甲】生男。"
            },
            {
                原: "六四：颠颐，吉。虎视耽耽，其欲逐逐，无咎。",
                象: ["颠颐之吉，上施光也。"],
                析: "四爻柔正，与初九刚正相应，居得其位，以上养下，得《颐》之义，故曰“颠颐，吉”。四爻属上体，得《艮》气，《艮》为虎，耽耽下视之貌，是威而不猛之谓也。“逐逐”，《子夏传》作“攸攸”，苟作“悠悠”，刘表作“耽耽”，云“远也”。按《汉书·叙传》，“六四耽耽，其欲浟浟”，师古注，“浟浟，欲利之貌”。初取象于龟，龟者介虫之长；四取象于虎，虎者百兽之长，是两相应也。龟之德在灵，虎之威在视，初与四，取义各有所在。且《颐》卦旁通《大过》，“大过颠也”，故四称“颠”，二亦称“颠”。六二“颠颐凶”，六四则以“颠颐”得吉者何也？盖六二处下体而又养下，是以凶也；六四处上体，又应于初，阴而应阳，又能威严寡欲，所以吉也。《象》曰：“颠颐之吉，上施光也”，“上”谓上九。上得《乾》之一画，《乾》阳上烛，光明无所不照，四知养其乾元，则《乾》之光施于四，四即得之以为光，是以曰“上施光也。”" ,
                占:
                "【问战征】战士之勇者称虎臣，亦称虎贲，皆谓其有力也。然必须养其精锐而后用，非徒恃威猛而轻进也，故曰“颠颐，吉”。\n" +
                "【问营商】“颠”，恐一时物价有倒跌之象。“虎视耽耽，其欲逐逐”，譬言商人谋利之状，能视其贱价而置货，故吉而无咎。\n" +
                "【问功名】功名之兆，自古多取龙虎，是以吉也。“视耽耽”，“欲逐逐”，皆谋望腾达之意。\n" +
                "【问家宅】此宅必右山白虎居高，有怒目欲噬之形，幸四爻以阴居阴，位得其正，可无咎也。\n" +
                "【问六甲】生男。"
            },
            {
                原: "六五：拂经，居贞吉。不可涉大川。",
                象: ["居贞之吉，顺以从上也。"],
                析: "五爻以阳居阳，无应于下，而比于上，是为君者不能养人，反为人所养者也，即拂君道之常经，故曰“拂经”。《颐》卦六爻，惟初上属阳，阳宜行，阴宜居，且五体《艮》，《艮》为止，行则失类，故曰“居贞吉”。五又中虚象《坎》，《坎》为险，又为大川，“居贞”虽吉，而养道未成，不能以济险，故曰“不可涉大川”。按二曰“拂经”，三曰“拂颐”，拂，违也，二三以违拂颐养之道，故皆曰“凶”。五亦曰“拂经”，而独曰吉，何也？不知五爻之吉，不在“拂经”，而在“居贞”，故《象传》曰：“居贞之吉，顺以从上。”“上”谓上九，谓五近上，能以阴顺阳，故居贞得吉也。" ,
                占:
                "【问战征】行军之道，有经有权，谓能达权，似不必拘拘守经也，故“拂经”无咎。曰“居贞吉”，则宜固守，不宜进攻。“不可涉大川”，恐于川流之际有伏兵；舟揖前往，防有风波之厄，皆当谨慎。\n" +
                "【问营商】利于坐贾，不利行商，贩货出洋，更为可虑。\n" +
                "【问功名】出而应试，难望成名。\n" +
                "【问家宅】上体属《艮》，山居则吉，若在临江近水，其宅不利。\n" +
                "【问婚嫁】恐有不得媒聘之正者，若能从一而终，则亦吉也。\n" +
                "【问六甲】生男。\n" +
                "【问疾病】病在五爻，久则四五月，近则五六天，由于调养失宜。能安居静养则吉，若冒风雨，涉远路，恐难治也。"
            },
            {
                原: "上九：由颐，厉吉。利涉大川。",
                象: ["由颐，厉吉，大有庆也。"],
                析: "此卦初上两刚，合养四阴，初爻在下，《震》阳尚微，势力未充；上爻交上，艮阳已极，德足养人，卦中四阴，皆由上九而养，故曰“由颐”。上爻在卦为成卦之主，在爻为养人之主，其任甚重，且以阳刚之才，居危疑之地，苟其稍形骄惰，君疑众怨，是危殆之道也。故人臣当此，惟常怀危厉之念，斯可保其吉也。伊尹、周公忧勤惕厉，终得其吉，即此道也，故曰“厉吉”，以厉而得吉也。养至此，则乾元在我，川可涉，危可济，弱水不能陷，大海不能阻，夫亦安往而不可哉！故曰“利涉大川”。较六五之可“居贞”而“不可以涉大川”者，又有进矣，是足以当天下之大任，济天下之艰危，以成天下之治安者也，在此“由颐”之功耳。《象传》曰“由颐厉吉，大有庆也”，谓阳刚在上，能由养己以及养人，推而至于养天下，则无人而不被其养，即无人而不获其庆也，故《象》曰“大有庆也”。" ,
                占:
                "【问战征】谚云“养兵千日，用在一朝”，其得效力疆场者，皆由平日教养来也，故曰“由颐”。兵，危事也，不知几经危厉，乃得此克捷之功，故曰“厉吉”。“利涉大川”者，必其军士同心同德，斯得涉险，临危而不避，如周师之会孟津，诸葛之渡沪水是也。\n" +
                "【问营商】商业专在谋利，得利则足以养身养家。然商不能安居而得利也，必将涉历险途，或远贾重洋，方可获利，故曰“厉吉”。\n" +
                "【问功名】功名一道，由小而大，由卑而尊，然必忧勤惕厉，乃得功成名遂也。《象》曰“大有庆也”，是即所谓得之有喜也。\n" +
                "【问疾病】虽危得救，故曰“厉吉”。\n" +
                "【问六甲】生男，故《象》曰“大有庆也”。"
            },
        ]
    },
    {
        x:"011110",//大过
        e:{
            原: "大过：栋挠，利有攸往，亨。",
            象: ["泽灭木，大过。君子以独立不懼，遁世无闷。"],
            彖: ["大过，大者过也。栋挠，本末弱也。刚过而中，巽说行，利有攸往，乃亨。大过之时大矣哉！"],
            析: "《大过》自《颐》而来，《颐》上下二阳，中包四阴，《大过》反之，以二阴包四阳，四阳过盛，故曰《大过》。夫道中而已，阳欲其盛，不欲其过，太刚必折，太实必裂。今四阳中满，二阴屏居无位之地，阳虽盛而下无基，上无系，反借资于二阴；二阴微弱，不能为助，是失其中也，失中即为过。卦体上《兑》下《巽》，《兑》正秋也，秋金气，水之母也，故兑为泽；《巽》辰在巳，上值轸，轸主风，故巽为风，合之谓泽风《大过》。然《大过》异《小过》，何也？《小过》以《艮》遇《震》，止而动，其动未危，阴虽盛而下有基，止则吉也；《大过》以《巽》遇《兑》，入而悦，悦极不出，阳虽盛而下无根，入则颠也。《杂卦传》云“大过颠也”，《大过》一卦，不言颠，而《颐》卦言颠，以《颐》与《大过》，颠倒以相为用。《序卦》是以置诸上《易》之末，天地再交，以成《坎》《离》也。\n" +
            "通观此卦，阳刚太实，有不能运动之象，譬如人之肢体肥重，不能转运也。又四阳居中，二阴退而听命，下无根柢，生气已断，上无附属，枝叶既凋，故爻有“枯杨”之辞，曾不如《剥》《姤》之犹可来复。然《大过》自《颐》来，“颐，养也”，谓当养其二阴以相济也。《兑》泽在上，《巽》木在下，《象》曰“泽灭木”，泽本下而反上，木本上而反下，此《大过》之所以为颠，过越常分之大者也。君子法之，“独立不惧，遁世无闷”，是能以退藏者养其阳而防其过也，非君子则不能。《大过》六爻，二阴四阳，有阳爻而处阴位焉，有阴爻而处阳位焉，有阳爻而处阳焉，有阴爻而处阴焉，爻有不同，义亦各判。初爻以阳居阴，是过之尚微也，巽为茅，茅虽柔物，藉之亦足助刚，故“无咎”。二爻亦以阳居阴，是过而不过也。《巽》木为杨，泽灭之而枯，得阳九生气，枯而复稊，故亦“无咎”。三爻以阳居阳，是过而又过也；四刚在中，如屋之有栋，刚果自用，终致“栋挠”，故凶。四爻亦以阳居阴，是亦过而不过也。四与初应，得其所藉，三曰“挠”而四曰“隆”，故吉。五爻以阳居阳，是过而无复过也。“枯杨”之象，与二爻同，然阳至五而极，虽华已衰，故曰“何可久也”。六爻以阴居阴，四刚既倾，是过之终极也，“利有攸往”，正在此时。所谓“过涉”者，忠在救时，故“灭顶”虽凶，而“无咎”也。六爻以相对者言之，初与六对，《彖传》所云“本末弱”者，指初上也。一以藉茅而无咎，一以“过涉”而忘凶，皆足以救其过也。二与五对，“枯杨”之象，所取相同，“生稊”“生华”，久暂分也。三与四对，“栋”之为象，所取亦同，曰“桡”，曰“隆”，吉凶判也。总之，卦以阴阳相偶谓得中，偏则为过，四阳二阴，是《大过》也，故曰“大者过也”。君子于此，以“独立不懼，遁世无闷”处之，抱忧时嫉俗之念，具拨乱反正之才，利害不计，成败不言，上六之“过涉灭顶”者，必斯人也，复何咎矣！" ,
            占:
            "【问战征】“灭”，灭绝也，大欲灭国，小欲灭身，其象凶矣。行军占此，恐有暴水淹没之祸。\n" +
            "【问营商】《象》曰“泽灭木”，有低价忽而高涨之势。\n" +
            "【问功名】“独立不懼，遁世无闷”者，谓当退身隐处，未可求名也。\n" +
            "【问家宅】《兑》泽在上，《巽》木在下，其象反复，位置不正，防有灭凶之祸。\n" +
            "【问疾病】是肝火内郁之症，肾气冲上，医治非易。\n" +
            "【问婚嫁】“泽灭木”，恐配偶之间，有老幼不匀。\n" +
            "【问六甲】生女。\n" +
            "【问失物】必坠入水沟之处。"
        },
        ye:[
            {
                原: "初六：藉用白茅，无咎。",
                象: ["藉用白茅，柔在下也。"],
                析: "“藉”者，铺地也，“白茅”，取其洁也，古者祭祀，藉之灌酒，以降神也。茅白取《巽》象，《巽》在下卦，藉茅于下，所以承上之刚也。初爻阴柔居下，不犯刚而能承刚，当此《大过》之时，敬慎事上，不得谓过分也。故比之礼义之适中者，则有过于敬慎之失，比之傲慢侮人者，则其胜亦不啻霄壤；在高傲者固有咎，而卑下者必无咎焉。盖茅柔物也，藉之足以相助，未可以茅之微而忽之。《象》曰“柔在下也”，以爻言则初在下，以茅言则藉在下。初六居阴，阴为柔，茅质柔弱，故曰“柔在下也”。" ,
                占:
                "【问战征】当此初次出师，最忌刚暴过甚，宜宽柔待下。\n" +
                "【问营商】贩运之货，必是药品，或是茶叶木棉，其色必白，其质必柔，均可获利。\n" +
                "【问功名】拔茅连茹，是有连类同登之象。\n" +
                "【问家宅】其宅必近卑湿低下之处，屋外蔓草荒芜，建筑也。\n" +
                "【问疾病】病体柔弱，下焦有湿，须用温燥之药治之。\n" +
                "【问失物】于草地上觅之。\n" +
                "【问六甲】生女。"
            },
            {
                原: "九二：枯杨生稊，老夫得其女妻，无不利。",
                象: ["老夫女妻，过以相与也。"],
                析: "二爻以阳居阴，阴尽则死，阳来则生，物之常理。《巽》为木，克为泽，木之近水者为杨，泽而灭木，杨必枯矣，得九二阳气生助，故得枯而《复》生。“稊”，杨之秀也。按，二爻体《乾》，《乾》为老，为男，故曰“老夫”；下得《巽》在初，《巽》为处女，故曰“女妻”；二与初比而得初，故曰“老夫得其女妻”。夫夫妇配偶，以年之相若为正，老夫女妻，是亦颠也，然老少虽非正匹，而阴阳自得相济。“老夫”“女妻”，犹枯杨之生稊，终得妊育也，故曰“无不利”。《象》曰“过以相与也”，卦之义在刚过，夫而过老，妻而过少，故曰“过以相与”。《杂卦传》曰，“大过颠也”，斯之谓欤？" ,
                占:
                "【问战征】有转败为胜之象。\n" +
                "【问营商】《兑》为阴，亦为金，《巽》为风，亦为木，定为金木生意。“枯杨生稊”，于种植林木，或贩运树木，皆“无不利”。\n" +
                "【问功名】就爻象看来，必待晚年，方可成名。\n" +
                "【问家宅】此宅昔年定多不利，系阳宅居于阴地；近来得阳九发动，必有枯树开花，此其兆也。利。\n" +
                "【问婚姻】主有老鳏重娶，得以生育，大利。\n" +
                "【问疾病】虽危得安。\n" +
                "【问失物】必得。"
            },
            {
                原: "九三：栋桡，凶。",
                象: ["栋挠之凶，不可以有辅也。"],
                析: "就全卦言，四刚连亘在中，如屋有栋，上下两阴皆弱，故“挠”。就三爻言，九三互《乾》，辰在亥，上值危宿，按危三星，在虚东北，形如盖屋，有栋之象。三以刚居刚，过而又过，过刚必折，故“挠”。九三刚愎自用，视群策群力，皆莫己若，遂至孤立无助，愈高愈危，终致“栋挠”之凶。《象》曰“不可以有辅也”，言三予智自雄，不能与人共事，集思广益，故不可相辅有成也。亦三自取之耳。" ,
                占:
                "【问战征】“栋”者一屋之主，即一军之主帅也；“挠”者，摧折也，栋而挠，是主帅受伤之象。弊在主帅过于刚猛，不听人言所致，故凶。\n" +
                "【问营商】商业必须得人为辅，方能成事，若自运自刃，非特经营不大，且恐致意外耗失。“栋挠”云者，有人财两失之虑，故凶。\n" +
                "【问功名】能任大任者，称栋梁之材，云“挠”，则栋非其栋矣，虽成终败，凶。\n" +
                "【问家宅】此宅不吉，栋折榱崩，不可居也，凶。\n" +
                "【问婚嫁】九三以阳居阳，孤阳无助，婚姻不成，成亦不吉。\n" +
                "【问六甲】生男，恐不能养。"
            },
            {
                原: "九四：栋隆，吉。有它吝。",
                象: ["栋隆之吉；不桡乎下也。"],
                析: "九三曰“栋挠”，九四曰“栋隆”，其义相反，以九四在下卦之上，以阳居阴，亦过而不过也。下与初应，初爻虽弱，得其所藉，即可不挠。按九四辰在午，上值张，南宫候曰，“张为天府”，故有栋象。“隆”，《说文》曰，“丰大也”；《玉篇》曰，“中央高也”。栋以任重，故宜大栋在屋中，故宜高。高必以下为基，下有所藉，斯高而不危。三之所以挠者，下无藉也；四得其藉，故隆。凡事之得所凭藉，而大险可济，大功可成，上不辜君之托，下不负民之望，皆犹是也，其吉可知，故曰“栋隆，吉”。“有它，吝”者，言四若怀他志，厌初之本弱，而不屑用其藉，则三之挠，即为四之挠，必不免于吝矣。《象》曰“不桡乎下也”，谓栋既隆起，下必不挠也。" ,
                占:
                "【问战征】行军屯营，宜占高阜要地，下有所藉，斯营基巩固，可进可退，自不为敌所挠也，故吉。\n" +
                "【问营商】想必是材木生意，木料高大，足备巨室之用，若他项经营，恐未必隹。\n" +
                "【问功名】爻曰“栋隆”，必是大才，可当大任，斯足副“栋隆”之兆，其他小试，非其所长，有不屑为也。\n" +
                "【问家宅】此宅栋榱辉煌，门户宏阔，吉。\n" +
                "【问疾病】想是中胸有痞块高起，然无害。"
            },
            {
                原: "九五：枯杨生华，老妇得其士夫，无咎无誉。",
                象: ["枯杨生华，何可久也。老妇士夫，亦可丑也。"],
                析: "“枯杨”之解，见九二下。此爻与上六阴阳相比，得阴之助而生华，故曰“枯杨生华”。杨华无实，飘荡随尽，荣无几时也。九二以得初阴之助而“生稊”，九五下无有助，惟与上六相比，犹断根之杨，得雨露之润，虽一旦发华，不久凋落。“老妇”指上六，喻上六阴极而衰；“士夫”指九五，喻九五之无内助。“士”，未娶妻者之称，即谓少年。阴而居上，故呼“老妇”；阳而居下，故称“士夫”，是亦《大过》之义也。九五以刚在刚，三阳皆不为用，独与上六阴阳相比，故曰夫妇。从夫妇之序而论，当曰士夫得老妇，今曰老妇得士夫者，原其配偶之所起，志出老妇，老妇首倡而求士夫，丑体尤在老妇，亦以见圣人尽人情、考世故之妙也。《象传》曰“老夫士夫，亦可丑也”，丑者污辱之义，深恶之之辞也。" ,
                占:
                "【问战征】行军占此，必军中主将偏裨，位置颠倒，任用不当。一时虽获胜仗，未能持久。\n" +
                "【问营商】防经商者贪恋外遇，致播丑声。\n" +
                "【问家宅】防闺房不正，墙侧有茨。\n" +
                "【问功名】必主晚年获隽。\n" +
                "【问婚嫁】必年齿不齐，匹偶不正。\n" +
                "【问六甲】生女，不育。"
            },
            {
                原: "上六：过涉灭顶，凶，无咎。",
                象: ["过涉之凶，不可咎也。"],
                析: "“过涉灭顶”者，谓犯危险而涉河，不得达岸，水没其首也。互卦《乾》为首，爻例上为顶，上六《兑》爻，《兑》为水泽，位在酉，上值胃，附星积水，石氏云“积水星明，则大水出”，故有“过涉灭顶”之象。六爻以阴居阴，才力俱弱，但其志在救时，虽履患踏险，明知“过涉”之多凶，而忘身济国，有不遑反顾者，即使其功不成，其志深足尚焉，复有何咎？此所谓勇士不忘在沟壑，志士不忘丧其元，万世纲常，正赖此辈以存也。" ,
                占:
                "【问战征】恐有主将阵亡之惨。\n" +
                "【问功名】有头悬梁、锥刺之苦志，宜其声名远达，有志竟成。\n" +
                "【问营商】运货出洋，最宜谨慎。\n" +
                "【问疾病】恐水气上冲，头面浮肿，凶。\n" +
                "【问家宅】恐有大水泛涨，墙倾屋倒之患。\n" +
                "【问六甲】生女。"
            },
        ]
    },
    {
        x:"010010",//坎
        e:{
            原: "习坎：有孚，维心亨，行有尚。",
            象: ["水洊至，习坎，君子以常德行，习教事。"],
            彖: ["习坎，重险也。水流而不盈，行险而不失其信，维心亨，乃以刚中也。行有尚，往有功也。天险不可升也，地险山川丘陵也，王公设险以守其国，险之时用大矣哉！"],
            析: "《坎》从《大过》来。《序卦传》曰：“物不可以终过，故受之以《坎》。”《坎》字从土，从欠，欠，不足也，以不足备其《大过》，故继之以《坎》。卦体一奇二偶，二偶《坤》地，一奇《乾》天，《乾》天藏于《坤》地之中，元气充溢，化湿而生水，是谓“天一生水”，此《坎》之所以为水也。\n" +
            "通观此卦，是进固险，退亦险，是谓重险，困上加困之象也。《彖》说君子之难，爻说小人之难，以示出《坎》之道者也。夫处险而动心忍性者，君子之《坎》也；值险而坠节陨身者，小人之《坎》也。人生值世，莫不有坎，而所以防险者，要自有道也。故《彖》辞首勉之曰“习”，继惕之曰“孚”，而终美之曰“亨”。盖渭水之为物，流而顺行，则无涨溢之患，塞而滞，则必溢，故行险者谨慎恐惧，不失其信，可终得其成功也。察六爻之情，同处困难，各有吉凶。初六为履险之始，习而未精，遂陷深坑，外无应援，不克自济，是以凶也。九二刚中，求而有得，则险而不险，险在其中，即亨在其中也，是以日“未出中也”。六三两《坎》相接，入险既深，阴柔不正，未能出险，是以“终无功”也。六四虽抱忠贞之心，而局量狭隘，自乏救险之才，唯祈鬼神，从九五之阳，而得出险者也，是以曰“刚柔际也”。九五阳刚中正，高居尊位，为《坎》体之主，《象传》所谓“水流而不盈”者，惟五当之。水德在平，平则险不为险，是以曰“无咎”也。上六居《坎》之极，《坎》为狱，此为陷险而入于狱也。初之失道，尚可宥焉，终之失道，不可宥也。惩以“三岁”，期其悔复，是以三岁凶也。盖人之涉世，如水流坎，无时无险厄，无地无缺陷，庸人处之，遂步成荆棘，君子履之，畏途亦康衢。何者？君子习惯，庸人生疏，此《坎》之所以贵习也。" ,
            占:
            "【问战征】有敌兵频番侵袭之势，宜时刻防备。\n" +
            "【问功名】有逐步升腾之象。\n" +
            "【问营商】财如流水，源源而来，可久可大，商运亨通。\n" +
            "【问家宅】此宅外北首，必有坑陷，泉流不息。《坎》辰在子，上值虚危，危主盖屋，恐邻居有营造之象。\n" +
            "【问疾病】防是水泻之症，历久未愈，宜祷，取“樽酒簋贰”之义。\n" +
            "【问婚嫁】必是亲上加亲，有重复联亲之象。\n" +
            "【问六甲】生男。"
        },
        ye:[
            {
                原: "初六：习坎，入于坎窞，凶。",
                象: ["习坎入坎，失道凶也。"],
                析: "“习”者，重复惯习之义；“窞”者，《坎》中小穴也。初爻为卦之始，即为《坎》之始也。《列子》曰，“人有滨河而居者，习于水，勇于泅”，所谓善泅者不溺也。初爻习而未善，是以不能出《坎》，而反入于窞。窞为小《坎》，小《坎》则陷愈深，而出愈难，故凶。《象》曰“习坎入坎”，谓习坎者本欲出《坎》，习坎而入坎，非习坎误之，在习坎之失道者误之耳，故曰“失道凶也”。" ,
                占:
                "【问战征】有设计埋伏，因之反坠敌计，凶道也。\n" +
                "【问功名】有侥幸求名，反致遭辱，是无益而有损也。\n" +
                "【问营商】因贩货失利，转运他处，货到，市面更小，不能脱售。\n" +
                "【问疾病】求医疗疾，医失其道，其病益危。\n" +
                "【问婚姻】恐堕骗局，必非明媒正娶也。\n" +
                "【问六甲】防生产有难。"
            },
            {
                原: "九二：坎有险，求小得。",
                象: ["求小得，未出中也。"],
                析: "上《坎》为穴，下《坎》为险，“有险”者，谓前后左右皆险地也。此爻以一阳陷二阴之中，又无应援，固不能遽出坎险，惟其有刚中之德，忍耐困守，纵不及五之不盈而平，可以免咎，而求之不已，亦不至毫无一得，故曰“求小得”，盖虽小亦得也。《象》曰“未出中也”，可知亨在中矣。" ,
                占:
                "【问战征】可暗通隧道，以袭敌营，虽未大捷，必有小胜。\n" +
                "【问营商】小利可谋。\n" +
                "【问功名】小试必利。\n" +
                "【问家宅】宅外恐有河岸崩颓，宜加修治。\n" +
                "【问疾病】必是疮疡等症，延医治之，当得小效，难期全愈。\n" +
                "【问六甲】得男。"
            },
            {
                原: "六三：来之坎坎，险且枕，入于坎窞，勿用。",
                象: ["来之坎坎，终无功也。"],
                析: "此爻以阴居阳，不中不正，才弱而志强，在二《坎》之间，而一无应援，欲越险而前行，有上卦之《坎》阻止，欲避险而他往，有下卦之《坎》横来，是本位既不得安居，而前后左右，进退动止，亦复无地非《坎》，故曰“来之坎坎”。“枕”，止也，安也，谓既履其险，且为休止而暂息焉，虽一时未能出险，亦不至入而益深。若勿用安息，而强力争，必致入于《坎》窞，而不可救矣。“窞”，《说文》曰，“坎中更有坎也”；虞曰，“坎中小穴”。初三两爻皆阴，空穴，故皆称窞。《象》曰“终无功也”，谓自来豪杰，皆自困苦中磨砺而成，坎险足以厄人，坎险实足以成人，若遇险而徒晏息偷安，是失险之时用矣，故曰“终无功也”。又按“险且枕”，费易古文作“检且沉”，检，检押，谓筑堤防水，为之检押；沉，川祭名。《礼记》曰：“祭川沉，凡沉辜，谓碟牲以祭川也。”夫治水者，惟在顺其性以导之，若但用检押，则水势雍而愈猛，决堤崩岸，所伤益多，虽沉牲以祭，究何济乎？故爻戒以“勿用”，《传》释以“无功”。此又一说也，似较训枕谓安谓止者，其义尤精。" ,
                占:
                "【问战征】象为营垒四面，皆临坎险，进退两难，宜枕戈暂息，以待应援。\n" +
                "【问营商】观爻象为海运生意；舟行且阻，宜入奥暂守。\n" +
                "【问功名】观象，是值万般困厄，为饿肌劳肤之时也，目下无功，晚成可望。\n" +
                "【问家宅】此宅水法错乱，杀气多凶，屋北有一《坎》窞，急宜填满。\n" +
                "【问婚嫁】《坎》为男，是为男家求婚也，爻曰“勿用”，必不成也。\n" +
                "【问六甲】生男。"
            },
            {
                原: "六四：樽酒簋贰，用缶，纳约自牖，终无咎。",
                象: ["樽酒簋贰，刚柔际也。"],
                析: "“樽”，酒尊也；“簋”，黍稷器也，“贰”，副也。礼有副尊，按《周礼》大祭三二，中祭再二，小祭一二，谓就三酒之尊而益之也。缶，即谓之盎，瓦器也。又六四辰在丑，上值斗，可以斟之，象尊，上又有建星，形如簋，建星上有弁星，形如簋，故六四皆取其象。“约”俭也；“贰”，以致其礼之隆，缶，以昭其用之俭。“牖”，室中通明之处，《坎》为纳，故曰纳。《诗·采苹》“于以奠之，宗室牖下”，“纳约自牖”，义取此耳。六四以阴处阴，本易有咎，乃四爻能以“樽酒簋贰”，约而自牖纳之，可以馐王公，可以享宗庙，故终得“无咎”。《象》曰“刚柔际也”，谓上下两卦二刚曰柔之际，两《坎》相重，樽簋之贰，以象其重也。谓处刚柔相交，能以樽簋自牖纳之，亦足昭其诚也，故曰“无咎”。" ,
                占:
                "【问战征】行军以粮饷为重，所谓足兵，首在足食。“纳约自牖”云者，牖非纳食之地，犹言潜地运饷，以防敌兵劫夺也。\n" +
                "【问营商】《坎》为酒，想是造酒之业。\n" +
                "【问功名】想是春风得意，燕乐嘉宾，可喜可贺。\n" +
                "【问疾病】宜祷。\n" +
                "【问婚姻】吉。"
            },
            {
                原: "九五：坎不盈，祗既平，无咎。",
                象: ["坎不盈，中未大也。"],
                析: "九五以阳居阳，位得中正，为《坎》之主，《彖传》所谓“水流而不盈”，惟五足以当之。水之德在平，平则险不为险也。“祗既平”者，谓适得其平。《坎》穴也，穴中之水，不盈则平，盈则泛滥横流，便有冲决之患。凡天下之事，多以盈满招灾，水亦如是，惟其不盈而平，是以“无咎”。《象》曰“中未大也”，大犹满也，惟其《坎》流不大，斯得平稳无险，否则大水为灾，水亦何取夫大裁！故曰“中未大也”。坎险危地，本非美也，五之“不盈”，虽为善处险者，亦但云“无咎”而已，未足称吉也。" ,
                占:
                "【问战征】为将之道，最忌恃功而骄，以致众心不平，取败之道也，虽孙吴复起，不能为功。\n" +
                "【问营商】不贪一时意外之利，必酌量物价之平，以计久远，是善贾者也。\n" +
                "【问功名】名位不大。\n" +
                "【问时运】谦受益，满招损，终身诵之可也。\n" +
                "【问家宅】宅外有小地，水流清浅，又有一平坡，风景颇好，无咎。\n" +
                "【问婚姻】两姓门户相当，吉。"
            },
            {
                原: "上六：系用徽纆，寘于丛棘，三岁不得，凶。",
                象: ["上六失道，凶三岁也。"],
                析: "上爻以阴居阴，当坎险之终，而不知悔悟也。初之失道，犹得曰未经，上之失道，狎之以为常矣，不可以理喻，惟有以法绳之。《坎》为罪，为狱，为丛棘。“徽纆”。绳索也，“丛棘”，狱墙也，系之以徽纆，置之于丛棘，所以治其罪而使之悔也。《坎》为三岁，故禁锢三年，律所谓“上罪三年而舍”也。三年而悔过迁善，斯得反其正矣；三年而不改，是将终身失道矣，故《象》曰“失道凶也”。圣人之惩恶也，始则严以绳之，终必宽以宥之，治至久而不俊，亦未以之何也，已矣。此可知圣人未尝轻弃人也。" ,
                占:
                "【问战征】有劳师远征，久役不归之虑。\n" +
                "【问营商】想是采办蚕丝生意，三年之后，方可获利。\n" +
                "【问功名】恐有意外之灾，不特功名不就，防有牢狱之罪，凶。\n" +
                "【问婚姻】红丝系足，婚姻有前定也，但良缘未到，须待三年后可就。\n" +
                "【问六甲】得子，须迟。\n" +
                "【问家宅】此宅不知缘何荒废，墙围遍生藤蔓，宜加修葺。前住者不利，后住者吉。"
            },
        ]
    },
    {
        x:"101101",//离
        e:{
            原: "离：利贞，亨。畜牝牛吉。",
            象: ["明两作，离。大人以继明照乎四方。"],
            彖: ["离，丽也。日月丽乎天，百谷草木丽乎土，重明以丽乎正，乃化成天下。柔丽乎中正，故亨，是以畜牝牛吉也。"],
            析: "《离》卦二阴四阳，上下一体，《离》者，偶象也。奇实阴中，积而成《坎》；偶分阳中，两而为《离》。水资始，火资生，水化气，火化形，故“地二生火”。火者，其象为偶；奇《离》成偶，偶两成《离》，是故善《离》莫如火。火一星也，《离》为万炬，遇物而皆焚；人一心也，《离》为万应，触处而皆通。惟火中虚，虚则能离也。\n" +
            "通观此卦，《离》得《坤》二，《坎》得《乾》二，天地之用，莫要于水火。文王《序卦》始《乾》《坤》，中《坎》《离》，以二卦为天地之中气，上承乾《坤》，下启《咸》《恒》者也。盖以《坎》之中实为诚，以《离》之中虚为明，诚明者，《易》理之妙用，圣人之心学也。明之本在身，其用在国家。" ,
            占:
            "【问战征】克敌者宜用火攻，防敌者亦宜备火攻，“两作”者，恐前后一时俱焚。\n" +
            "【问营商】想营业定是近火，或运办硫黄，或创设电火，或制造火柴等业，皆利。\n" +
            "【问功名】《离》为目，可有榜眼之兆。\n" +
            "【问家宅】此屋必系新造，前后开通，窗户生明，屋外四围空阔，是巨室贵人之宅也，吉。\n" +
            "【问婚姻】此非原配，必是继妻；夫家定属贵室，非寻常百姓之偶也。\n" +
            "【问六甲】生女。\n" +
            "【问疾病】热势甚重，恐一两日内即防神魂离散。"
        },
        ye:[
            {
                原: "初九：履错然，敬之，无咎。",
                象: ["履错之敬，以辟咎也。"],
                析: "初爻为内卦之始，如日之始出，黎明乍起，为作事谋始之时也。“履”，践履也，“错然”者，谓应酬交错也。当至纷至叠来，而不以敬将之，必致动辄得咎矣。《履》卦曰“履虎尾”，履而知惧，故曰“吉”；此卦曰“履错然”，履而能敬，故“无咎”，其履同也。夫祸福每兆于几微，始而能谨，斯终必无祸，所谓君子敬而无失，得者得此旨也。《象》曰“履错之敬，以避咎也”，夫人以身接物，不必居功，最宜避咎，避之之道，惟在居敬而已矣。" ,
                占:
                "【问战征】初爻为始，是三军始行，旗辙交错之时也。“敬”者，即所谓临事而惧之意。战，危事也，慎重持之，或可免咎也。或曰邪行谓错，宜从横路进兵。\n" +
                "【问商业】必是新立之业。初九爻辰在子，北方属水，卦位居南属火，想是南北生意。一时难许大利，要可无咎。\n" +
                "【问功名】《诗》云“他山之石，可以攻玉”，盖言得助而成也。\n" +
                "【问家宅】《履》卦云，“履道坦坦，幽人贞吉”，是宅必在大道之旁。吉。\n" +
                "【问六甲】生女。"
            },
            {
                原: "六二：黄离，元吉。",
                象: ["黄离，元吉，得中道也。"],
                析: "二爻以阴居阴，为《坤》二成卦之主，位处中正，《彖传》所谓“柔丽于中正”者，即指二爻也。《离》为黄，故曰“黄离”，黄者中色，《离》者文明，居中而处文明，是以“元吉”也。《象》曰“得中道也”，《离》卦六爻，惟二爻以一柔居二刚之中，中而且正，《象》曰“得中”，不言正而正在是焉。" ,
                占:
                "【问战征】《离》二变《大有》，《大有》，《象传》曰“大车以载，积中不败也”。“大车”，谓兵车；黄，中之色也；“积中”者，谓中营军粮充实；“不败”者，谓兵士勇健，得以获胜也。故吉。\n" +
                "【问营商】《离》属南方之卦，经营利在南方；黄为土，土生木，又利在土木。\n" +
                "【问功名】《离》位在午，上值文昌，有文明之象，功名必显。\n" +
                "【问家宅】《离》为火，土色黄，火之子，喻言其家得有令子，能振起家声。吉。\n" +
                "【问婚姻】二爻以阴居阴，位得中正，主夫妇顺从，佳偶也。吉。\n" +
                "【问疾病】必是内火郁结中焦之症，宜凉解之。无咎。\n" +
                "【问六甲】生女。"
            },
            {
                原: "九三：日昃之离，不鼓缶而歌，则大耋之嗟，凶。",
                象: ["日昃之离，何可久也！"],
                析: "九三以阳处阳，是由明入晦之象，故曰“日昃”，昃者，日之将倾也。“缶”，即盎，大腹而敛口，《离》卦上下奇而中偶，形似缶，故象取缶。《坎》曰“用缶”，《坎》中实，则用以盛酒；《离》中虚，则鼓以节乐。“不鼓缶而歌”，必歌无节也。《离》互《兑》，《兑》属正西，日出东入西，日薄西山，谓衰年暮景，故象取“大耋”。八十曰耋，三爻居二卦之中，犹年在半百，未可云大耋也。“嗟”，悲叹声，谓未老而叹其老也。其歌也，乐失其节，其嗟也，哀失其常，哀乐无时，致神魂颠倒，寿命不永矣，是以凶也。《象传》曰“何可久也”，谓若此之人，忽歌忽嗟，乃天夺其魄也，安能久乎？" ,
                占:
                "【问战征】“日昃”，日将夕也。军中长歌浩叹，皆失纪律，不吉之兆，尤防敌兵夜袭。\n" +
                "【问营商】《周礼》地官司市，“大市日昃而市”，谓大市交易繁多，至日昃始集市。爻曰“日昃之离”，是日昃后而散也。市区扰杂，或歌或嗟，哀乐无度，必伤正业，宜戒。\n" +
                "【问功名】恐老大无成，徒自悲耳。\n" +
                "【问婚姻】鼓缶而歌，难望偕老，凶。\n" +
                "【问六甲】生女，难育。"
            },
            {
                原: "九四：突如其来如，焚如，死如，弃如。",
                象: ["突如其来如，无所容也。"],
                析: "“突如其来如”者，谓刚暴之祸，不可测度；“焚如”者，谓如烈火之焚物；“死如，弃如”者，谓其身灭亡，其名亦遂废弃。四爻处上下卦之间，下卦之火将熄，上卦之火又炽，火炎于上，其势尤烈。“突”，杨子《方言》，“江湘人谓卒相见曰突”，“突如其来”，是骤来而不及防也。“焚如”，烧其庐；“死如”，毁其身；“弃如”，举之而委诸沟壑也。“焚如”，《离》火本象；四动体《艮》，《艮》为鬼冥门，故曰“死如”；又互《兑》，《兑》刑人，刑人于市，与个弃之，故曰“弃如”。焚而死，死而弃，其势相连，其祸甚凶，以九四在三火相传之际，是以凶焰如此。《象传》曰“无所容也”，谓火焰逼近，无可容身也。四与初应，初之火其咎可避，四之火猛，屋毁人亡，无地可容矣。或曰突谓灶突，《汉书》所云“其灶直突”之突。“突如其来”者，所谓祭神如神在，恍惚而见其来也。“焚如，弃如”者，谓灶神察其为恶，而降兹凶也。此又一说也。" ,
                占:
                "【问战征】有营垒被焚，枪炮暴烈之祸，来势汹涌，紧官慎防。\n" +
                "【问营商】有人财两亡之祸，宜藏身退避，或可免也。\n" +
                "【问功名】有唾手可得之势，但位名愈重，得祸尤烈，不如隐退。\n" +
                "【问家宅】旧说以“突”为不孝子，此家必生逆子。“焚”、“死”、“弃”，皆言逆子之罪也。\n" +
                "【问婚姻】四动体《艮》，《艮》为鬼冥门，又《离》互《兑》，《兑》为刑人，此婚大不吉利。\n" +
                "【问六甲】生女，必不育。"
            },
            {
                原: "六五：出涕沱若，戚嗟若，吉。",
                象: ["六五之吉，离王公也。"],
                析: "六五为外卦之主，得中居尊，与二相应，《象传》所谓大人继明久照，即指五爻也。《离》为目，自目出者曰涕，故曰“出涕沱若”。又《离》互《兑》为口，嗟是口之喑声，故曰“戚嗟若”。所谓“若”者，是未当“出涕”而有若“出涕”，未当“戚嗟”而有若“戚嗟”，盖形容忧伤之情状也。九三乐尽悲来，“大耋之嗟”，则为凶兆。九五忧盛虑危，所谓“先天下之忧而忧，后天下之乐而乐”，故吉。《象传》曰“《离》五公也”，九五为王公之位，故云。" ,
                占:
                "【问战征】据爻辞“沱若”“嗟若”，有临事而惧之意。战危事也，能惧则能谋，能谋则可以制胜矣，故吉。\n" +
                "【问营商】此经营必是王家商务公业，非下民私计也。故曰“离王公也”。其业亦必由辛苦艰难而成。\n" +
                "【问功名】位至宰辅，极贵极显，然一身忧劳倍甚，如武侯之鞠躬尽瘁，乃吉。\n" +
                "【问婚姻】此姻事极贵，然有先号咷而后笑之象。\n" +
                "【问六甲】生女，防难产，终吉。"
            },
            {
                原: "上九：王用出征，有嘉折首，获匪其丑，无咎。",
                象: ["王用出征，以正邦也。"],
                析: "“王”者指六五，“用者”，指上九也。《离》为兵戈，故用以“出征”。“首”者首恶，“丑”者类也。“嘉”者，赏其功也；所嘉者，在折其魁首，而不及丑类，《书》所谓“歼厥渠魁，胁从罔治”者是也。九三居下卦之上，与上为敌，不顺王化，残害民生，上九于是奉命出师，以除天下之害，获其首恶，诛而戮之，其余党类，皆从赦免。此诚吊民伐罪，王者之师，复何咎焉！《象传》曰：“以正邦也”，谓如汤之征葛伯，文王之伐昆夷，惟在戡乱以安邦，夫岂好为穷兵哉！" ,
                占:
                "【问战征】观爻辞已明示矣。王者之师，不妄杀人，斯道得焉矣。\n" +
                "【问营商】贩售货物，宜选取上等佳品，不取低劣，乃可获利。\n" +
                "【问功名】必膺首选，吉。\n" +
                "【问疾病】“折”，夭折也，不利。\n" +
                "【问六甲】生女。"
            },
        ]
    },
    {
        x:"001110",//咸
        e:{
            原: "咸：亨，利贞，取女吉。",
            象: ["山上有泽，咸，君子以虚受人。"],
            彖: ["咸，感也。柔上而刚下，二气感应以相与。止而说，男下女，是以亨，利贞，取女吉也。天地感而万物化生，圣人感人心，而天下和平，观其所感，而天地万物之情可见矣。"],
            析: "《上经》首《乾》《坤》，以天地为万化之原也；《下经》首《咸》《恒》，以夫妇为五伦之始也。天地不分不成两仪，男女不合不成生育，故《乾》《坤》以二老对，而《咸》则以二少交。《咸》之体，亦自《乾》《坤》来，《乾》三索于《坤》得《艮》，《艮》为少男；《坤》三索于《乾》得《兑》，《兑》为少女。男女相感，自其性情，而二少相合，男下于女，尤感之正也。有心为感，无心为《咸》，《咸》皆也。卦体以“山泽通气”，六爻皆应，《咸》和通畅，物我偕臧，此卦之所以名《咸》也。\n" +
            "通观全卦，有心为感，无心为《咸》。《咸》，皆也，为卦六爻皆应，咸和通达，物我皆臧，自然而然，元气浑合，此《兑》悦《艮》止卦之所以名《咸》也。《咸》主乎感，感则必动，而六爻则以静为吉，以动为凶。初爻居卦之下，曰“咸其拇”，拇者，拇足大指也，其感尚浅，其动亦微，故不系吉凶也。二曰“咸其腓”，腓为足肚，则进于拇矣。腓本不动，足动而腓随之，是动虽凶，而腓尚居于吉也。三曰“咸其股”，股处下体之上，三之象也，较拇与腓而尤进矣，志在随人”，所执亦贱，故曰“往吝”。四居三阳之中，为心之位也。凡有感触，皆从心发，得贞则吉，否则凶也。五为卦主，居《兑》之中，脢在心上，为背脊肉，是不动之处，感而不感，动而无动，故曰“无悔”。上六处全卦之上，“辅颊舌”在一身之上，其象取此，有感于心，发而为言，是口说也；然不能至诚相格，而徒以美言取悦，《咸》道薄矣。是以六爻之中，所感各有浅深，而悔吝吉凶，亦各随其象而著。惟君子能“以虚受人”，虚则心公，公则入而无拒，感而即通，其所翕受者宏矣。翕受之道，取诸《兑》，专直之义，取诸《艮》。健而能止，顺而能悦，悦以感阴，止以应阳，天地无心而成化，圣人无为而成功，如斯而已矣。" ,
            占:
            "【问战征】军队前进，防有坑陷，山谷间防有埋伏，固守城池，防敌兵潜通地道，皆当谨慎。\n" +
            "【问营商】山泽为生财之地，即财源也。“以虚受人”，是以购入物产，贩运转售，必大获利。\n" +
            "【问功名】“山上”者高附之象，“山上有泽”，泽者，积水低洼之处。有居高思危之意，惟宜虚己待人，功名可长保也。\n" +
            "【问家宅】是宅必傍山临水，知其所止，吉。\n" +
            "【问疾病】是虚弱之症，宜服滋补之剂。\n" +
            "【问婚姻】卦为山泽通气，主两姓和好，大吉。\n" +
            "【问讼事】两造必是少年意气相争，讼宜和解而止为善。\n" +
            "【问六甲】生男。\n" +
            "【问失物】必坠入空洞有水之处，不能复得。"
        },
        ye:[
            {
                原: "初六：咸其拇。",
                象: ["咸其拇，志在外也。"],
                析: "“拇”者足之大指，初居爻首，为感之始，其感尚微，譬如足之有指，指即小动，未常移步，以喻人心初感而未动，始有其志而已。《象》曰“志在外也”，外谓九四，以初与四相应，故曰“在外”。志者心之所之也，谓第有其志，未尝躁动，是以不言吉凶。" ,
                占:
                "【问战征】是兵刃初交之会，应在第四日，可以得胜。\n" +
                "【问营商】必是初次贸易，货物已办，尚未发行也。\n" +
                "【问功名】必能一举成名，有捷足先登之兆。\n" +
                "【问家宅】有迁居外地之意。\n" +
                "【问疾病】是足指初起一毒，宜外用敷药调治。\n" +
                "【问婚姻】初六应在九四，以《艮》男求婚于《兑》女也，为结缡之吉。\n" +
                "【问六甲】生男，是初胎也。"
            },
            {
                原: "六二：咸其腓凶，居吉。",
                象: ["虽凶居吉，顺不害也。"],
                析: "“腓”为胫，或曰足肚，是无骨之处，盖在拇之上股之下也。腓不能自动，随足而动，足动而凶，则腓亦失其吉矣。然动则为凶，而静居则吉，故《象传》曰；“虽凶居吉，顺不害也。”六二以阴居阴，其性本静，能顺其性而不动，自可免害而获吉也。" ,
                占:
                "【问战征】宜固守不动，斯可免害。\n" +
                "【问营商】不利行商，利坐贾。\n" +
                "【问功名】只可依人成事，未能远到。\n" +
                "【问疾病】按腓病也，必是四肢痿痹之症，只可坐卧，不能步行也。\n" +
                "【问婚姻】婚事既成，恐有变动，能以顺自守，虽凶终吉。\n" +
                "【问六甲】生男。"
            },
            {
                原: "九三：咸其股，执其随，往吝。",
                象: ["咸其股，亦不处也。志在随人，所执下也。"],
                析: "此爻居下体之上，上体之下，为股之象，股者随上下而动，不能自主者也。九三以阳居阳，与上六之阴相应，舍上六而比初二，以为动止，率此以往，其吝可知。三为《艮》卦之主，《艮》为股，故曰“股”，《艮》又为执，故曰“执”。《艮》本止也，三以感而思动，又牵率初二，使之皆动，故曰“执其随”。《象传》曰“亦不处也”，“亦”者，谓率拇腓而俱动也。“志在随人，所执下也”，“随人”者，谓随上也；“执下”者，谓执初与二也。" ,
                占:
                "【问战征】宜退守，不宜往攻。\n" +
                "【问营商】凡商业合出资本，谓之股分，必举一人以主其业，乃主业者，不能自主，而徒随人以为上下，其业必难获利。\n" +
                "【问功名】随声附名，其品下矣，必难制胜。\n" +
                "【问家宅】宅近《艮》山，本可安处，占者不愿处此，殆欲随人他迁也，恐所往吝矣。\n" +
                "【问婚姻】咎在过听执柯者之言，恐所适非偶。\n" +
                "【问六甲】生男。"
            },
            {
                原: "九四：贞吉，悔亡。憧憧往来，朋从尔思。",
                象: ["贞吉，悔亡，未感害也。憧憧往来，未光大也。"],
                析: "四当三阳之中，居心之位，《咸》之主也。初之拇，二之腓，三之股，五六之脢舌辅颊，皆从心而发，故心不言感，以万感皆由心而生也。夫心之本体，本灵明不昧，寂然不动，自有所感而心动焉。动则有悔，欲其亡悔，惟贞而已；贞者正也，正则吉而悔亡。然人心不能无感，而感亦不能皆正，不正则心受其害，而悔随感生，何以得吉？“憧憧”者急遽之状，“往来”者忙促之形，“憧憧往来”，甚言纷至叠来，私意错乱，害累丛生。下之拇、腓、股，上之脢、舌、辅，亦皆纷纷而动，但见其“朋从”耳，则此心岂复有一息之泰定哉！《象传》曰“贞吉悔亡，未感害也”，谓贞则其心无私，未感之先，心本洞然，故曰“未感害也”。“憧憧往来，未光大也”，谓物感迭来，不能无思无欲，故曰“未光大也”。" ,
                占:
                "【问战征】军中全以主帅为心，当万军纷集，以一帅镇定之，斯令行禁止，寂然不动，否则扰乱错杂，灾害生焉。\n" +
                "【问营商】商务虽在谋利，亦以得贞为吉，若见利忘义，则群焉争夺，不夺不餍，害有不可胜言者矣。\n" +
                "【问功名】四爻以阳居阳，位近至尊，功名显达，其象贞吉，然得不以正，害即随之，最宜谨慎。\n" +
                "【问家宅】其宅必临通衢往来之地，邪正杂处，交际最宜慎择。\n" +
                "【问疾病】必是心神恍惚之症，宜静养。\n" +
                "【问婚姻】防女家闺范不谨。\n" +
                "【问六甲】生女。"
            },
            {
                原: "九五：咸其脢，无悔。",
                象: ["咸其脢，志末也。"],
                析: "按：《注》云“，脢者心上口下”，马云“脢背也”。《博雅》“胛谓之脢”，即背脢也；心在前，背在后，是不动之处也。《艮》之象曰“艮其背”，知背为《艮》之所止；爻辞曰“咸其脢”，殆即孟子所云，“君子所性，根于心，盎于背，施于四体，四体不言而喻”者是也。五爻以阳刚中正之德，居君上之位，下应六二。六二日“咸其腓”，腓为足肚，不能自动，五曰“咸其脢”，脢为背脊，亦不能自动，故其《咸》也，若有不感而感，而其动也，亦若有不动而动。不动而动，在脢亦不自知其动也，悔何有焉？《象传》曰“志末”，谓此乃不感而感，感之至也。彼初之“志在外”，三之“志在随人”，皆有心而感者，抑末矣。一说：《象传》“志末也”者，谓尊居九五，当抚恤亿兆之心，志愿斯为大矣，若甘作自安之计，期免目前之悔，其志不亦微末乎？" ,
                占:
                "【问战征】宜潜袭其后以攻敌背，有胜无败。\n" +
                "【问营商】《象》曰“志末”，末微小也，知其商业不大，利亦微薄。\n" +
                "【问功名】背者，败北也，知所求未必成名。\n" +
                "【问疾病】台背，寿征也，知病即愈，无悔，且获多寿。\n" +
                "【问六甲】生女。"
            },
            {
                原: "上六：咸其辅颊舌。",
                象: ["咸其辅颊舌，滕口说也。"],
                析: "“辅”者，颊之里，“颊”者辅之表，舌在口中，舌动则辅颊随之。此爻阴柔不中，居卦之极，比近尊位，专以谗口惑君者也。是巧佞之小人，为圣人所深恶也，故不系凶辞，而其凶自见矣。《象传》曰“腾口说也”，腾谓张口骋辞，或曰虚也，谓无诚实，徒夸虚说以诳世，《咸》道薄矣。" ,
                占:
                "【问战征】防有间谍窥探。\n" +
                "【问营商】恐有口舌之祸。\n" +
                "【问功名】可献策陈言，当得召用。\n" +
                "【问家宅】主人口不睦，口角起争。\n" +
                "【问疾病】呓语谵言，心魂不安，宜祷。\n" +
                "【问婚姻】中人之言，未可全信。\n" +
                "【问六甲】生女。"
            },
        ]
    },
    {
        x:"011100",//恒
        e:{
            原: "恒：亨，无咎，利贞。利有攸往。",
            象: ["雷风，恒，君子以立不易方。"],
            彖: ["恒，久也。刚上而柔下，雷风相与，巽而动，刚柔皆应，恒。恒，亨，无咎，利贞，久于其道也。天地之道，恒久而不已也。利有攸往，终则有始也。日月得天而能久照，四时变化而能久成，圣人久于其道，而天下化成。观其所恒，而天地万物之情可见矣。"],
            析: "《上经》首《乾》而继《坤》，《坤》即《乾》之配；《下经》首《咸》而继《恒》，《恒》即《咸》之久。《咸》为可大之业，《恒》为可久之德，可久配天，可大配地，故《乾》亦为久，《坤》亦为大。《震》男《巽》女，本从乾坤而生，雷风即乾坤之嘘气也，乾坤不变，雷风亦不变，故雷风之卦曰《恒》。\n" +
            "通观全卦，《序卦传》曰：“夫妇之道不可以不久也，故受之以恒。”《咸》为夫妇之始，《恒》为夫妇之常，所谓《下经》首《咸》《恒》，以夫妇之道配《乾》《坤》也。然《恒》一卦，惟五爻言夫妇，余爻皆历言《恒》之不当，以为垂诫；且六爻无一吉辞，即《彖》辞，亦第云“无咎”。盖《恒》为天地之常道，日月久照，四时久成，不恒则变，《恒》则得其正。是以圣人曰“人而无恒，不可以作巫医”，皆反言以警之，而于《恒》未尝有赞词也。《象》曰“君子立不易方”，亦惟以不易者，守其《恒》而已。卦体六爻相应，刚柔二气，交相为用，刚有刚之道，柔有柔之道，《恒》之亨而无咎，惟久于其道也。《恒》之反卦为《咸》，故二卦爻象，皆颠倒相因。《恒》初爻之深刻，即《咸》上之巧令也；《恒》二之“悔亡”，即《咸》五之“无悔”也：《恒》三之承羞，即《咸》四之“朋从”也；《恒》四之非位，即《咸》三之“随人”也；《恒》五之妇吉夫凶，即《咸》三“凶，居吉”也；《恒》上之“大无功”，即《咸》初之“志在外”也。故二卦同体，而爻象反复。《咸》曰“圣人感人心，而天下和平”，《恒》曰“圣人久于其道，而天下化成”，天地万物之情，皆可于此见之矣。" ,
            占:
            "【问战征】雷出于地，风生于谷，防有敌兵埋伏，火炮攻击之虑。宜坚守营垒，不可退，后可以转败为功。\n" +
            "【问营商】《震》属正东，《巽》属东南，曰“立不易方”，言贸易不可改易地方也。\n" +
            "【问功名】《震》《巽》皆木，木植立不易，干霄直上，自得直达之象。但宜久成，不宜躁进。\n" +
            "【问家宅】此宅坐西北，朝东南，为祖遗旧宅，是恒产，方向切不可移易。\n" +
            "【问婚姻】男家长男，女家长女，二长相配，婚姻大利，可卜百年偕老。\n" +
            "【问疾病】必是肝火上冲，痰火气喘，须服前方，不必改易。\n" +
            "【问六甲】生男，必是初胎。"
        },
        ye:[
            {
                原: "初六：浚恒，贞凶，无攸利。",
                象: ["浚恒之凶，始求深也。"],
                析: "“浚”，深也。初爻当《恒》之始，以始求终，所当循序渐进，方能几及，所谓登高必自卑，行远必自迩，由此以往，无不利也。若乃辍等以求，如撮土而期为山，勺水而欲成海，初基乍立，后效殊奢，事虽不失其正，要必难免于凶也，故曰“浚恒，贞凶”。《象传》曰“始求深也”，“始”，指初爻也，谓其未涉其浅，而遽求其深，是欲速而不达者也，非徒无益，反见其凶，譬如用智而失之凿，求道而索之隐，皆“浚恒”者之过也。" ,
                占:
                "【问战征】宜步步为营，切忌孤军深入，深入必凶。\n" +
                "【问营商】宜得利即售，不可垄断居奇，以贪高价。\n" +
                "【问功名】宜安分守职，切勿梯宠希荣，徼幸图功，恐反招辱。\n" +
                "【问婚姻】婚姻之道，宜以门户相当，切勿慕富攀贵，贪结亲，反致后悔。往往有之。\n" +
                "【问家宅】宅是新建，惜乎过求华丽，致难持久。\n" +
                "【问讼事】恐一经涉讼，历久不了。\n" +
                "【问六甲】初胎，生女，惟恐难育。"
            },
            {
                原: "九二：悔亡",
                象: ["九二悔亡，能久中也。"],
                析: "二爻以阳居阴，是失位也，失位故有悔；然二处《巽》之中，为《巽》之主，二与六五阴阳相应，以刚中之德，辅柔中之君，道既得中，又能持久，故曰“悔亡”。《象传》曰“能久中也”，谓可久之道，不外乎中，能“久于其道”，必能久于其中也。二爻能之，悔自亡矣。" ,
                占:
                "【问战征】营位失当，恐有后悔，惟宜居中不动，持久固守，可免祸也。\n" +
                "【问营商】货物不得销路，致有耗败，宜历久待价，可得反本。\n" +
                "【问功名】失其机会，反招灾害，待时而往，虽不成名，亦无尤也。\n" +
                "【问家宅】此宅地位不当，居者不利。十年之后，宅运可转，方得无咎。\n" +
                "【问婚姻】平平。\n" +
                "【问六甲】女生。"
            },
            {
                原: "九三：不恒其德，或承之羞，贞吝。",
                象: ["不恒其德，无所容也。"],
                析: "九三处《巽》之极，《巽》为进退，为不果，“不恒其德”之象。“羞”者，耻也，九三以阳居阳，其位虽正，因其执心不定，德性无恒，而错误随之。“或”者，将然之辞，谓虽未明见其羞，而羞或承之矣，虽贞亦吝。“吝”谓可鄙也，《象传》曰“无所容也”，大节一亏，无所逃于天地之间，盖深斥之也。" ,
                占:
                "【问战征】军事贵勇往果决，得以制胜，《巽》为不果，必多畏却，则进退无恒，势将辱国伤师，咎何能辞？\n" +
                "【问营商】爻辞曰“不恒其德”，是必商无恒业也，何以获利？\n" +
                "【问功名】二三其德，业必不就，名何由成？\n" +
                "【问家宅】三爻居《巽》之终，《巽》终变《震》，《震》为大途，此宅必近大道之旁，其宅不利久居。\n" +
                "【问婚姻】姻事不终，恐贻羞辱。\n" +
                "【问六甲】生女。"
            },
            {
                原: "九四：田无禽",
                象: ["久非其位，安得禽也。"],
                析: "“禽”者，鸟兽之总名，《震》为猎夫，《巽》为禽。九四处《震》之初，已出于《巽》，是《震》之猎夫前进，《巽》之禽后退，以此而田，必无获也，故曰“田无禽”，以喻失民心也。夫所贵于《恒》之道者，德称其位，才胜其任，事上而有所建明，治下而有所康济，积日累久，则其所裨益必多。九四以阳居阳，与初六相应，初六“浚恒”既“无攸利”，无利者，亦即“无禽”之谓也。《象传》曰“久非其位，安得禽也”，大凡所处非其地，所乘非其时，所为非其方，所交非其人，皆久而无功也。田之于禽，其得失最著者也，故以之为象。" ,
                占:
                "【问战征】立营不得其位，必致师老无功。\n" +
                "【问营商】凡货物销售，各有其地，如求木于渔，问鱼于樵，虽久于其业，必无获也。\n" +
                "【问功名】如不入场屋，而望高科，不登廊庙，而求显官，居非其位，虽久无获也。\n" +
                "【问家宅】此宅方位不利，不可久居，宜急迁移。\n" +
                "【问婚姻】两姓配偶不合。\n" +
                "【问六甲】生男，恐难养育。"
            },
            {
                原: "六五：恒其德，贞妇人吉，夫子凶。",
                象: ["妇人贞吉，从一而终也。夫子制义，从妇凶也。"],
                析: "六五居得尊位，为《恒》之主，下与九二相应。九二居《巽》，《巽》为妇，六五居《震》，《震》为夫。六五专守九二之应，贞一其德，贞则贞矣，为妇则吉，为夫凶也。不知五为《震》主，《震》为行，丈夫之志，当以义制事，推行尽利，以垂久之业，若第以从一为正，是妾妇之道也，孟子所谓“贱丈夫”者是也。《象传》曰“从一而终”，谓妇人之德，惟宜从一，故曰“贞吉”；夫“夫子制义”，谓丈夫之行，惟宜审义。义则不害于贞，贞则或伤其义，故曰“从妇凶也”。《象传》所云“贞吉”者，指妇人也；“利有攸往”者，指丈夫也。知夫此，而《恒》之道得矣。" ,
                占:
                "【问战征】古称军中有妇女，士气不扬，项羽之败，未始非虞姬累之也。行军宜凛之。\n" +
                "【问营商】商业宜随时变通，若拘泥执一，妇孺贪小之见，必无大利也。\n" +
                "【问功名】丈夫志在四方，前程远大，若徒贪恋闺房，伤身败名，凶莫大焉。\n" +
                "【问家宅】古云“牝鸡司晨，惟家之索”，是当深戒。\n" +
                "【问婚姻】女家占此则吉，男家占此则凶。\n" +
                "【问六甲】生男。"
            },
            {
                原: "上六：振恒，凶。",
                象: ["振恒在上，大无功也。"],
                析: "《震》动也，故《恒》至于上，有振动之象焉。上六处《震》之终，为动之极。动者宜守之以静，终者宜返之以始，斯德可全于末路，业不败于垂成，恒道成矣。今上六处《恒》之极，而振动不已，以振为恒，恒有尽而振无尽，是以凶也。《震》为决躁，《巽》亦为躁卦，躁动无时，犹是雷发而不收，风行而不止，其何能有功哉！故《象传》曰“大无功也”。" ,
                占:
                "【问战征】上为主帅，行军之道，全在镇定，若妄动喜功，必无成也。\n" +
                "【问营商】上为一卦之归宿，是商业归结之时也，当归结而不归，收发无时：终无结局也。\n" +
                "【问功名】上处卦之终，功名已尽，若复痴心妄求，不特无成，恐反致祸。\n" +
                "【问家宅】此宅已旧，不必改作，改作必凶。\n" +
                "【问婚姻】必是晚年续娶也。无须再娶，娶则必凶。\n" +
                "【问讼事】急宜罢讼。\n" +
                "【问失物】不得。"
            },
        ]
    },
    {
        x:"001111",//遁
        e:{
            原: "遯：亨，小利贞。",
            象: ["天下有山，遁，君子以远小人，不恶而严。"],
            彖: ["遁，亨，遁而亨也。刚当位而应，与时行也。小利贞，浸而长也。遁之时义大矣哉！"],
            析: "《序卦传》曰：“恒者，久也。物不可以久居其所，故受之以遁。遁者，退也。”卦体上《乾》下《艮》，四阳在上，二阴渐进。自《姤》一阴，至二而长，阴长阳退，卦以《遁》名，谓阳避阴而《遁》也。遁字从豚，从走，豚见人而逸，故《遁》取豚以象逸。乾为天，亦为远，有远遁之义也；《艮》为山，亦为居，有《遁》居之象也，故曰《天山遁》。\m" +
            "通观此卦，以阴阳不能偏无，所恶于阴者，为其浸长而消阳耳。人或视阴为柔弱易制，不知纯《乾》之阳，二阴渐积，可以消之使尽。所当于阴之始长，而遁而远之，使不授阴以可消之权，而阳乃得以复亨，故曰“遁亨，遁而亨也”。《象》曰，“君子以远小人，不恶而严”，盖不与之比，亦不与之争，决然远遁，《遁》之得其正焉矣。合上下二卦观之，上卦《乾》健，有断然舍去之象，下卦《艮》止，有依恋执留之意，故下卦不如上卦之吉。《遁》不嫌远，愈上愈吉。就六爻分《观》之，初爻《遁》而露其尾，非真《遁》者也。二爻言“执”不言《遁》，不欲《遁》者也。三爻《遁》而有所“系”，将《遁》而未决者也。四爻曰“好遁”，是能不阿所好，超然远《遁》者也。五曰“嘉遁”，是能以贞自守，《遁》得其吉者也。上曰“肥遁”，是能明以审几，飞《遁》离俗者也。然《易》不可执一论，用之则行，舍之则藏，惟识其时而已。故《遁》者，君子见几之智也。曰“君子”，曰“小人”，示其大体而已。" ,
            占:
            "【问战征】防前进有山，山间有敌兵埋伏，致遭败北。\n" +
            "【问营商】恐一时物价涨落不同，相去甚远。\n" +
            "【问功名】宜退隐，不宜进见。君子吉，小人否。\n" +
            "【问家宅】此宅近山，前面空阔辽远，防有阴崇。\n" +
            "【问疾病】病有鬼祟，宜敬而远之，以避居为吉。\n" +
            "【问婚姻】二五阴阳，本属相应，但邪正不同，以谢绝之为吉。\n" +
            "【问六甲】生女。"
        },
        ye:[
            {
                原: "初六：遯尾厉，勿用有攸往。",
                象: ["遁尾之厉，不往何灾也。"],
                析: "初爻居《艮》之始，《艮》为穴居，又为尾，故曰“遁尾”。贤者避地，入山惟恐不深，入林惟恐不密，不欲使人尾其后也。若乃《遁》而不藏其尾，非真《遁》也，是殆借名山为捷径，欲藉《遁》以为攸往计耳。古今来高隐不终，不特为猿鹤贻笑，而功犹未成，失即随之，其危厉，皆自取之耳。故戒之曰“勿用有攸往”，谓其宜遁而不宜往也。《象传》曰：“不往何灾”，盖往则灾来，不往则无灾，反言之以阻其往也。" ,
                占:
                "【问战征】为伏兵言也。埋伏宜深藏不露，使敌不得窥其遗迹，若藏头露尾，必致危厉，不如不往也。\n" +
                "【问营商】销卖货物，宜赶快，不宜落后，并宜首尾一并卖讫，斯可免灾。\n" +
                "【问功名】龙门烧尾，吉。\n" +
                "【问家宅】宜速迁移，落后有灾。\n" +
                "【问婚姻】《遁》者，避而远之之谓，婚姻不合。\n" +
                "【问六甲】生女。"
            },
            {
                原: "六二：执之用黄牛之革，莫之胜说。",
                象: ["执用黄牛，固志也。"],
                析: "“执之”，“莫之”，两“之”字，皆指《遁》者言。黄，中央之正色，牛性柔顺，革性坚韧。《艮》为皮，故曰“革”；《艮》为手，故曰“执”；二得《坤》气，《坤》为黄牛，故曰“黄牛”。二居内爻，为成卦之主，上应九五，阴长阳消，应五而实消五，五即因之而《遁》，诸爻亦相随遁去。二爻欲执而留之，如白驹之诗，所咏“执之维之”者是也。“执之用黄牛之革”，以拟其执留之坚，而莫之遁焉。“胜”者，堪也，“说”者，解脱也，“莫之胜脱”，使之不可逃脱也。诸爻皆言《遁》，二爻独不言《遁》，《遁》者诸爻，而驱之使《遁》者，二爻也；二既驱之使《遁》，而复欲假意以执之，不令其遁，是小人牢笼之计也。《象传》曰“固志”，五之《象》曰“正志”，二五之志本不同。二欲藉嘉会之礼，以笼络五之志，使之不遁，“固志”者，固五之志也。" ,
                占:
                "【问战征】当诸军逃散之际，独能坚执固守，为可嘉也。\n" +
                "【问营商】固一时货价逐涨，执守来本，莫能脱售。\n" +
                "【问功名】席珍待聘，美玉待沽，功名之兆也。“莫之胜脱”，功名难望矣。\n" +
                "【问家宅】此宅阴气渐盛，居者不利，群思迁移，即欲脱售，一时亦难。\n" +
                "【问婚姻】此婚已成，后欲退悔，执柯者甚属为难。\n" +
                "【问六甲】生女。"
            },
            {
                原: "九三：系遯，有疾厉，畜臣妾吉。",
                象: ["系遁之厉，有疾惫也。畜臣妄，吉，不可大事也。"],
                析: "“系”者，羁绊之义。三以阳刚，居内卦之上，与二阴阳相亲比，为二所羁縻，不忍超然远引，欲《遁》而志不决，故曰“系遁”。凡当《遁》则《遁》，贵速而远，一有所系，则忧愁莫定，宛如疾痛之在身，危厉之道也，故曰“有疾厉”。盖“系”者，三系于二，阴为之主；“畜”者，二畜于三，阳为之主。以阴系阳则厉，以阳畜阴则吉。“臣妾”者阴象，三阳在二阴之上，故能畜。君子之于臣妾，畜之以供使令，进退无足关重轻也，是以“系遁”不失为吉，至若当大事，必致因循而坐误也。《象传》曰：“有疾，惫也”，惫谓力竭而敝惫也。“不可大事也”，大事者，指三一生大节而言，不可或忽也。" ,
                占:
                "【问战征】军阵进退，皆有纪律，鼓进金退，最要便捷，一有迟误，必致大败也，宜慎。\n" +
                "【问营商】货物当脱售之时，不宜踌躇不决，或系恋私情，防误大事。\n" +
                "【问功名】时当奸人秉政，宜急流勇退，斯无疾害。\n" +
                "【问家宅】此宅不利，主多病厄，宜速迁移，若迟延不去，恐有大祸。\n" +
                "【问婚姻】娶嫡不利，娶妾则吉。\n" +
                "【问六甲】生女。"
            },
            {
                原: "九四：好遯，君子吉，小人否。",
                象: ["君子好遁，小人否也。"],
                析: "四与初相应，相应必相好，乃初与四好，而四不好初；且四因初之好，而决意远遁，故曰“好遁”。然在初之好四，亦非真好，不过欲借四以为重，是引用君子之意，若新莽之礼贤下士是也。四则有见于此，不为初所笼络，而超然远引，谓尔虽好我，我不好尔，尔不我遁，我则自遁，我行我志而已。四入《乾》，《乾》为君子，故曰“君子吉”。在初之厚貌深情，以为四必感恋情好，不意室迩人远，一去千里，竟有不可执维者。初处《艮》，《艮》为小子，故曰“小人否”。一说“好遁”者，谓有所好而遁也，犹《论语》“从吾所好”之好。世人所好，在富贵功名，君子所好，在乐天知命，此谓好遁。亦通。" ,
                占:
                "【问战征】四处《乾》之始，《乾》为健，知进不知退。或军中有一人谋陷，故作退计以避之。退亦吉也。\n" +
                "【问营商】商家以买入为进，卖出为退，四曰“好遁”，知以出货为得利也。\n" +
                "【问功名】爻辞“好遁”，是其人必无意于功名也。然名亦不同，或盗虚名于一时，或垂大业于千秋，君子小人，所由分也。占者宜自审焉。\n" +
                "【问疾病】四《乾》体，爻曰“好遁”，阳《遁》而入阴，其病危矣。然转危为安，亦《遁》之象，想大人可治，小人难也。\n" +
                "【问婚姻】防后有离婚之忧。\n" +
                "【问讼事】俗云“三十六着，走为上着”，“好遁”之谓也。\n" +
                "【问六甲】生男。"
            },
            {
                原: "九五：嘉遯，贞吉。",
                象: ["嘉遁贞吉，以正志也。"],
                析: "五以阳居阳，刚健中正，虽与六二相应，能知时审势，应变识几，超然远遁。其遁也，不为情移，不为势屈，意决而志正，洵可嘉美矣，故曰“嘉遁，贞吉”。《象传》曰“以正志也”，谓九五《遁》得其正，即可以正二之志，是“不恶而严”也。" ,
                占:
                "【问战征】正当敌势强盛，能以潜遁而返，得保全师，亦可嘉也。\n" +
                "【问营商】货到该处，时价不合，而转别地，得以获利，可谓应变而不失其正也，故吉。\n" +
                "【问功名】爻以九五为尊，占得九五，是必功名显达，位近台辅。伊尹曰，“臣罔以宠利居成功”，谓能以功成身退者也，故吉。\n" +
                "【问家宅】此宅必是南阳诸葛之庐，栗里陶令之宅也，高风可尚。\n" +
                "【问婚姻】二五本阴阳相应，有意议婚，五以其志不同，不允。另就他聘，吉。\n" +
                "【问疾病】是阴邪纠缠之症，潜而遁避，可获吉。\n" +
                "【问六甲】生男。"
            },
            {
                原: "上九：肥遯，无不利。",
                象: ["肥遁无不利，无所疑也。"],
                析: "“肥”者饶裕也。卦中诸爻，欲遁而多所系累，此爻独无应无比，故无系累，不复劳顾忌，飘然远弓，所谓进退绰有余裕者也，故曰“肥遁，无不利”。《象传》曰：“无所疑也”，谓上爻居《乾》阳之首，其察势也明，其见几也决，首先高遁》，绝无一毫之疑碍也。或谓“嘉遁”如殷微子，如汉张良，“肥遁”如泰伯、伯夷，或又如汉之商山四皓也。" ,
                占:
                "【问战征】战事宜进不宜遁，遁必不利；爻曰“肥遁，无不利”，其惟太王避狄迁岐乎？\n" +
                "【问营商】商人谋利，往往群焉竞逐，今独能人取我弃，以退为进，则其退反得厚利，故爻曰“肥遁”。\n" +
                "【问功名】其人必不以膏梁肥口，能以道义肥躬，故曰“肥遁，无不利”。\n" +
                "【问家宅】此宅地位甚高，家道亦富，但利于求财，不利于求名。\n" +
                "【问疾病】肥人气虚，《遁》者，脱也，恐致虚脱。\n" +
                "【问婚姻】恐女子贪恋富室子弟，因而私奔。\n" +
                "【问六甲】生男。"
            },
        ]
    },
    {
        x:"111100",//大壮
        e:{
            原: "大壮：利贞",
            象: ["雷在天上，大壮，君子以非礼弗履。"],
            彖: ["大壮，大者壮也。刚以动，故壮。大壮利贞，大者正也。正大而天地之情可见矣。"],
            析: "《序卦传》曰：“物不可以终通，故受之以大壮。”《遁》者，阳之退，《大壮》者，阳之进，无往不复，《大壮》所以继《遁》也。卦体《乾》下《震》上，《乾》刚在下，加以《震》阳在上，乘健而动，动而愈刚，壮往之势，进而不止，既壮又大，是四阳之过也，故卦曰《大壮》。\n" +
            "通观此卦，卦体《乾》下《震》上，卦象内刚外动，乘此阳之正壮，以逼阴之将消。疑若易易，然阴方得位，未可遽逼，刚不可恃，进不可躁，故君子必以礼为履也。《大壮》反卦为《遁》，《遁》，退也，二阴方进，其退不可不决；《大壮》，进也，：二阴未退，其进不可太猛。《杂卦传》曰，“大壮则止，遁则退也”，其卦义相反如此，而爻象亦皆先后互反。阴进则阳退，阴退则阳进，此《大壮》所以继《遁》也。六爻分属二卦，内三《乾》体，外三《震》体，以二五为得中。初爻为《乾》之始，一往直前，知进而不知退，故“凶”。二爻为《乾》之主，喜得其中，而犹不失其正，故“吉”。三爻居《乾》之终，“小人”指初，“君子”指二，“罔”谓法网，即君子怀刑之意，盖合初与二，分言以明之也。四出《乾》入《震》，为壮之主，以阳处阴，动不违谦，故得吉而“悔亡”。五爻居《震》之中，能于平易之时，柔而得中，不用其壮，故“无悔”。上居《震》之极，进退维谷，何利之有？唯能凛之以艰则吉。总之，持盈保泰，壮乃得吉，越礼违谦，壮必有悔，是必如三之“用罔”，而不“用壮”，斯为处壮之要道也，玩《易》者其审之！" ,
            占:
            "【问战征】军势强盛，有疾雷不及掩耳之势；但兵骄必败，所当深戒。\n" +
            "【问营商】雷在天上，是货价高标之象，得价而售，不可过。\n" +
            "【问功名】雷声远震，必得成名。\n" +
            "【问家宅】防有火灾，宜祷。\n" +
            "【问疾病】《震》为雷，亦为足，防有足疾，不能行也。\n" +
            "【问婚姻】《震》为《乾》之长子，《巽》为《坤》之长女，是天合也，吉。\n" +
            "【问失物】雷一过而无形，恐此物不能复得。\n" +
            "【问六甲】生男。"
        },
        ye:[
            {
                原: "初九：壮于趾，征凶，有孚。",
                象: ["壮于趾，其孚穷也。"],
                析: "初居《大壮》之始，在下卦之下，在下而动，故曰“壮于趾”；《震》为征，故曰“征”；迈征而往，有急起直追之势，无“视履考祥”之念，是以凶也，故曰“征凶。”“有孚”，《象传》曰“其孚穷也”，谓初虽与四应，初既穷其所往，四又隔远，无能为力也，故曰“其孚穷也”。" ,
                占:
                "【问战征】“壮于趾，征凶”，为孤军深入者戒也，有勇无谋，是以凶也。\n" +
                "【问营商】货财贩运，有不胫而走、不翼而飞之妙；然不度销路，而贸然而往，何能获利？故凶。\n" +
                "【问功名】初本在下，曰“趾”，则动亦在下，功名必卑。\n" +
                "【问家宅】“趾”，止也，此宅宜安止，不宜迁动，动则有凶。\n" +
                "【问婚姻】防女有足疾。“征凶，有孚”，谓虽有聘约，“其孚穷也”。\n" +
                "【问失物】此物已被足所践踏而坏。\n" +
                "【问六甲】生男。"
            },
            {
                原: "九二：贞吉",
                象: ["九二贞吉，以中也。"],
                析: "全卦诸爻，皆失于过刚，惟二爻为得中，中者不偏之谓也。二与五应，无抵触之失，是以无过不及，而进退适宜，故不言“壮”，不言“正”，直曰“贞吉”，盖即以《彖》之“利贞”归之，而著其吉也。《易》道虽贵扶阳抑阴，然阳刚过盛，亦失其中，故必抑其过刚，以就其中，中则正，正则吉也。《象传》曰“以中也”，以九二当下卦之中，刚而能柔，所处得中也。" ,
                占:
                "【问战征】以中营得力，故能获胜，吉。\n" +
                "【问营商】以货价适宜，得其时中，可获利也。\n" +
                "【问功名】恰好中式，吉。\n" +
                "【问婚姻】雀屏中选，吉。\n" +
                "【问家宅】此宅坐西朝东，地位适中，大吉。\n" +
                "【问疾病】病在中焦，宜用潜阳滋阴之剂，自得痊愈。吉。\n" +
                "【问讼事】得中人调剂，即息。\n" +
                "【问六甲】生男。\n" +
                "【问行人】已在中途，即可归也。"
            },
            {
                原: "九三：小人用壮，君子用罔，贞厉。羝羊触藩，羸其角。",
                象: ["小人用壮，君子罔也。"],
                析: "“羝羊”，牡羊也。三至五体《兑》，为羊，故取象于羊；卦体纯刚，故曰“羝羊”，以喻刚阳之盛也。三当内卦之终，逼近外卦，《乾》刚《震》动，壮象将成。小人处此，必将恃其壮而壮焉，是谓“用壮”；君子有其壮，而不敢自居其壮，一若未尝有壮也，故曰“用罔”。“罔”，无也，京房［8］曰，“壮一也，小人用之”，君子有而不用是也。三以阳处阳，重刚不中，虽贞亦危，故曰“贞厉”。君子因其厉而益加强焉，朝乾夕惕，时以非礼自防，不敢或逞其壮，所谓以有若无也。九四体《震》，为竹苇，故曰“藩”；藩所以闲羊，四在前，三触之，故曰“羝羊触藩”，象小人之用壮也。“羸”，郑虞作累，为拘累缠绕；“羸其角”，角，羊角，谓羊触藩，其角为藩所拘累，而不能出也，以喻用壮之危。“小人用壮”，当知所返矣；“君子用罔”，斯可免危矣。《象》曰“小人用壮”，小人第知有壮；“君子罔也”，去一“用”字，益见君子之不用，所贵敛之以无也。一说：罔，法网也，君子知壮之为厉，凛凛然以刑网为戒，即君子怀刑之意。亦通。" ,
                占:
                "【问战征】善战者审机察敌，不敢妄动；恃勇者逞强战斗，孤军直入，致陷险地而不能出，是以凶也。\n" +
                "【问营商】自恃资财之富，任意垄断，一至货物毁折，无地销售，必遭大损。善贾者当无是虑。\n" +
                "【问功名】鲁莽者必败，谦退者成名。\n" +
                "【问家宅】此宅地位既高，建屋宜低，屋高恐有震陷之灾。\n" +
                "【问疾病】病由血气过刚，药宜调血下气。\n" +
                "【问讼事】以忍气受屈，息讼为宜，若健讼不休，讼则“终凶”。\n" +
                "【问婚姻】两姓或一贫一富，若富者恃富凌贫，以致夫妻反目，凶。\n" +
                "【问六甲】生男。"
            },
            {
                原: "九四：贞吉，悔亡。藩决不羸，壮于大舆之輹。",
                象: ["藩决不赢，尚往也。"],
                析: "九四出《乾》入《震》，为《震》之始，以阳居阴，不极其刚，故得吉而悔亡也。三之有藩，藩在四也，四前二阴，则藩决矣。“輹”，车轴缚也，《坤》为大舆，《震》上二阴得《坤》气，故亦曰“大舆”。輹壮则舆强，言行远而无碍也。率此以往，壮而不见其壮，悔何有焉？《象传》曰“藩决不羸，尚往也”，谓壮得其贞，乃可许其前往也。" ,
                占:
                "【问战征】前途城垣已破，车驰马逐，长征可无阻也。\n" +
                "【问功名】九四互《乾》，辰在戌，上值奎壁，壁主文昌，所以崇文德也，功名必显。王良五星在壁北，主车马，大舆之象；雷电六星亦相近，主兴雷，即《震》雷之象。\n" +
                "【问营商】可许满载而归，吉。\n" +
                "【问家宅】此宅当车马往来之地，宅前藩篱破落，急宜修整。\n" +
                "【问疾病】人以发肤为藩卫，以心神为舆马，发肤破裂，心神摇荡，病不久矣。\n" +
                "【问婚姻】“车脱輹，夫妻反目”，非佳偶也。不吉。\n" +
                "【问六甲】九四为《震》之始，《震》一索得男，为长子也。"
            },
            {
                原: "六五：丧羊于易，无悔。",
                象: ["丧羊于易，位不当也。"],
                析: "上卦互《兑》，《兑》为羊，五正是羊。“丧”，亡也；“易”音亦，陆作场，谓疆场也，易场古通字。《乾》为郊，郊外谓之牧，五当《乾》郊外疆场之地，畜牧之所也。畜牧有藩，防其逸也。卦以《震》之下画为藩，三触之，四则藩决矣，五则羊逸，羊逸于易，所谓“大道多岐而亡羊”，故曰“丧羊于易”。五居《震》卦之中，偶画为阴，易，为旷郊阴地，阴爻而入阴地，不见其壮，故象为“丧羊”。且羊性刚卤，喜触，无羊则无触，无触则无用壮之悔，故曰“无悔”。《旅》上九曰“丧牛于易”，“易”亦作场。《旅》宜柔，丧其柔，是以“有凶”也；《大壮》恶刚，丧其刚，是以“无悔”也。《象传》曰：“位不当”，谓“无悔”在得中，不在当位，犹九二之“贞吉”，《象》曰“以中”，亦不在位也。总之，《大壮》一卦，《彖》所称“利贞”，以事理言，不以爻位言也，明矣。“易”字，郑谓交易，《本义》读作以智切，音异，谓容易也。义各有取。" ,
                占:
                "【问战征】三爻曰“羝羊触藩”，有攻击之象，“丧羊”则无触，而战事可平。\n" +
                "【问营商】“易”，郑谓交易，有经商之义；“丧”，亡也，恐有小失，然无大悔。\n" +
                "【问功名】以得为吉，以丧为凶，亡羊补牢，未为晚也。晚年可望。\n" +
                "【问家宅】此宅在郊外空旷之处，于牧畜不利。\n" +
                "【问疾病】“丧”，凶象，不吉。\n" +
                "【问婚姻】牵羊担酒，婚礼也，无羊，婚礼不成。\n" +
                "【问六甲】生女。"
            },
            {
                原: "上六：羝羊触藩，不能退，不能遂。无攸利，艰则吉。",
                象: ["不能退，不能遂，不详也。艰则吉，咎不长也。"],
                析: "上处外卦之终，与三相应，上之羊，犹是三之羊，上之触，犹是三之触。三虽羸角，乘刚而动，力能决藩，亦可进也，即不能进，尚可退也；至上势衰位极，爻处重阴，后路既断，前路又穷，将安归乎？不曰“不能进”，而曰“不能遂”，言终不能遂其壮往之愿也。视三之羸角，困益甚焉，利何有也！因退遂之不能，而惕之以“艰”，毖后惩前，“非礼弗履”，亦何难转咎为吉哉！《象传》所谓“不祥也”，言其不能“视履考祥”，故至退遂之两穷也。所谓“咎不长也”，言能知其所艰，则谨慎自守，壮终于此，咎亦终于此耳。" ,
                占:
                "【问战征】六处爻之穷，如追穷寇也，恃胜深入，及为败军所困，进退无路，凶道也。\n" +
                "【问营商】是一意居奇，积货不售，至时过价贱，只要保本，而亦不得，其困甚矣。\n" +
                "【问功名】在上爻有位高而危之象，若恋恋不退，一旦祸及，欲退不能，悔已晚矣。\n" +
                "【问家宅】上爻居《震》之极，《震》为响，宅中必有响；《震》又为木，木动克土，恐有土精出现，土精为羊。其宅不利，所当艰难自守，至之卦为《晋》，《晋》曰“赐马蕃庶”，则可转咎为吉。\n" +
                "【问婚姻】未及详探，一时已定，兹要改悔，必不能也。现当知苦困守，久后必佳。\n" +
                "【问六甲】生女。"
            },
        ]
    },
    {
        x:"000101",//晋
        e:{
            原: "晋：康侯用锡马蕃庶，昼日三接。",
            象: ["明出地上，《晋》，君子以自昭明德。"],
            彖: ["晋，进也。明出地上，顺而丽乎大明。柔进而上行，足以康侯用锡马蕃庶，昼日三接也。"],
            析: "卦体上《离》下《坤》，坤为地，《离》为火。《坤》之《彖传》曰“行地无疆”，行即进也；《离》之性为火炎上，炎上亦进也。且物之善进者，莫如牛马，《坤》为马，《离》为牛，皆能行远，有进往之象。火，明也，地，顺也，明则足以烛远，顺则足以推行，又有进长之义。按：《晋》，进也。《晋》古文作晉，从臸从日，臸正字通，即刃切，音进，前往也，上升也。《序卦传》曰，“物不可以终壮，故受之以晋”，此《晋》所以继《大壮》也。\n" +
            "通观全卦，卦体从《大壮》来，上卦变《震》之下画而为《坤》，下卦变《乾》之中画而为《离》；《晋》，进也，壮则行之，是以“进而上行”也。《象》曰“明出地上”，“明”即谓《离》，“地”即谓《坤》，“出”即所谓“上行”也。日之光明在天，日之照临在地，日以明而上行，不明不特不见行，且不见为日也。六爻皆言《晋》，而《晋》各随其先后以为象。初为进步之始，人或不我孚也，宜宽裕以处之也。二进于初，二虽怀愁，已见其吉而受福也。三则又有进矣，罔孚者，忽而其孚，众心允服，悔何有焉？内三爻得《坤》之顺，故皆吉；四当外卦之始，出《震》入《离》，首鼠两端，有一前一却之象，虽贞亦厉。五为卦主，柔进上行，故“往吉，无不利”也。上处《晋》之极，“角”，即《大壮》羝羊之角也，进而不顺，必致吝也。外三爻当《离》之位，高而难进，故多厉。盖《离》之配卦十有六，象之最美者，莫如《晋》、《大有》。《大有》“明在天上”，其明最盛；《晋》“明出地上”，其明方新。明之方新，其进贵柔，六爻中四上两爻曰“厉”，四进非其道，故如技穷之鼠，上穷而又进，故有《晋》角之危，皆失柔进之道也。圣人显微阐幽，忧患作《易》，故于《晋》明之世，犹必以“贞厉”“贞吝”为戒。初、二、三、五之吉，正所以劝其进也。自明其德，用以明天下之德，旨在斯乎？" ,
            占:
            "【问时运】正当好运新来，犹朝日初出，渐升渐高，明光普照也。吉。\n" +
            "【问战征】当大军初发，顺道而进，宜日战，不宜夜攻。\n" +
            "【问营商】最利煤炭地火等生业，取其明也。吉。\n" +
            "【问功名】有功名指日高升之象，吉。\n" +
            "【问讼事】宜返而自讼。\n" +
            "【问家宅】此宅朝东南，高敞明朗，得太阳吉曜照临，大吉。\n" +
            "【问六甲】生女。\n" +
            "【问失物】在明堂中寻之，得。"
        },
        ye:[
            {
                原: "初六：晋如摧如，贞吉。罔孚，裕无咎。",
                象: ["晋如摧如，独行正也。裕无咎，未受命也。"],
                析: "初居下卦之始，柔进上行，自初起，首曰“晋如”，若欲进而未果；继曰“摧如”，若有摧而见阻。初与四应，四不当位，不特不应，且所以摧初之进者，实四为之也。然虽见摧，惟其得贞，是以吉也。“罔孚”者，推其摧之由来，虽四为之，亦由上下之交未孚耳。《坤》为裕，故曰“裕”。当其未孚，或汲汲以干进，或悻悻而怀忿，皆所以取咎也，唯雍容宽裕，乐道自处，咎何有焉？故曰“裕无咎”。《象传》曰“独行正也”，谓摧者不正，《晋》者能独行其正耳。“无咎，未受命也”，谓其未受赐命，只宜宽裕以待之耳。" ,
                占:
                "【问时运】目下好运初来，虽无灾咎，尚未盛行，宜迟缓以待之。吉。\n" +
                "【问战征】初次行军，众心未定，宜宽以待之。吉。\n" +
                "【问营商】货物初到，商情未洽，宜宽以时日，早则四日，迟则四月，到四爻曰“众允”，则货可旺销，必大获利。\n" +
                "【问功名】功名固所自有，不可知者迟早耳，宜宽怀以俟。\n" +
                "【问家宅】此宅本吉，一时未许进居，为两情未洽，缓则必成。\n" +
                "【问婚姻】因探听未确，迟缓可成。\n" +
                "【问失物】日后可得。\n" +
                "【问疾病】宜宽缓调养，可愈．\n" +
                "【问六甲】生女。"
            },
            {
                原: "六二：晋如愁如，贞吉。受兹介福，于其王母。",
                象: ["受兹介福，以中正也。"],
                析: "“愁如”，不悦之意，与“摧如”不同，愁者在我，摧者为人所阻。然二之所以“愁如”，实因初之见摧而来也。居中履正，故“贞吉”。“介福”，谓大福。“王母”，以二与五相应，五王位，《坤》阴，《坤》为妣，故曰“王母”；“王母”，即所谓太后也。二属《坤》，《坤》通《乾》，《乾》为“介福”。按《井》三曰王明受福，《既济》五曰“实受其福”，《井》三、《既济》五，皆得《乾》体，其福盖皆受之于《乾》也。二又互《艮》，《艮》为手，手持福以与二，二受之，故曰“受兹介福”。九家《易》云：“介福谓马与蕃庶之物也。”《象传》曰“以中正也”，谓其守此中正，不以无应而回其志，故终得受此大福也。" ,
                占:
                "【问时运】目下运非不佳，但所求多阻，中心未免忧结，能守正不改，终必亨通大利。\n" +
                "【问战征】前番进攻，既遭摧折，今此再进，殊切愁惧，然能临事而惧，后必获吉。六二与六五相应，六五辰在卯，上值氐、房、心、尾，氐星前二大星主后妃，故取象王母，祷之，则有福。\n" +
                "【问营商】因前贩之货，已被折耗，今兹未免怀愁，故曰“晋如愁如”。惟中正自守，至五爻乃曰“失得勿恤，往吉，无不利”，盖劝其不必忧愁，而自然获福也。\n" +
                "【问功名】今虽忧愁，至五爻曰“往有庆”，盖二年之后，即可获吉。\n" +
                "【问婚姻】吉，但目下不就，须待第三年可成。当有祖母为之作主。\n" +
                "【问家宅】当迁居，与祖母同居共食，吉。\n" +
                "【问失物】久后可得。\n" +
                "【问六甲】生女。"
            },
            {
                原: "六三：众允，悔亡。",
                象: ["众允之，志上行也。"],
                析: "三居内卦之上，与四为比，刚阻于前，似宜有悔。“允”，信也，六三辰在亥，得《乾》，《乾》为信。三比近初二，又与初二同心并力，合之为三，三人成众，故“众允”。外卦为《离》，《离》取其明，所谓克明克允是也。“众允”则四不能摧，故“悔亡”。古今来为国谋事，要皆以众心之向背为成败者也，众心不顺，其事虽正，卒无成功。孟子所谓“多助之至，天下顺之”者，“众允”之义也。初之“罔孚”，未信也；三之“众允”，见信也。孔子所谓“信而后谏”，“信而后劳其民”，事上使下，道在是焉。《象传》曰“众允之，志上行也”，三与上应，志在上行，故能与众同信也。" ,
                占:
                "【问时运】目下灾悔已去，大众悦服，故吉。\n" +
                "【问营商】初时为众所摧，不能获利，今众情和睦，可以无咎，卖买皆利。\n" +
                "【问战征】众志成城，战必胜，攻必克，上行无悔。\n" +
                "【问功名】得众人推举乃成。\n" +
                "【问家宅】主眷属和睦，吉。\n" +
                "【问婚姻】两姓和谐，吉。\n" +
                "【问讼事】得有第三人出而处理，两造允从，无悔。\n" +
                "【问六甲】生女。"
            },
            {
                原: "九四：晋如鼫鼠，贞厉。",
                象: ["鼫鼠贞厉，位不当也。"],
                析: "四爻以阳居阴，不中不正，当上下四阴之中，上互《坎》，下互《艮》，《坎》为隐伏，《艮》为鼠，《坎》隐而伤明，《艮》止而伤顺，无其德而居其位，上承阴柔之主，窃弄威权，下抑众阴，使忠言不得上达，以隔绝上下之效者也。其贪戾之性，犹如鼫鼠，故曰“晋如鼫鼠”。自来奸臣得位，其性贪残，昼伏夜动，诡秘百端，窃威弄权，狡同鼫鼠，一旦明德当阳，察识奸邪，浑如硕鼫见猫，罔不捕灭，故曰“贞厉”。《象传》曰“不当位也”，谓斯不当居斯位，为窃位也。按；《解》之卦，以阴居阳象狐，《晋》之卦，以阳居阴象鼠，此卦互体《艮》，一阳在上，故称“鼫鼠”。狐性疑，在《解》当去其疑；鼠性贪，在《晋》当去其贪，取象各有所当。" ,
                占:
                "【问时运】运有蹊跷，宜光明正大处之，若持首鼠两端之见，好为狡诈，必凶。\n" +
                "【问战征】《晋·彖》曰“昼日三接”，或曰接即捷，言一昼间而得三捷。若疑而又贪，如鼠之昼伏夜动，则危。\n" +
                "【问功名】爻曰“鼫鼠”，鼫鼠谓五技皆劣，是必不能得志也。\n" +
                "【问营商】鼠性贪，贪无不败，防为同伙贪财致败。\n" +
                "【问家宅】鼠为穴虫，善盗，宅多鼠，必主耗失。不利。\n" +
                "【问疾病】《诗》云“鼠思泣血”，或有呕血之症；又曰“鼠忧以痒”，或有疥疮之疾，是亦可危。\n" +
                "【问讼事】首鼠两端，是一却一前，一时不能决也。\n" +
                "【问失物】已入鼠穴，不得。\n" +
                "【问婚姻】“鼠”为鼠窃，婚姻不正。\n" +
                "【问六甲】生女。"
            },
            {
                原: "六五：悔亡，失得勿恤。往吉，无不利。",
                象: ["失得勿恤，往有庆也。"],
                析: "五爻为《晋》之主，高居尊位，柔而得中，惟与四相比昵，四遂得窃弄威权，隔绝二三，不得亲近，是以有悔。然五躬备明德，智足察奸，黜六四而任六二，昭明有融，上下交孚，故曰“悔亡”。“失得勿恤”者，谓五不自恃其明，委用六二，信任勿疑，计是非，不计得失，即有小失小得，不足庆也。“往”即“上行”，指康侯往朝于天子也。“吉，无不利”，指受介福于王母也，故《象传》曰“往有庆也。”庆，即“受兹介福”之谓也。" ,
                占:
                "【问时运】目下正当盛运，灾去福来，有得无失，大吉。\n" +
                "【问战征】转败为胜，在此一战，奋勇前往，立见成功。\n" +
                "【问营商】前此小失，今可大得，吉。\n" +
                "【问功名】不必汲汲求名，可无意得之也。吉。\n" +
                "【问家宅】日出于东，《离》位南方，此宅必朝东南。从前小有灾悔，今则屋运已转，吉无不利。\n" +
                "【问婚姻】以九五为男家，六二为女家，两爻皆吉，大利。\n" +
                "【问讼事】曰“悔亡”，谓灾害已去，罢讼则吉。\n" +
                "【问失物】往寻必得。\n" +
                "【问六甲】生女。"
            },
            {
                原: "上九：晋其角，维用伐邑。厉吉无咎，贞吝。",
                象: ["维用伐邑，道未光也。"],
                析: "“角”者，阳而在上，喻威猛之义。上爻处《晋》之极，过刚失中，故曰“晋其角”，谓其知进不知退也。《离》为甲，为戎，《离》上“王用出征”，上爻体《离》，故亦曰“维用伐邑”。用者五，邑指四，奉命而伐之者，上也。四既有罪，声罪致讨，兵虽危事，吉而无咎也。然干羽可以格顽，玉帛可以戢争，不用文德，而用武功，亦未始非圣明之累也，故虽正亦吝，而《传》曰“道未光也”。" ,
                占:
                "【问时运】目下好运将终，防有事故，然无大害。\n" +
                "【问战征】只可近征国内，不可远伐海外。危而终吉。\n" +
                "【问营商】于同业防有纷争，于事则危，于货则利，于情则吝，幸无咎也。\n" +
                "【问功名】“晋，进也”，角在首上，有首选之象。功名成后，防有从戎之役。吉。\n" +
                "【问家宅】居者于乡党中，有纷争之事，未免不安，然无大咎。\n" +
                "【问婚姻】上与三相应，上与三，即为男女两姓，始有纷扰，终得和谐，故“悔亡”，与三同也。\n" +
                "【问讼事】《雀角》之诗，刺讼也。罢讼则吉。\n" +
                "【问六甲】生女。"
            },
        ]
    },
    {
        x:"101000",//明夷
        e:{
            原: "明夷：利艰贞",
            象: ["明入地中，明夷，君子以莅众，用晦而明。"],
            彖: ["明入地中，明夷。内文明而外柔顺，以蒙大难，文王以之。利艰贞，晦其明也。内难而能正其志，箕子以之。"],
            析: "“明出地上”，谓之“火地”；此卦反之，谓之“地火”。明出于地，光明上炎，故卦为《晋》，进也；明入于地，光明下蔽，故卦谓《明夷》，伤也。当此《明夷》之时，暗主临朝，众正并受其伤；《离》来居下，地往居上，日入地中，明受其夷。《序卦》曰：“晋者，进也，进必有所伤，故受之以明夷。”是以谓之地火《明夷》。\n" +
            "通观此卦，《明夷》次《晋》，“晋者，进也，进而不已必伤”，时有泰否，道有显晦，时与道违，虽圣贤不能免灾。《晋》之时，明君当阳，康侯得受其宠；《明夷》之时，暗主临下，众贤并被其伤。太阳入地中，明为之所夷，故贤虽正不容，道虽直不用，仁者怀其宝，智者藏其鉴，“用晦而明”，得其旨焉。就六爻而分言之，初九为《明夷》之始，当逸民之位，见几早去，以潜藏为贞，有保身之智，如伯夷、太公是也。六二文明中正，为《离》之主，承《坤》之下，当辅相之位，以匡救为贞，守常执经，如文王是也。九三当明极生暗之交，与上六相应，通变达权，顺天应人，如武王是也。六四弃暗投明，见几而作，知上六之不可匡救，洁身而去，如微子是也。六五居《坤》阴之中，分联宗戚，职任股肱，不幸而躬逢暗主，以一身系社稷之重，能守贞正，如箕子是也。上六穷阴极晦，与日俱亡者，如商纣是也。总之，《明夷》全卦，以上六为卦主，下五爻皆为上爻所伤，就中内三爻所伤尤甚，故皆首揭“明夷”二字，以示伤害之重也。其象以上卦《晋》为日出，此卦为日落。日者君也，君以贤人为羽翼，以忠臣为股肱，以其身为元首，以亲戚大臣为腹心，乃可登天而照四国。今初爻羽翼伤，二爻股肱伤，三爻元首堕，四五腹心离，上爻之所以入地，其伤节节可睹，其象历历可危。后世人主，当取以为鉴。" ,
            占:
            "【问时运】运当大难，深宜晦藏。\n" +
            "【问战征】《象》曰“莅众”，适值用师之时，宜效明修栈道暗度陈仓之计，必得胜也。\n" +
            "【问营商】卦象艰难，大众恐难取利，暗中尚有分肥。\n" +
            "【问功名】《离》火被土所克，功名不显，显则反有灾害。\n" +
            "【问家宅】家道不顺，或父子分居，尚可保全。\n" +
            "【问婚姻】必非明媒正娶。\n" +
            "【问疾病】是肝火内郁之症，治宜熄火。\n" +
            "【问讼事】宜受曲罢讼，可以免祸。\n" +
            "【问六甲】生女。"
        },
        ye:[
            {
                原: "初九：明夷于飞，垂其翼。君子于行，三日不食。有攸往，主人有言。",
                象: ["君子于行，义不食也。"],
                析: "“于飞，垂其翼”者，谓飞鸟伤翼而下垂。“君子于行，三日不食”者，谓仓促决去，而无可得食。“有攸往”者，去此曰行，适彼曰往。“主人有言”者，谓或议其迂阔，或讽其偏固，虽未定其何辞，要不免啧有烦言也。初爻与四为害应，被四所伤，《离》为飞鸟，故取以为喻。鸟遭伤而不得安栖，欲去而避其害，故曰“明夷于飞，垂其翼”。但初当《离》之始，去上犹远，受伤尚浅，其去也，见风犹早。“三日不食”，《离》为大腹，其体中虚，中虚则腹空，不食之象。“三日”者，以《离》三爻皆明而见夷，故曰“三日”。君子接续而行，谓既去其国，不食其粟，故《传》曰“义不食也”。“君子”，谓初也；“主人”，谓四也。初与四应，四欲伤初，初为避四而远行，四见初去而有言，如初者可谓明于见几，而不受四之所伤，真善用其晦者矣。" ,
                占:
                "【问时运】初运不佳，惟其善自保全，得以无害。\n" +
                "【问战征】为营中粮食已尽，且宜暂退。\n" +
                "【问营商】《明夷》者，恐资本有伤，运货远行，有中途受难之象，又恐主人啧有烦言也。\n" +
                "【问功名】于飞垂翼，明示以不能腾达之象。\n" +
                "【问婚姻】初爻与四相应，而反相害，婚姻不谐。\n" +
                "【问家宅】此宅必是租典，非己屋也，故有主人；“三日不食”，有破灶不炊之象，不利，宜迁。\n" +
                "【问六甲】生女。"
            },
            {
                原: "六二：明夷，夷于左股，用拯马壮，吉。",
                象: ["六二之吉，顺以则也。"],
                析: "二为臣位，居《离》之中，与五相应，五《坤》为暗主，反欲伤害贤臣，是《明夷》之所以为《明夷》也。“左股”者，以二为股肱之臣，《管子·宙合》曰，“君立于左，臣立于右，君臣之分，左阳右阴”，以君在左，故二之所伤在左股也，故曰“明夷，夷于左股”。“用拯”者，与换初辞同，拯，救也，助也，子夏作升。二动体《乾》，《乾》为马，乾健故“马壮”，所谓用马以自拯拔也。虽伤反吉。《象传》曰“顺以则也”，《坤》为顺，以顺则之，是承乾也，即取《乾》马用拯之义。或谓二爻中虚，即内文明之象，卦属周文，文居西岐，视纣都为左，故喻取左股；文囚羑里，当时贡以文马九驷，是谓用拯实事。义殊精切。" ,
                占:
                "【问时运】目下运不甚佳，颇有伤残，幸得禄马相救，故吉。\n" +
                "【问战征】左营之军不利，幸马队得力，得以转败为胜。\n" +
                "【问营商】按策划不适时宜曰左计，知其营谋不合时，故有损失，幸得有马姓人出而调剂，则吉。\n" +
                "【问功名】凡官级以降曰左，似不利也；惟值午年，或交午运，则吉。\n" +
                "【问疾病】《离》二中虚，如陷进然，其人必陷入深坑；伤其左足，幸马力壮健，得一跃而出，虽伤亦吉。\n" +
                "【问家宅】必在左边柱足损伤，宜急修治。\n" +
                "【问婚姻】《离》阴象，女子恐有足疾，不良于行，宜配午命人吉。\n" +
                "【问六甲】生女。"
            },
            {
                原: "九三：明夷于南狩，得其大首，不可疾贞。",
                象: ["南狩之志，乃大得也。"],
                析: "三居《离》位之终，南者《离》之本位，狩者冬猎，守地而取之也。自《离》而《坤》为向西，《坤》伤明不可往，故曰“南狩”。《离》为兵戈，不曰行师，而曰狩田，亦托言从兽以自晦耳。\n" +
                "按：《离》卦上六，曰“王用出征，有嘉折首”，首谓魁首，是恶之大者也。今曰“得其大首”，必是兽之大者？获其大而舍其小，即圣人网开一面之意，于此可见离明之仁德也。“疾”，数也，因狩讲武，固事之正，然数数为之，非特犯从兽无厌之戒，抑且涉日讨军疲之忌，非用晦之道也，故曰“不可疾，贞”；《象传》曰“南狩之志，乃大得也”，谓当此明夷之时，犹得于田行狩，私豵献豕拜，嫌隙不生，得适其晦藏之志，亦大幸矣。一说“南狩”，谓即文王猎于南阳，得遇太公，以得大首，喻太公也。足备一解。",
                占:
                "【问时运】大运不无破败，是宜退守；交冬令，从南出行，必得大利。\n" +
                "【问战征】卦曰《明夷》，明曰进兵，必有伤败，宜潜兵从南而入。《离》上爻曰，“王用出征，有嘉折首”，即合此占。\n" +
                "【问功名】南方属文明，猎兽猎名，皆期其得。“大首”，魁首也，其必膺首选乎？故曰“志大得也”。吉。\n" +
                "【问婚姻】婚礼奠雁射雀，亦取从禽之象，“得其大首”者，谓得其嘉偶。吉。\n" +
                "【问疾病】当出避南方。吉。\n" +
                "【问失物】可就宅南寻之，必得。\n" +
                "【问六甲】生女。\n" +
                "【问家宅】此宅《离》位南向，“大首”者，一乡之大富家也。吉。"
            },
            {
                原: "六四：入于左腹，获明夷之心，于出门庭。",
                象: ["入于左腹，获心意也。"],
                析: "四爻出《离》入《坤》，《坤》为大腹。按卦位，《坤》在《离》之西，为左，“入于左腹”者，即入于《坤》之腹也。入其腹中，自可获其心意，乃不曰获《坤》之心，而曰“获明夷之心”；“明夷”者，合全卦而言，即为“用晦而明”之心，是能卑顺不逆，可效腹心之用者矣。“出”，出《离》也，《坤》方来，故曰“入于”；《离》已退，故曰“于出”。又初之六为《艮》，《艮》为门庭，门庭光明之地，“于出门庭”，亦即取“用晦而明”之义。一说“于出门庭”，谓即微子去之之象。《明夷》一卦，分配周兴商亡，厉历可证。",
                占:
                "【问时运】爻象出明入暗，知为不利，不宜居家，还宜出门。\n" +
                "【问战征】可潜入敌之左营，探听密计，出告大营，可胜也。\n" +
                "【问功名】功名以高升为吉，“入于左腹”，《坤》为腹，是入于地也。不吉。\n" +
                "【问营商】释名，“腹”，复也，富也。入于腹，即入于富也；获心，即称心也；“于出门庭”，是出家经商之象。\n" +
                "【问疾病】是病在心腹，恐是内损之症，宜出门求医。\n" +
                "【问家宅】此宅明堂左首，路有阻碍，出入不便。\n" +
                "【问婚姻】女子腹已有孕，不利。\n" +
                "【问六甲】生女。"
            },
            {
                原: "六五：箕子之明夷，利贞。",
                象: ["箕子之贞，明不可息也。"],
                析: "《宋世家》曰：纣为淫佚，箕子谏之不听。人或曰；可以去矣。箕子曰：谏不听而去，是彰君之恶，而自悦于民，吾不忍也。乃披发佯狂而为奴，遂隐而鼓琴。即此可见箕子之贞也。《彖传》曰，“内难而能正其志，箕子以之”，五爻居上卦之中，故属之箕子，上承《彖传》之意，以释“用晦”之义。《彖传》所谓“内难”者，以纣为同姓也；所谓“正其志”者，即“利贞”也。《象传》曰“明不可息”，谓《洪范·九畴》，其道万古常明，箕子能陈之于周，故虽暂夷而终必明也，是之谓“明不可息”也。",
                占:
                "【问时运】目下正当困厄，不失其正，久后必亨。\n" +
                "【问战征】主师不明，致有谋士逃亡之象。\n" +
                "【问营商】必历经艰苦，方可获利。\n" +
                "【问功名】时事日艰，不宜于进，只宜退守。\n" +
                "【问家宅】主亲族不和。\n" +
                "【问疾病】防有发狂之症。\n" +
                "【问婚姻】宜罢婚。\n" +
                "【问讼事】一时不直，久后自然明白。\n" +
                "【问六甲】生女。"
            },
            {
                原: "上六：不明晦，初登于天，后入于地。",
                象: ["初登于天，照四国也。后入于地，失则也。"],
                析: "上六居《坤》之极，为《明夷》一卦之主，是谓昏君，故“不明”而又加之曰“晦”，言昏之又昏者也。初“登天”，后“入地”，是始之自曜其明，卒之“明入于地”，为《明夷》之实象也。《彖传》所称文王箕子，其圣德之光明，岂不足以照四国？而当日文囚于羑里，箕佯狂为奴，正所谓入地者是也。故明夷之世，昏君在上，以入地者为用晦，登天者为失则。彼世之不审时势，而急求登进，光照未遍，而身败名灭，祸皆自取耳。必如文王之“柔顺”“《蒙》难”，箕子之“内难”“正志”，斯为善处明夷者矣。《明夷》六爻，皆教人以“用晦”之方，昏君之凶，不言可知。" ,
                占:
                "【问时运】初运虽好，后运不佳，万事宜作退一步想，方可无咎。\n" +
                "【问功名】宜晦藏遁迹，不宜自炫才华。\n" +
                "【问营商】货价初次太昂，落后太贱，显有天渊之隔，宜得其平。\n" +
                "【问战征】防攻山夺险，有坠入深渊之患。\n" +
                "【问婚姻】有先富后贫之嫌。\n" +
                "【问家宅】此宅面对高山，后临深渊，殊嫌地势低陷。\n" +
                "【问疾病】初患气冲，后又下泄，难治。\n" +
                "【问六甲】生女。"
            },
        ]
    },
    {
        x:"101011",//家人
        e:{
            原: "家人：利女贞",
            象: ["风自火出，家人。君子以言有物而行有恒。"],
            彖: ["家人，女正位乎内，男正位乎外，男女正，天地之大义也。家人，有严君焉，父母之谓也。父父，子子，兄兄，弟弟，夫夫，妇妇，而家道正，正家而天下定矣。"],
            析: "卦体《巽》上《离》下，《巽》木为风，《离》日为火。木燃生火，故木火相生，日气成风，故风日相成，皆由一气之鼓铸，犹人生一家之生育也。又火取其明，风取其和，伦纪修明，门庭和睦，取其象焉，故曰“风火家人”。且《家人》自《明夷》来，《明夷》之卦，当周兴商亡之际，周兴肇自太姒，商亡由于妲己，国运兴亡，基于家政，此《家人》所以继《明夷》也。\n" +
            "通观此卦，《说卦》曰，“万物齐乎巽，相见乎离”，“齐”者，即所以齐家，“见”者，即可推而见之于天下国家。《家人》卦体，《离》下《巽》上，取此义也。修齐之道，端赖明德，故象取《离》之明；江汉之化，始自宫闱，故象取风之顺，此卦所以名“风火家人”也。卦爻《巽》长女居上，四为《巽》主，以从五；《离》中女居下，二为《离》主，以从三。以阴居阴，各当其位；长上中下，各循其序；从三从五，各得其偶；外阳内阴，各司其职。君子则风火以为言行，修言行而垂家国。一家之中，夫制而妇从，内明而外顺，恩惠行，爱憎公，而后家可齐，而天下可定也。" ,
            占:
            "【问时运】风得火而愈狂，火得风而益炽，正是时运全盛之会，然入邪则邪，入善则善，言行之间，最宜加勉。\n" +
            "【问营商】《尔雅》云：“风与火为庉”，“庉”，聚也，有屯聚货物之象。爻辞曰“有物”“有恒”，物，货物，恒，恒久，谓其物不容急售，过后可获高价。\n" +
            "【问功名】风行远，火炎上，有高升远到之象；言行者，出身加民之具，功名可必。\n" +
            "【问家宅】防有火灾。\n" +
            "【问婚姻】《家人》一卦，象取夫妇，《离》火《巽》风皆女，或长女为姊，中女为娣之象，或为两姓对结之亲。吉。\n" +
            "【问疾病】是风火上升，痰多气喘之症，一时不治。\n" +
            "【问六甲】生女。"
        },
        ye:[
            {
                原: "初九：闲有家，悔亡。",
                象: ["闲有家，志未变也。"],
                析: "“闲”字，从门，从木，门内加木，所以防外也，故训为防。《易·文言》曰闲邪存诚，谓防闲其邪念，《论语》曰“大德不逾闲”，闲阑也，谓阑止其出入，皆取禁止防范之意。初爻处下卦之首，为《家人》之始。“有家”者，孟子谓“女有家”，是专指女子而言；“闲”者，如闺有范，女有箴，皆所以教诫之也。为女之始，先立其闲，使知所谨守，而不敢陨越，犹如蒙之必先养正也。若家渎而后严之，志变而后治之，则有悔矣。《象传》曰“志未变也”，谓其心志本明，未即邪欲，闲之于初，悔自亡也。" ,
                占:
                "【问时运】目下好运初来，正当自知检束，斯无灾悔。\n" +
                "【问战征】当行军之始，正宜整其步伐，严其号令，得以有胜无败。\n" +
                "【问营商】是初次贩运，宜恪守商规。\n" +
                "【问功名】是初次求名。宜遵公令，不得妄意干进。\n" +
                "【问家宅】此宅墙围坚固，门户肃睦，治家者有条有则，约束详明。至四年后，可致饶富。吉。\n" +
                "【问疾病】病是初起，宜自谨慎保养，必无灾害。初若不治，必致变症，则难治矣。\n" +
                "【问婚姻】当初订姻好，知是家风清白，闺门素谨，可成。\n" +
                "【问讼事】初讼罢之，则吉。\n" +
                "【问六甲】是初胎，生女。"
            },
            {
                原: "六二：无攸遂，在中馈，贞吉。",
                象: ["六二之吉，顺以巽也。"],
                析: "“无攸遂”者，谓妇道无成，事无专制也。二至四互《坎》，《坎》为酒食，故曰“在中馈”，谓朝夕以治饔飧，妇人之职也。二爻在妇妻之位，备中正之德，应九五《离》明之主，是能柔顺得正，以从事九五中正之夫者也。盖妇人之道，惟在奉祭祀、馈饮食而已，不得干预外事。《采苹》、《采蘩》两篇，皆美其能诚奉祭祀，可知妇职专在中馈，《礼》所谓“奉箕帚，操井臼”者是也。《彖传》曰“女正位乎内”，即指此爻。《象传》曰“顺以巽也”，按《象传》称“顺以《巽》”者有三：《蒙》之六五，谓事《师》之道；《渐》之六四，谓事君之道；此爻谓事夫之道。即孟子所云“以顺为正，妾妇之道”也。" ,
                占:
                "【问时运】目下正当大运，但爻象重阴，只宜因人成事，不能独断独行。\n" +
                "【问战征】此是偏将，必非主师，或是后营，主管粮食军饷，最为紧要，谨防勿失。\n" +
                "【问营商】想是贩运粮食生意，吉。\n" +
                "【问功名】难以遂意。\n" +
                "【问家宅】此宅朝南，宅主必是妇人，家事不能专断，惟灶基最吉。\n" +
                "【问疾病】幸胃口强健，可以无害。\n" +
                "【问六甲】生女。"
            },
            {
                原: "九三：家人嗃嗃，悔厉吉。妇子嘻嘻，终吝。",
                象: ["家人嗃嗃，未失也。妇子嘻嘻，失家节也。"],
                析: "“嗃”，《广韵》，“严厉貌”；《玉篇》，“严大声”。嗃从口，从高，谓大其声使人畏惮也。“嘻嘻”，《玉篇》，“和乐声”；嘻从口，从喜，谓和其声使人喜悦也。九三以阳居阴，处下卦之极，为一家之主，刚严过甚，过严则伤恩，未免有厉，是嗃嗃之过也；若嘻嘻则和乐无度，过和则害义，终必见吝。盖治家之道，严虽过其中，而要之家庭肃睦，咸知敬畏，自不即于非礼，故曰“厉，吉”；和则虽上下欢悦，而荒淫佚乐，流弊有不可胜言者矣，故曰“终吝”。《象传》以失不失对勘，谓和而终吝，不如厉而得吉也。" ,
                占:
                "【问时运】运限平平，终贵自勉，严谨刻苦，不自惮劳，当必获吉。若一味取乐，百事无成。\n" +
                "【问战征】号令严明，万军畏服，纵不免杀戮过甚之患，而所问自得成功。\n" +
                "【问营商】想是外作商店，内作住家，内外齐肃，家政严，店规谨，乃能获吉。否则，过和而流，将有名可问。\n" +
                "【问功名】爻象专在宜家，功名尚缓。\n" +
                "【问家宅】此宅家规严肃，吉。\n" +
                "【问婚姻】九三之应在上九，曰“有孚”，知两姓相从，吉。\n" +
                "【问疾病】九三属《离》为火，宜进凉剂，虽危得愈。\n" +
                "【问失物】宜严急查问，可得，若宽缓则失矣。\n" +
                "【问六甲】生女。"
            },
            {
                原: "六四：富家，大吉。",
                象: ["富家大吉，顺在位也。"],
                析: "《离》《巽》二卦，为二女，皆自《坤》生，《坤》为富，为财，又为户，有“富家”之象。六四以阴居阴，处上卦之首，与初相应，初曰“闲有家”，盖保家有法，克勤克勤，日积月累，‘至四面俨成富家也，故曰“富家，大吉”。《象传》曰“顺在位也”，二四皆为卦主。二爻“在中馈”，中馈掌烹饪，《离》之位也；四曰“顺在位”，顺，《巽》之位也。盖妇以顺从其夫，得以致富，自能不失其职位也。" ,
                占:
                "【问时运】目下正当盛运，已富者克保其家，未富者即发其财，大吉之象。\n" +
                "【问战征】国富兵强，粮饷充足，可进可退，吉无不利。\n" +
                "【问营商】“利市三倍”，立致富饶，吉可知也。\n" +
                "【问功名】官与财多相反，必须破财，乃可成名。\n" +
                "【问家宅】必是巨室阀阅之家，大吉。\n" +
                "【问讼事】财可通神，事无不了。\n" +
                "【问疾病】必是身体肥胖，膏梁过度所致，药之即愈。\n" +
                "【问六甲】生女。"
            },
            {
                原: "九五：王假有家，勿恤，吉。",
                象: ["王假有家，交相爱也。"],
                析: "九五王位，王者以天下为一家，故推极言之。“假”与格同，谓感格也。五爻刚健中正，位居至尊，与六四相比，与六二相应，四以顺在位，二以顺相从，顺则情性相通，缠绵固结，交相爱悦，假之所由来也。一家之中，父子兄弟夫妇，情意如一，王者家大人众，推之天下，无不各长其长，各幼其幼，所谓“王假有家”，假之至矣。“勿恤，吉”者，谓王者感化之神，勿用忧恤，而自无不吉也。盖初爻曰“闲有家”，以法度闲之，为家道之始；至五曰“王假有家”，假即假其闲家之善。王有家，是化家为国，化国为天下，为王者之家，家道之终也。一说假，大也。取“假哉天命”，谓大哉天命之义。“王假有家”，谓王者大，居正，故曰《大有》家。较四之富家而更进矣，其说亦通。" ,
                占:
                "【问时运】运来福至，人心自然感通，何忧不吉？\n" +
                "【问战征】王者之师，所向无敌。吉。\n" +
                "【问营商】想此商业，必是奉公谋办，或是贡献品物，为王家之业也，吉。\n" +
                "【问功名】恰如渭水付岩，有梦卜感通之象，吉。\n" +
                "【问家宅】此宅想是公卿巨邸，吉。\n" +
                "【问疾病】人身以心为君，五居《巽》木，必是肝木太强生风，心火生热。药宜熄火定风，使心气开通，可勿忧也。吉。\n" +
                "【问婚姻】有选入宫闱之象。\n" +
                "【问六甲】生女。"
            },
            {
                原: "上九：有孚威如，终吉。",
                象: ["威如之吉，反身之谓也。"],
                析: "上九居《巽》位之极，《巽》二阳一阴，上得乾气，《乾》为信，故“有孚”。《乾》又为威，故“威如”，且《巽》风善入，有威孚之义。离火可畏，有威严之象。合上下两体以成其爻，示人可因象以求义也。上与三应，三之“嘻嘻”，和而失节；上之“有孚”，则和顺而能感人也。三之“嗃嗃”，严近于厉；上之“威如”，则严正而若可望也。盖上为卦之终，教家之道，亦至上而成，故“终吉”。夫所谓正家者，其道不自家始也，家之本在身，先正其身，而家无不齐矣。君子不言而信，不怒而威，亦以诚之道感通之耳。《象传》曰“反身”，即《大学》所谓齐其家，在修其身之旨也。" ,
                占:
                "【问时运】得人信服，得人敬畏，事无不成，往无不利，可行于近，亦可行于远，万事皆吉。十年好运，过此而终。\n" +
                "【问战征】行车之道，有信则人不我欺，有威则人不我狎，赏罚无私，号令必行，王者之师也，故吉。\n" +
                "【问营商】有信则万金可托，有威则百务皆修，商道之正也。\n" +
                "【问功名】上爻处极位之地，必是身居上位，信义早孚，威望素著之大人也。\n" +
                "【问家宅】此宅地位必高，为一乡之望也。吉。\n" +
                "【问婚姻】两姓允从，吉。\n" +
                "【问六甲】生女。"
            },
        ]
    },
    {
        x:"110101",//睽
        e:{
            原: "睽：小事吉",
            象: ["上火下泽，睽，君子以同而异。"],
            彖: ["睽，火动而上，泽动而下，二女同居，其志不同行。说而丽乎明，柔进而上行，得中而应乎刚，是以小事吉。天地睽而其事同也，男女睽而其志通也，万物睽而其事类也。睽之时用大矣哉！"],
            析: "卦体上《离》下《兑》，《离》火炎上，《兑》泽渗下，火动而愈上，泽动而愈下，上下相违，曰《睽》。《睽》字从目，从癸；《离》为目，癸属水，泽亦水也，《六书》故曰“反目为睽”。睽，乖也，盖泽在火上，泽火相济而成《革》，泽在火下，火泽相反而成《睽》，此火泽之卦所以名《睽》也。\n" +
            "通观全卦，火上泽下，上者动而愈上，下者动而愈下，背道而驰，不得相同，卦之所以谓《睽》也。卦体下互重《离》，多视伤明，为《睽》；上互《坎》，《坎》为心病，人各有心，孚则通，疑则《睽》。情莫亲于《家人》，《睽》则为恶人，为鬼，为寇，或劓之，或射之，而不以为过。下苟能悦以事上，上亦能明以视下，则疑释而情亲，即化而为夫，为宗，为婚姻，而不以为嫌。前之相疑若此其甚，后之相合又若此其切，《睽》合之机，即在此转移间耳。是以《睽》在内卦，皆疑而有待，《睽》在外卦，皆反而有应。初与四应，初之“丧马”，得四之“元夫”而全；二与五应，二之巷遇，得五之“噬肤”而合；三与上应，三之“舆曳”，得上之“遇雨”而合。合则恶人化为同室，《睽》则《家人》疑为寇仇，恩怨反复，变态无常。君子以无心应物，不党同，亦不伐异。初九见恶人而避咎，为能得用《睽》之道也。卦体二阴本柔，内以悦而宽其忧，外以明而破其疑。所以始《睽》者，“二女同居”也；所以终合者，群疑悉化也。卦《睽》而象合，《易》所以变化不穷也。" ,
            占:
            "【问时运】目下气运颠倒，惟宜正以处之。\n" +
            "【问战征】军情不协，上下异趣，宜防《睽》散。\n" +
            "【问功名】上下不通，功名难望。\n" +
            "【问营商】货价上落悬殊，能以人弃我取，尚有小利可望。\n" +
            "【问疾病】病在上下焦，胸气隔绝，上有火，下有湿，医治棘手。\n" +
            "【问家宅】此宅天盘地盘皆动，阖家上下不利，急宜迁避。\n" +
            "【问婚姻】有二女皆愿受聘，大者性躁急，小者性宽柔。择而娶之。\n" +
            "【问讼事】即可罢散。\n" +
            "【问六甲】生女。"
        },
        ye:[
            {
                原: "初九：悔亡。丧马勿逐自复。见恶人，无咎。",
                象: ["见恶人，以避咎也。"],
                析: "初居《兑》体之下，自《家人》上爻来，《家人》上曰“终吉”，故《睽》初曰“悔亡”。爻属《震》，辰在卯，上值房，房为天驷，故称“马”；初动而上，舍我而去，故云“丧”。然四与初同德，他无正应，姑听其去，势必复来，故云“勿逐，自复”。下互《离》，《离》性猛烈可畏，故曰“恶人”。《兑》为见，《离》亦为见，是《离》之恶人既来求见，《兑》若拒而不见，未免嫉之太甚，必致咎也。《兑》姑与之相见，如阳货欲见孔子，孔子以礼往拜之旨也，故得“无咎”。盖失马而逐之，愈逐愈逸，见恶人而激之，愈激愈乖，是以“勿逐”而“自复”，“见恶人”而不避，可以免咎矣。能以无心而应物，则《睽》无不合也。《象传》曰“以避咎也”，盖不以避为避，避而有咎，则以不避为无咎可知也。" ,
                占:
                "【问时运】好运初来，灾悔已退，虽有丧失，不必计虑，即有恶人来侵，不必拒绝，自然无咎。\n" +
                "【问战征】初次开战，虽有小败，后必大胜，强敌亦不能害我也。无咎。\n" +
                "【问营商】新作贸易，失而必复，无须忧虑也。来者不拒，无须计较也。目下未见尽利，后必大亨。\n" +
                "【问功名】现下虽无灾悔，未得成名，必待明年，至二爻得其巷遇，斯获显达。\n" +
                "【问家宅】阉宅平顺，无悔，无咎。\n" +
                "【问失物】不必寻觅，自得。\n" +
                "【问婚姻】现下未成，待到六月，或到六年，必就，吉。在上九“非寇，婚媾”之辞。\n" +
                "【问讼事】所讼必直，无咎。\n" +
                "【问六甲】生女。"
            },
            {
                原: "九二：遇主于巷，无咎。",
                象: ["遇主于巷，未失道也。"],
                析: "“主”者，君也，指六五而言；“巷”，里中道，从邑，从共，谓里中所共往来者也。二处《睽》失位，所如不合，与五正应，二居《兑》中，五居《离》中，《兑》《离》皆为见，知二五均有相见之意，邂逅于巷，是不期遇而适相遇也。君臣相遇，《睽》而终合，咎何有焉？《象传》曰“未失道也”，谓不假远涉，自得相遇于巷；巷，道路也，即《论语》所谓“遇诸途”者是也。" ,
                占:
                "【问时运】卦值乖《睽》，运本不佳，近始得有绝好际遇，往必有庆。\n" +
                "【问战征】二五相敌，内为我兵，五为敌兵，曲巷相遇，白刃相接，此战未分胜负。\n" +
                "【问营商】巷字从共，必是合伙共谋之业，当有一财主相遇，共为经营之象。\n" +
                "【问功名】正是风云际遇之时。\n" +
                "【问家宅】此宅在曲巷之内，近有贵人来会，相晤为欢，大庆。\n" +
                "【问疾病】得遇良医，无咎。\n" +
                "【问婚姻】《诗》所咏“邂逅相遇，适我愿兮”，此男妇私情，非正配也。\n" +
                "【问六甲】生女。"
            },
            {
                原: "六三：见舆曳，其牛掣。其人天且劓，无初有终。",
                象: ["见舆曳，位不当也。无初有终，遇刚也。"],
                析: "上互《坎》，《坎》为舆，下互《离》，《离》为牛。“无初有终”，遇刚也。《离》亦为见，上下互《既济》，《既济》初有曳轮之辞，故曰“见舆曳”。“掣”，掣曳也，即牵掣之意。“舆”指三，“曳”指四，“掣”指二。三居上下之交，其位不当，四曳之，二掣之，是曳其舆于前，又掣其牛于后也。“天”，胡氏安定谓“天当作而”，篆文而与天字形似，即礼“髡刑曰而”。“劓”，截鼻也，发属心而主火，鼻属肺而主金，此爻《兑》金值《离》火，金火相克，故有发鼻受伤之象。《兑》为刑人，故曰其人“天且劓”。三爻处下卦之终，当《睽》违之时，以阴居阳，履非其位，与上相应；上居《离》极，《离》火性烈，不合则相伤，合则相得，遇雨疑亡，《睽》终合矣，故曰“无初有终”。《象传》曰“遇刚也”，刚指四，即上之“遇雨”也；四互《坎》，《坎》为雨，四又中立不倚，故曰“刚”，谓四能释上之疑，使之终合也。" ,
                占:
                "【问时运】运不得当，恐有刑伤之灾；三年后，得有好运。\n" +
                "【问营商】与人不合，非特不能获利，防有刑狱之厄，待后可成。\n" +
                "【问功名】左掣右肘，动辄得咎，安能成名？晚运则佳。\n" +
                "【问战征】车脱马逸，兵败将亡，不能前进，必待应军得力，得以始败终胜。\n" +
                "【问婚姻】初因男家疑忌，未免受辱，终得疑释完婚。\n" +
                "【问家宅】此宅地位不当，前后左右，皆有牵制，宅中之人，时有头面伤残之祸，以朝山向午，《离》火来克。宜改向朝西《兑》位，乃吉。\n" +
                "【问疾病】必是面上有疮，久后自愈。\n" +
                "【问讼事】不免刑厄，终则自解。\n" +
                "【问失物】后可寻得。\n" +
                "【问六甲】生女，防面有伤痕。"
            },
            {
                原: "九四：睽孤，遇元夫。交孚，厉无咎。",
                象: ["交孚，无咎，志行也。"],
                析: "四居《离》卦之始，《离》为目，《说文》“目不相视为睽”。“孤”，谓独立无辅也。其情既《睽》，其势又孤，故曰“睽孤”。“元夫”指初，四与初所处之时，同在《睽》也，所居之位，同在始也，其象同，故其志同。四以无应，得初为同志，初在卦首，故称“元”；四阴位，初阳位，故四以初为夫；且初《震》爻，《震》为元夫，故曰“遇元夫”。四变《损》，《损》曰“有孚”；四之五为《中孚》，《中孚》五爻曰“有孚挛如”，有交孚之象焉，故曰“交孚”。“厉，无咎”，谓时当《睽》乖，幸而得孚，虽厉无咎。《象》以“志行”释之，谓四之志，得此“交孚”，乃可行也。" ,
                占:
                "【问时运】性情孤介，不合时宜，幸得同志，差足免咎。\n" +
                "【问战征】孤军深入，几致危殆，幸而获救，可以无咎。\n" +
                "【问营商】孤客远行，货物不合销路，进退两难，得遇故乡旧友，方可脱售，平安无咎。\n" +
                "【问功名】命运孤寒，难望显达，无咎而已。\n" +
                "【问家宅】宅在孤村僻壤，惟有樵夫野老来往而已。\n" +
                "【问疾病】病是目疾，得遇良医，可以无咎。\n" +
                "【问六甲】生女。"
            },
            {
                原: "六五：悔亡。厥宗噬肤，往，何咎？",
                象: ["厥宗噬肤，往有庆也。"],
                析: "五居君位，时当《睽》乖，故有悔。“宗”指二，五与二应，五处《离》中，二至四为《离》，《离》与离合，是宗也。二曰“遇主”，以五为主，五曰“厥宗”，以二为宗，是君臣会合，故“悔亡”。二动体《噬嗑》，《噬嗑》二爻曰“噬肤”、“无咎”，按肤谓肤肉，为柔而易噬。嗑，合也，二居柔位，犹言柔而易合。肤肉，犹骨肉也，盖指“厥宗”而言。大宗伯以饮食之礼亲宗族兄弟，即此“厥宗噬肤”之义也。二往得食，故“有庆”。合族以食，复何《睽》？二五“交孚”，故“悔亡”而无咎。" ,
                占:
                "【问时运】劣运已退，得与同宗共事，可以无咎。\n" +
                "【问战征】可勇跃前往，无咎。\n" +
                "【问营商】防合伙者有侵食之患，然径行而往，终得有利。\n" +
                "【问功名】得有同宗相助，乃能获庆。\n" +
                "【问家宅】此宅是宗族旧屋，往居有庆。\n" +
                "【问疾病】是肌肤之疾，易治也。\n" +
                "【问婚姻】二与五为正应，是亲戚旧家，成则有庆。\n" +
                "【问六甲】生女。"
            },
            {
                原: "上九：睽孤。见豕负涂，载鬼一车，先张之弧，后说之弧。匪寇婚媾，往遇雨则吉。",
                象: ["遇雨之吉，群疑亡也。"],
                析: "上居外卦之极，孤高独立，故亦称“睽孤”。上互《坎》，为疑，为豕，为车，为鬼，为孤，皆《坎》象也。《离》为目，为见。《兑》泽污下，象途泥。因《睽》成孤，因孤生疑，本未尝有豕也，未尝有鬼也，未尝有车也，《睽》则目视不明，而疑心暗起，若见有豕之负涂焉，若见有车之载鬼焉，积疑成象，变端百出。疑鬼者，忽又疑为寇焉，则将张《离》之弧而射之，既而谛审所见，先所见豕邪、鬼邪、寇邪，忽又变矣；上变《归妹》，则“婚媾”也，先之张弧，后即脱之矣。《坎》又为雨，故曰“遇雨”。上处《离》极，火烈烟腾，不可向迩，遇雨则火熄，可以往也，故曰“往，遇雨，则吉”。《象》以“疑亡”释之，谓群疑消亡，见闻皆真，睽孤自合矣。" ,
                占:
                "【问时运】正当交运脱运之时，切宜息心定虑，毋动妄想，妄想一端，幻形百端，防生疑病。\n" +
                "【问战征】营位太高，军力太孤，防有疑兵来袭。\n" +
                "【问营商】目下货价，变迁百出，上落不一；时当盛夏，来客稀少，必待秋雨一通，可以获利。\n" +
                "【问功名】现在牛怪蛇神，变动不一，待十年后，出《蹇》入《解》，可许发解。\n" +
                "【问婚姻】前因疑忌不睦，后得完好，吉。\n" +
                "【问家宅】此宅有变，防有鬼祟，遇婚嫁喜事，可以解释。\n" +
                "【问疾病】杯弓蛇影，因疑成病，得破其疑，病自霍然。\n" +
                "【问六甲】生女。"
            },
        ]
    },
    {
        x:"001010",//蹇
        e:{
            原: " 蹇：利西南，不利东北，利见大人，贞吉。",
            象: ["山上有水，蹇，君子以反身修德。"],
            彖: ["蹇，难也，险在前也。见险而能止，知矣哉。蹇利西南，往得中也。不利东北，其道穷也。利见大人，往有功也。当位贞吉，以正邦也。蹇之时用大矣哉！"],
            析: "《序卦传》曰：“睽者，乖也。乖必有难，故受之以蹇。蹇，难也。”《蹇》与《睽》不相对而适相似：《离》在上，《兑》在下，泽欲润而火自上燥之，用相反也，故为《睽》；《坎》在上，《艮》在下，水欲流而山自下止之，用相阻也，故为《蹇》。此《蹇》之所以继《睽》也。\n" +
            "通观此卦，卦体以《坎》上《艮》下为《蹇》，易位则为《蒙》。《蒙》《象》曰“山下出泉”，泉之初出，贵养之以正；《蹇》《象》曰“山上有水”，水之有险，贵往之得中。得中则知险，知险则知往，知往则能知利与不利，而所往不误，斯《蹇》可济矣。自来处蹇而能用《蹇》者，惟在“当位”“贞吉”之“大人”，下此有事于蹇者，皆当“利见”夫“大人”。所谓“大人”者，即指爻中之九五也。五爻又知《蹇》非独力所能济，五与二应，是以五曰“大蹇”，二曰“蹇蹇”，孜孜矻矻，以共济艰难，惟恐少后。盖五者君之道，民之危，犹己之危也；二者相之道，君之忧，犹己之忧也。以身任天下之重者，固当如此也，若徒效保身之哲，踏河入海，措世事于无闻，则有能力济此蹇乎？即在初、三、四、六，均有世道之责，或返而安，或速而济，或见而“硕”，俱欲举天下而治之。在“来誉”之贤，犹冀其有待，圣人之不能忘天下，固如是其至也。然天下非一人之事，济天下非一人之力所能。君必纲罗人材，以收群策群力之效；臣必靖共尔位，以尽为羽为翼之功。然济蹇者才，而所以济蹇，尤在夫德，《象传》曰“君子以反身修德”，有其德则自足化险，自足以靖难。《明夷》《传》曰，“以蒙大难，文王以之”，此可见文王之德之纯也。文王为西南之吉，《彖》曰“利西南”，其以此也夫。" ,
            占:
            "【问时运】运当艰难，宜加奋勉，方可出险。\n" +
            "【问战征】入山穷水，复杂之地，进退两难，宜率六军，戮力向西南进攻，方可获利。\n" +
            "【问功名】坎险《艮》止，功名有阻，返身加勉，五年后至上爻，《象》曰“利见大人，以从贵也”，成名可望。\n" +
            "【问营商】水在山上，则水蓄而不流，有财不流通之象，营商者难之。\n" +
            "【问家宅】此宅傍山，防有山上来水冲落，致损墙屋，宜改易其朝向，乃利。\n" +
            "【问婚姻】山水本两相为偶，山下水高则为失偶，故有《蹇》。不成则已，成亦必有反悔。\n" +
            "【问疾病】《蹇》为足疾，涉水登山，必不能往行也。\n" +
            "【问失物】宜反从身上寻之。\n" +
            "【问讼事】宜自返而罢讼，吉。\n" +
            "【问行人】被中途发水所阻，大有险难，他日空身可归。\n" +
            "【问六甲】生男。"
        },
        ye:[
            {
                原: "初六：往蹇来誉",
                象: ["往蹇，来誉，宜待也。"],
                析: "初爻居《艮》之下，当《蹇》之始，“往蹇”者，往就《蹇》地。在初去上《蹇》犹远，可以不往，乃不避险阻，敢于犯难。在六爻之初，能首倡赴义，开“朋来”之先，声闻嘉誉。《象传》曰“宜待也”，以为轻身尝试，徒博一时之誉，不如审机观变，待时而动，斯得济蹇之实功也。" ,
                占:
                "【问时运】好运未来，宜谨守以待。\n" +
                "【问战征】有险在前，未可进往，宜暂退守。\n" +
                "【问营商】售卖之处，适有危，不可贩货前往，须暂时待价。\n" +
                "【问功名】从军效力，皆冒险犯难，获邀奖赏，故曰“来誉”。\n" +
                "【问家宅】地位险阻，迁居不利。\n" +
                "【问疾病】在初起，不必急往求医，宜退而自养。\n" +
                "【问婚姻】不必急就，还宜待。吉。\n" +
                "【问失物】缓之可得。\n" +
                "【问六甲】生男。"
            },
            {
                原: "六二：王臣蹇蹇，匪躬之故。",
                象: ["王臣蹇蹇，终无尤也。"],
                析: "“王”指九五，“臣”指六二，二居下卦之中，上应九五，爻互重《坎》，故曰“蹇蹇”，谓其涉《蹇》以济《蹇》，有鞠躬尽瘁之忱。诸爻皆言往，犹为国难而往赴之，二则直以国事为己事，犯其难而不顾也。《象传》以“终无尤”释之，谓其能致身事君，夫复何尤。" ,
                占:
                "【问时运】目下气运尴尬，险难重重，主一身劳碌。\n" +
                "【问战征】防军入险地，身被重围，有庞士元落凤坡之象。\n" +
                "【问营商】为内地运货，中途被水，有人财两失之患。\n" +
                "【问功名】为急公求名，名成而身莫保，邀身后之荣。\n" +
                "【问家宅】此宅在艮山之中，向朝东北，险既重，不利。\n" +
                "【问婚姻】二应五，主结贵亲；防后日夫君有难，身命难保。\n" +
                "【问讼事】凶。\n" +
                "【问行人】凶。\n" +
                "【问失物】终不可得。\n" +
                "【问六甲】生男。"
            },
            {
                原: "九三：往蹇来反",
                象: ["往蹇，来反，内喜之也。"],
                析: "三爻居内卦之上，为《艮》之主，当上下之交，与《坎》为邻。“往蹇”者，谓往赴五之“大蹇”。五以三阳当位，使之“来反”，以治其内。三本见险而止，喜退而不喜往也，其往也，为迫于诸爻，故同往；其返也，为得自全，故有喜。三动变为《比》，《比》二曰“比之自内”，故《象》以“内喜”释之。" ,
                占:
                "【问时运】运值多难，前进不利，不如退守。\n" +
                "【问战征】有军出》旋师之象。\n" +
                "【问营商】有去而不来，贩货复回，转销内地之象。\n" +
                "【问功名】为出使在外，改为内用。\n" +
                "【问家宅】此宅后靠山，前临水，初欲他迁，后复归来，得以团聚为喜。\n" +
                "【问婚姻】前欲他适，后得归来，可喜。\n" +
                "【问行人】即日来，喜。\n" +
                "【问失物】失而复得。\n" +
                "【问六甲】生男。"
            },
            {
                原: "六四：往蹇来连",
                象: ["往蹇，来连，当位实也。"],
                析: "四居上卦之首，比近于五，五所倚重，是为亲近之臣。“连”者，谓君臣一体，如心腹股肱之相联系也。“往蹇来连”，谓三与上为正应，故与上同往，最为联合，比初之往而有待，三之往而复反，较为得其实力也。《象》曰“当位实也”，四当位履正，《艮》为实，故曰“实”。上既比连尊爻，下又联络诸爻，得以实心实交以济蹇难也。" ,
                占:
                "【问时运】运多蹇险，以其能联合众心，得以济险。\n" +
                "【问战征】四爻阴柔，可知军力单薄，以其能与众军同心同德，联络一气，乃可出险。\n" +
                "【问功名】“来连”者，有连升之象。\n" +
                "【问营商】“来连”者，谓先后商客，皆相连而来；曰“当位实也”，“实”，充实，谓得赢满也。\n" +
                "【问家宅】此宅必与邻屋比连，地位相当，家道殷实。\n" +
                "【问婚姻】必是老亲结亲，重联订好，吉。\n" +
                "【问疾病】此病必连绵已久，一时不愈。\n" +
                "【问讼事】迟久可了。\n" +
                "【问行人】流连在外，一时不归。\n" +
                "【问六甲】生男，想是孪胎。"
            },
            {
                原: "九五：大蹇朋来",
                象: ["大蹇，朋来，以中节也。"],
                析: "就诸爻言则为“往”，就五爻言则为“来”，在诸爻则《蹇》犹小，在五爻则《蹇》独大，盖五爻合诸爻之蹇以为《蹇》，而独当《蹇》之大者也，故曰“大蹇”。君臣以义合，朋友以情合，五略分言情，故喜其来而称之谓“朋”。五盈满当位，德足任人，故能使疏附后先，咸来辅翼，得藉群才以济“大蹇”。其济也，虽出于君之威福，而诸臣要与有力焉。五动体《坤》，《坤》“西南得朋”，“蹇利西南”，故亦曰“朋”。《象》以“中节”释之，谓五得位履中，不易其节，故卒得出蹇也。" ,
                占:
                "【问时运】厄运将退，渐得化危为安。\n" +
                "【问战征】前既被围，今幸得救兵齐来，得以一战出围。\n" +
                "【问功名】位近至尊，足以匡济，大荣，吉。\n" +
                "【问营商】众货辐辏，一时难以脱售。\n" +
                "【问家宅】地近禁卫，当冲击疲难之区，车马纷逐之会，不宜民居，可改作会馆议院。\n" +
                "【问疾病】此是危难大症，宜集众医会治，方可望愈。\n" +
                "【问六甲】生男。"
            },
            {
                原: "上六：往蹇来硕，吉。利见大人。",
                象: ["往蹇，来硕，志在内也。利见大人，以从贵也。"],
                析: "上爻居《蹇》之极，躬处局外，本为《蹇》难所不及，爻曰“往蹇”，盖贤人君子，心切时艰，不敢以身不当位，置理乱于不闻也。“硕”，大也，“来硕”者，五得其相助为理，即以大任任之，如莘野渭滨之出而匡时者也，故曰“来硕”。《蹇》诸爻皆在蹇中，未尝言吉，至上爻，其《蹇》已终，故称“吉”。“大人”指五也，君臣同德，五爻以臣谓朋，上与五以君谓大人，盖即《彖传》所谓“利见大人，往有功也”。《象》以“志在内”释“来硕”，谓上之应在三，故“志在内也”。以“从贵”释“利见”，谓上之阴从阳，故曰“以从贵也”。" ,
                占:
                "【问时运】现下大难已退，大运将来，可以出面求仕。\n" +
                "【问战征】大兵已集，可以一战，以出重围。\n" +
                "【问营商】众商咸来，货价大涨，即此脱售可复本，亦可获利。\n" +
                "【问功名】文名大振，可以“利见大人”。\n" +
                "【问家宅】此宅地位高大，灾煞已退，吉曜照临，且得贵人扶助。\n" +
                "【问婚姻】主贵。\n" +
                "【问讼事】须从大审院判结。\n" +
                "【问六甲】生男。"
            },
        ]
    },
    {
        x:"010100",//解
        e:{
            原: " 解：利西南。无攸往，其来复吉。有攸往，夙吉。",
            象: ["雷雨作，解，君子以赦过宥罪。"],
            彖: ["解，险以动，动而免乎险，解。解利西南，往得众也。其来复吉，乃得中也。有攸往，夙吉，往有功也。天地解而雷雨作，雷雨作而百果草木皆甲坼，解之时大矣哉！"],
            析: "卦体下《坎》上《震》，《震》为雷，《坎》为水，亦为雨，《震》《坎》交错，即成雷雨交作之象。《坎》于时为冬，《震》于时为春，自冬涉春，雨水乍来，春雷始发，和风送暖，坚冰渐解，天地郁结闭塞之气，一经雷雨鼓动，枯者生，蛰者起，无不解散而萌发也，故名其卦，曰雷水《解》。\n" +
            "通观此卦，《解》与《屯》易位。《屯》《震》生在下，《坎》难在上，“动乎险中”，为难之始生，其《象》曰“云雷”，是天气郁结而未能发泄也，故不成雨；《解》《坎》难在下，《震》生在上，动免乎险，为难之已解，其《象》曰“雷雨”，是天气发泄，而恩威并施也，故曰“雷雨作”。《解》之卦义，其为难者，《坎》也，阴也，其难解者《震》也，阳也。初爻以其始解而安之；二爻就其获解而治之；三爻防其方解而复致之。内三爻属《坎》，《坎》，阴也，故不言《解》。四爻之《解》，得朋为助；五爻之《解》，以孚得吉；上爻之《解》，以“用射”获利。外三爻属《震》，《震》，阳也，故言《解》。统之难之作也，靡不由于小人，而其《解》也，靡不由于君子。五为《解》之主，《象》曰“君子有解，小人退也”，所谓“君子”，即《大象》所称“赦过宥罪”之“君子”也。此为《解》一卦之要领也。" ,
            占:
            "【问时运】灾难解脱，大有奋发振作之象。\n" +
            "【问战征】威武一振，有大寇翦灭，小寇服从之象。\n" +
            "【问功名】有声震百里，泽被群生之兆。\n" +
            "【问营商】得时得令，“雷雨之动满盈”，大利。\n" +
            "【问婚姻】《震》雷《坎》雨，阴阳交济，生育畅茂，吉。\n" +
            "【问家宅】天盘有动，地盘有难，宜祈祷解免\n" +
            "【问行人】一时可归，防小有灾难，无咎。\n" +
            "【问讼事】幸得宽宥无罪。\n" +
            "【问六甲】生男。"
        },
        ye:[
            {
                原: "初六：无咎",
                象: ["刚柔之际，义无咎也。"],
                析: "初居《解》之始，大难初平，不求有功，只求无咎。初与四应，赖应之力，得解其险，故曰“无咎”。《象传》所谓“刚”者，指四，“柔”者指初，“际”者，谓初与四相应，阴阳相交，其义自可无咎也。" ,
                占:
                "【问时运】困难初解，安时守分，自得无咎。\n" +
                "【问战征】乍脱重围，宜自蓄锐养精，不可妄动，得保无咎\n" +
                "【问营商】不致耗失，亦为幸矣。\n" +
                "【问功名】目下只可守旧而已。\n" +
                "【问家宅】平安无害。\n" +
                "【问讼事】宜和。\n" +
                "【问婚姻】平平。\n" +
                "【问六甲】生男。"
            },
            {
                原: "九二：田获三狐，得黄矢，贞吉。",
                象: ["九二贞吉，得中道也。"],
                析: "“田”者，猎也。上互《坎》，《坎》为狐，下互《离》，《离》为黄矢。狐阴兽，善惑人，故譬言妄邪小人，蛊惑君聪。“三”者，言数之多也。“黄”者，正色；“矢”者，直也。二爻以阳居阴，刚柔得中，上与六五，阴阳相应，为能辅佐大君，进贤黜邪，用以匡济时艰者也。盖欲解难，当先驱狐，故取《离》之矢，就《坤》之田，获《坎》之群狐而尽歼之，斯内治肃靖，于以济险出危，纳一世于中道，其在此矣，是以九二“贞吉”也。" ,
                占:
                "【问时运】去邪归正，自得安吉。\n" +
                "【问战征】“田”者猎兽，犹战之猎敌也。获狐者，犹获敌之渠魁也。得矢者，犹得敌之兵器也。故“贞吉”。\n" +
                "【问营商】“田”者在猎兽，商者在猎利，“三”者多数，“黄”者黄金。必获厚利，吉。\n" +
                "【问功名】曰“获”，曰“得”，功名可望，吉。\n" +
                "【问家宅】此宅防有狐祟，须猎获之，乃吉。\n" +
                "【问婚姻】此必先有小妾，而后纳正室也。黄者正色，为正配，吉。\n" +
                "【问疾病】防是狐媚邪病，宜张弧矢以驱之，吉。\n" +
                "【问六甲】生男。"
            },
            {
                原: "六三：负且乘，致寇至，贞吝。",
                象: ["负且乘，亦可丑也。自我致戎，又谁咎也。"],
                析: "“负”者，窃负，“乘”者，乘肥，“负且乘”，是窃盗而公卿也，故“可丑”。“致寇至”者，《坎》为寇。六三处《坎》体，本寇也，寇以遭时窃位，得以策肥乘坚，为寇者见之，曰彼亦寇也，今居然“负且乘”矣，是可取而代之也。此谓以寇名寇。当此险难甫解，而使寇者滥居高位，岂非用人者之咎乎？故曰“自我致戎”，咎复何辞？“吝”，即丑也。" ,
                占:
                "【问时运】运非不佳，但因素行不端，为人鄙笑。\n" +
                "【问战征】战隙自我而开，以致群盗纷起，一时难平。\n" +
                "【问营商】防有盗劫之患。\n" +
                "【问功名】沐猴而冠，其能久乎？\n" +
                "【问家宅】门户不自谨慎，或用人不当，致招窃盗。\n" +
                "【问婚姻】两姓均非端正之家，是富而不仁者也，“可丑”\n" +
                "【问讼事】两造理皆不直。\n" +
                "【问行人】满载而归，但来路不正。\n" +
                "【问失物】已被窃负盗去，不得。\n" +
                "【问六甲】生男。"
            },
            {
                原: "九四：解而拇，朋至斯孚。",
                象: ["解而拇，未当位也。"],
                析: "四居《震》之始，《震》为足，“拇”，足大指也。四为《解》之主，《解》即解其蹇也。蹇为足疾，疾在一拇，不足以为《蹇》，解在一拇，亦不成其为《解》。四不当位，故不能全解其蹇，第见“解尔拇”，“拇”，即指四而汝也，故曰“尔拇”。《解》之四，即从《蹇》五来，《蹇》五曰“朋来”，故《解》四曰“朋至”。四亦自知其不能解蹇，惟望“朋至”，得以相助为理。将由拇以及心，斯心心相感，而《蹇》得全《解》矣。《坎》为孚，故曰“孚”。" ,
                占:
                "【问时运】行年已当强仕，但行运不当，全在因人成事\n" +
                "【问战征】防炮弹伤足，幸救兵得力，可以解围。\n" +
                "【问营商】所获甚微，惟众心交孚，一二年后，可望厚利。\n" +
                "【问功名】拇为足指，卑下已极，至五爻日“君子维有解”必待下科，可望登榜。\n" +
                "【问家宅】此宅地低下，不得其当，只可作行栈店屋。\n" +
                "【问婚姻】得有力媒人说合，方可成事。\n" +
                "【问讼事】有朋友出，交相解劝，得可息讼。\n" +
                "【问六甲】生男。"
            },
            {
                原: "六五：君子维有解，吉。有孚于小人。",
                象: ["君子有解，小人退也。"],
                析: "此“君子”，即《大象》所云“赦过宥罪”之“君子”也。五居尊位，与二相应，二既能得其中道，以祛群邪，许其更新，五即因之，原情赦宥，不复穷究，是以不解为《解》者也，小人遂感而有孚，是以吉也。《象传》曰，“君子有解，小人退也”，谓君子不必力去小人，小人自心服君子，不敢与君子同居。自古奸邪害政，皆由君子不能感化小人，小人是以不信服君子，以致倾轧。覆辙相寻，皆未明六五“有解”之旨也。" ,
                占:
                "【问时运】正运亨通，群邪悉退。\n" +
                "【问战征】不戮一人，不加一矢，外夷来服。\n" +
                "【问功名】利君子，不利小人。\n" +
                "【问营商】不劳苦计营谋，自然获利。\n" +
                "【问家宅】此宅福曜照临，邪魔远避。\n" +
                "【问婚姻】吉。\n" +
                "【问行人】即归。\n" +
                "【问疾病】外邪解散，正气来复，吉。\n" +
                "【问讼事】理直者胜，理曲者服，即可罢讼。\n" +
                "【问六甲】生男。"
            },
            {
                原: "上六：公用射隼于高墉之上，获之，无不利。",
                象: ["公用射隼，以解悖也。"],
                析: "《震》为诸侯，故称“公”；《坎》为弧，为弓，故曰“射”。卦体上互《离》，《离》为飞鸟，故有隼象；四动而成《坤》，《坤》为城墉，象城墉之上。上爻居《解》之极，自初至五，凡用刚，用柔，用猛，用宽，所以解除内难，亦既备矣，至上犹有飞翔在外，如鸷鸟之强悍者，五乃命六曰：公其乘《坤》之墉，张《离》之弧，抽一矢而射之，获其魁首，无不利也，以解悖也。《坎》为悖，谓灭此悖逆之徒，斯内患外寇，悉皆扫平矣。前诸爻，即《彖》所云“其来复吉”；上爻乃《彖》云“有攸往，夙吉”是也。" ,
                占:
                "【问时运】运途吉顺，出外或遇小寇，宜急防之。\n" +
                "【问战征】防有敌兵劫掠城外，宜高阜伏矢以射之，必有获也。\n" +
                "【问营商】运货出外，防有盗劫，宜严备御，非特无失，且可以获盗粮也，故曰“无不利”。\n" +
                "【问功名】爻称公，必已贵显也，当立功于外。\n" +
                "【问家宅】墉墙宜高，可备外窃。\n" +
                "【问婚姻】《诗》云“弋凫与雁”，有射之象，吉。\n" +
                "【问讼事】悖逆自解，利。\n" +
                "【问六甲】生男。"
            },
        ]
    },
    {
        x:"110001",//损
        e:{
            原: " 损：有孚，元吉，无咎，可贞。利有攸往，曷之用，二簋可用享。",
            象: ["山下有泽，损。君子以惩忿窒欲。"],
            彖: ["损，损下益上，其道上行。损而有孚，元吉，无咎，可贞，利有攸往。曷之用二簋，可用享。二簋应有时，损刚益柔有时。损，益，盈，虚，与时偕行。"],
            析: "卦体上山下泽，山高也，高者愈高，谓之益上；泽卑也，卑者愈卑，谓之损下。故下不可损，损在下而益在上，谓之《损》；下本当《益》，《益》在下而《损》在上，谓之《益》。《损》《益》之理固相反，而《损》《益》之用适相济。人第知其《损》也，而不知《益》即益其《损》；人第知《益》也，而不知《损》即损其《益》。是以《序卦》先《损》而后《益》。事先简而后烦，礼先俭而后奢，物先虚而后盈，故《易》道先《损》。损《兑》益《益》，所以为《损》。\n" +
            "通观全卦，卦下体，本《乾》三画皆刚，为有余而当损也；上体本《坤》三画皆柔，为不足而当益也，谓之“损下益上，其道上行”。《损》《益》为盛衰之机，亦即为《否》《泰》之兆。《损》自《泰》来，《益》自《否》来，《损》二五失位，《益》二五得位，可以见《否》《泰》之相反也。《损》《兑》有余，补《艮》不足，上下相洽，止悦相承，是以《益》卦不待孚而民悦，《损》卦必先孚而乃吉。以《损》为人情所不欲，然人情固忧缺乏而求盈，君子则恶盈满而思节。“二簋”虽薄，可享宗庙，道在以诚为贵耳。“二簋”指《兑》之二阳，谓其简略也。上卦爻辞，多取“有孚”之旨，下卦爻辞，多取用享之象，合之皆取悦而止之义。然非谓刚之尽可损，柔之尽可益也，时可损则《损》，时可益则《益》，非人之所能强致焉，故曰“损刚益柔有时，损益盈虚，与时偕行”。" ,
            占:
            "【问时运】目下行运不正，宜自惩忿。\n" +
            "【问营商】营商原在谋财，宜和气，不宜恃气，宜审利，不宜放利。\n" +
            "【问功名】忿欲不除，虽有功名，恐不能保其终也。\n" +
            "【问战征】“山下有泽”，防山下深处，有敌兵埋伏。\n" +
            "【问婚姻】卦自《咸》《恒》来，女悦而男止，夫妇之道，得其正也。\n" +
            "【问家宅】此宅后有高山，前有深泽，地势颇险，宜开凿之使平。\n" +
            "【问讼事】不使气，不贪财，讼自平矣。\n" +
            "【问失物】不得。\n" +
            "【问六甲】单月生男，双月生女。"
        },
        ye:[
            {
                原: "初九：已事遄往，无咎。酌损之。",
                象: ["已事遄往，尚合志也。"],
                析: "初爻处卦之始，即为谋事之始也。“已事”者，已其事也，即《艮》止之意；“遄往”者，遄，速也。事既可已，即当“遄往”，一经因循，必致误事，是以有咎，故曰“已事遄往，无咎”。若事在可已不可已之间，已之则失业，不已则害公，惟当酌其轻重缓急之宜，故曰“酌损之”。《象传》以“尚合志”释之，“尚”作上，庶几也，“已事遄往”，庶几与上合志也。虞氏以“已”作祀，谓祭祀，祀事而云“酌损”，即《彖》所云“二簋可用享”之义。其说亦通。" ,
                占:
                "【问时运】已往莫追，目下宜急加勉，自可免咎。\n" +
                "【问战征】宜速进兵，不可迟缓，辎重粮食，亦须“酌损”。\n" +
                "【问营商】贩运宜速，审时度势，宜酌量前行，定可获利，必无咎也。\n" +
                "【问功名】速往则得，迟缓无成。\n" +
                "【问婚姻】即日迎娶，两姓好合。\n" +
                "【问家宅】须速他迁，吉。\n" +
                "【问讼事】即速了结罢讼。\n" +
                "【问失物】速寻可得。\n" +
                "【问六甲】生女。"
            },
            {
                原: "九二：利贞，征凶。弗损，益之。",
                象: ["九二利贞，中以为志也。"],
                析: "二处内卦之中，凡事之有待损之益之者，必其未协于中也，二得中，则以“弗损”为“利贞”。若不可损而损之，则损之反失中，是以“征凶”。《损》与《益》相对，人只知损其所《损》，以损为益，不知不损其所不损，不损乃为《益》。盖其所弗损弗益者，惟在守其中道而已，得其中，即“利贞”也。《象传》以“中以为志”释之，志，犹射之的，以中为的，志之于此也。" ,
                占:
                "【问时运】好运方来，不减不加，万事得中，自然获利。\n" +
                "【问战征】不必减粮，不必添兵，坚守中营，有胜无败；若鲁莽前往，恐有凶也。\n" +
                "【问营商】货物合宜，不必减价，无不获利。\n" +
                "【问功名】无荣无辱，青毡守旧。\n" +
                "【问婚姻】两姓门户相当，吉。\n" +
                "【问家宅】地位得中，不必添改，大利。\n" +
                "【问讼事】平和。\n" +
                "【问失物】原物无失。\n" +
                "【问六甲】生女。"
            },
            {
                原: "六三：三人行则损一人，一人行则得其友。",
                象: ["一人行；三则疑也。"],
                析: "六三辰在亥，得乾气，《乾》为人，又为行，三爻为三人，故曰“三人行”。《乾》上至三而变《兑》，是三损一也；上互《坤》，变《坤》之上画成《艮》，二阴一阳，故曰“一人行”。三为《损》卦主爻，居《兑》卦之终，《兑》为友，故曰“得其友”，是《艮》得其友也。盖天下事，一则不足，三则过之，以二为得中，乃奇偶之定数，是以“三人行”，则损其一以成二，一人行，则“得其友”亦成二。一而二，二而一，斯之为合志，不然，三人成众，众则人心不一，而疑惑生焉，故《象传》以“三则疑也”释之。" ,
                占:
                "【问时运】财运平平，少则获利，多则有损。利双月，不利单月。\n" +
                "【问战征】宜从兑方，一路进军，自有援兵相助，有胜无败。\n" +
                "【问营商】商业宜于一人独做，否则二人同办，再多则必有损。\n" +
                "【问功名】须一人独往，必得成名。\n" +
                "【问婚姻】得友，即得偶也，吉。\n" +
                "【问家宅】宅在兑方，宅中丁口，每家只有两丁可断。\n" +
                "【问讼事】两造成讼，为中有一人唆弄所致，去此一人，则讼了矣。\n" +
                "【问六甲】生女。"
            },
            {
                原: "六四：损其疾，使遄有喜，无咎。",
                象: ["损其疾，亦可喜也。"],
                析: "此爻以阴居阴，为外卦之始，与初九相应，初动体《坎》，《坎》为心病，疾所由生。疾曰“其疾”，“其”指初也，得四为之应，内外皆知所当损，而决计损之，则事之《损》犹在后，疾之《损》为在先也。疾《损》而“遄”，“遄”者初，使之遄者，四也。盖有疾则忧，疾《损》则喜，故“无咎”也。《象传》以“亦可喜”释之，谓不必言《损》事，但言《损》疾，而亦可喜，则《损》事之喜，更可知矣。" ,
                占:
                "【问时运】目下虽有小灾，得救即疗，可以转忧为喜。\n" +
                "【问营商】货宜减办，使之即往贩售，获利可喜。\n" +
                "【问战征】未免遭伤，医治可疗，无咎。\n" +
                "【问家宅】此宅阴气过盛，宅眷致多疾病，祈祷可疗，无咎。\n" +
                "【问功名】一时难望。\n" +
                "【问婚姻】四与初相应，初阳四阴，阴阳相合，必成可喜。\n" +
                "【问讼事】“疾”者，害也，去其所害，讼自平矣。\n" +
                "【问行人】有事他往，一时未归，有喜无咎。\n" +
                "【问六甲】生男。"
            },
            {
                原: "六五：或益之十朋之龟，弗克违，元吉。",
                象: ["六五元吉，自上祐也。"],
                析: "“十朋之龟”，元龟长一尺二寸，直二千一百六十，为大贝十朋；公龟九寸以上，直五百，为牡贝十朋；侯龟七寸以上，直三百，为公贝十朋；子龟五寸以上，直百，为小贝十朋——见《汉书》。《坤》数十，又偶为朋，故有“十朋”之象。龟者灵物，能前知吉凶，为卜质吉凶之具。此爻柔顺得中，诚孚于下，故人献其诚。“或益之十朋之龟”，“或”者，不知其所从来之辞，意外之益，君子疑焉，故问之于卜筮。理数已定，十朋之元龟，不能违，其吉可知，故曰“十朋之龟，弗克违，元吉”。《象传》以“自上保祐也”释之，“上祐”者，“自天祐之”也。以爻象言，“上”指上爻，谓上能辅祐六五之君也。" ,
                占:
                "【问时运】运途全盛，可得意外宠遇。\n" +
                "【问战征】军事先卜，其兆大吉。\n" +
                "【问营商】财运之来，虽辞不去。\n" +
                "【问功名】“自天祐之，吉无不利”。\n" +
                "【问家宅】家业兴隆，不卜可知。\n" +
                "【问婚姻】天作之合，吉。\n" +
                "【问疾病】病愈之后，且可得财，吉。\n" +
                "【问六甲】生男。"
            },
            {
                原: "上九：弗损益之，无咎，贞吉。利有攸往，得臣无家。",
                象: ["弗损益之，大得志也。"],
                析: "此爻居《损》之极，不可复损也，曰“弗损益之”，其辞与二同，其义与二别。上与三应，三处当《损》之位，人或疑《损》三以《益》上，三之《损》实为上之《益》也，故特示之曰“弗损益之”，以明三虽有损，而于上则无所损益焉。无损则事皆平均而“无咎”，理得安详而“贞吉”。“利有攸往”，即《彖传》所称“与时偕行”之义，上为《艮》之极，极则变，故不为止而为往也。上互《坤》，《坤》为臣，《艮》为家，《艮》动而变《坤》，“得臣无家”之象。弗损下以益上，是王者以天下为家，臣下化之，亦皆国而忘家，故曰“得臣无家”。《象传》以“大得志”释之，谓王者以不损益为《益》，潜移默化，不见其迹，志量之所及甚大，故曰“大得志也”。" ,
                占:
                "【问时运】目下绝无窒碍，所往皆利，大吉。\n" +
                "【问战征】军队不须添减，率此以往，攻克战胜，无往不利，可“大得志也”。\n" +
                "【问营商】货价无甚上落，往售皆可获利，大吉。\n" +
                "【问功名】目下即可得志。\n" +
                "【问家宅】此宅不必改造，自得吉利。\n" +
                "【问疾病】当出外求医，无咎。\n" +
                "【问行人】在外大吉，一时未必归家。\n" +
                "【问六甲】生男。"
            },
        ]
    },
    {
        x:"100011",//益
        e:{
            原: " 益：利有攸往，利涉大川。",
            象: ["风雷，益。君子以见善则迁，有过则改。"],
            彖: ["益，损上益下，民说无疆。自上下下，其道大光。利有枚往，中正有庆。利涉大川，木道乃行。益动而巽，日进无疆。天施地生，其益无方。凡益之道，与时偕行。"],
            析: "卦体上《巽》下《震》，《巽》为风，《震》为雷，风自天来，雷自地出，是以《损》《乾》下画之阳为《巽》，《益》《坤》下画之阴为《震》。《益》者益阴，《损》者损阳。阳实，而《乾》为纯阳，实之至也，故可损；阴虚，而《坤》为纯阴，虚之至也，故曰《益》。且风之势过暴，必致摧丧万物，损之而其气和；雷之威不振，无以鼓动万物，益之而其气斯畅，是以损上益下，名其卦曰《风雷益》。\n" +
            "通观此卦，《损》与《益》名相反，而用相济。《乾》在下，邦国富庶之象，故《损》下；《乾》在上，朝廷《丰》盈之象，故《损》上。《损》上不曰《损》而曰《益》，厚其本也；《益》上不曰《益》而曰《损》，剥其基也，圣人所以示厚下也。能《损》则《益》，此卦所以次《损》也。“损上而益下”，即自上而下下，上以《益》往，下以悦来，上之益得“中正”也，下之悦在“有庆”也。是上“以美利利天下”，不期悦而民自悦焉。悦至此，将见悦以劳民，民忘其劳，则险难不避，波涛可涉，焉往而不得哉！故“利涉大川”。“益动而巽”，《震》为动，《巽》为顺，动而顺行，是以“日进无疆”。“其道大光”，《乾》道也；“木道乃行”，《巽》道也，亦《震》道也。《乾》动而为施，《坤》动而为生，不动不见其益，动则见其益，动无方，《益》亦无方。观夫天之道，随时而动，故其《益》随时而行，君子之“见善则迁，有过则改”，亦随时而迁，随时而改。知《益》之在身者如是，即《益》之在天下国家者，无不如是。上下互卦为《剥》，《剥》《象》曰“剥，上以厚下”，其旨与“损上益下”相同。然《剥》六爻多凶，而《益》六爻多吉，所谓因民之所利而利之，有《益》之惠，无益之病，故与《剥》上者有异焉。卦与《损》反，六爻亦与《损》先后互反。《益》初“大作”“元吉”，即《损》上之“大得志”也。《益》二“十朋之龟”，即《损》五之“或益”之龟也。《益》三“用凶事”，即《损》四之“损其疾”也。《益》四“迁国”，即《损》三之得友也。《益》五“有孚惠心”，即《损》三之“中以为志”也。《益》上“莫益之”，即《损》初之“酌损之”也。其辞或相因而来，其义或相济而成，其旨或相反而为戒。《语》曰：“节用而爱民，使民以时”，《损》者《节》用，《益》者爱民，“时”即“与时偕行”之义，国道之要在是焉。" ,
            占:
            "【问时运】迅雷烈风，正当运途振作之际，改旧换新，在此时也。\n" +
            "【问战征】电逐风行，正可一鼓而平。\n" +
            "【问营商】有利则贸易，无则改售，宜迅速，不宜迟缓。\n" +
            "【问功名】风雷合《益》，大得志也。\n" +
            "【问疾病】是肝木太盛之症，治宜损阳扶阴。\n" +
            "【问婚姻】《震》男《巽》女，天然配合。\n" +
            "【问家宅】此宅防有雷击风摧之患，完者宜修葺之改作之，朽者宜改作之。\n" +
            "【问讼事】返躬自省，怒息气平，讼事自罢。\n" +
            "【问失物】已经迁改变易，不可复得。\n" +
            "【问六甲】单月男，双月女。"
        },
        ye:[
            {
                原: "初九：利用为大作，元吉，无咎。",
                象: ["元吉，无咎，下不厚事也。"],
                析: "“大作”者，天子巡狩之事，所谓“春省耕而补不足，秋省敛而助不给”，其他祭告、赈贷、迁国，皆“大作”也。《震》为作，《巽》为利，《乾》为大，为元，《坤》为用，为厚，“厚事”，即“大作”。初居内卦之下，事之始也，王者举大事，建大功，利益计夫恒久，规则定于首图，故“利用为大作”。在初，其事与天下共为之，其《益》亦与天下共享之，斯下民乐事趋公，愿效其劳，不以其事为上之事，直以其事为己之事也，故得“元吉，无咎”。《象传》以“下不厚事”释之，谓不以其事厚重而难为，乃以其事轻易而乐从，踊跃争先，“吉无咎”焉。或云《震》属春，《巽》属春夏之交，“大作”者，东作之事，《系辞》所云“耒耜之利，以教天下，尽取诸益”。其说亦通。" ,
                占:
                "【问时运】好运初交，可以与作大事，无不如意。吉。\n" +
                "【问战征】兵队初交，即可一战以成大功，有吉无咎。\n" +
                "【问营商】初次营业，资本既厚，经营亦大，可获大利，且能悠久无咎。\n" +
                "【问功名】可望大魁天下，大吉。\n" +
                "【问家宅】此宅新造，屋宇宽大，大吉无咎。\n" +
                "【问婚姻】大吉。\n" +
                "【问讼事】此讼为公众大事，非关一己私愤也。无咎。\n" +
                "【问行人】在外正当谋事立业，一时未归。\n" +
                "【问六甲】生女。"
            },
            {
                原: "六二：或益之十朋之龟，弗克违，永贞吉。王用享于帝，吉。",
                象: ["或益之，自外来也。"],
                析: "“十朋之龟”，解同《损》五，《益》二之龟，即《损》五之龟也。《损》五以龟奉上，《益》二即以下所奉者，转而益下。龟之益人，其灵爽足以世守，非在一时之吉也，故曰“永贞吉”。二居《震》之中，当位应《巽》，《震》为帝，为祭，故曰“王用享于帝”。“王”指九五，五用二之朋龟，告享于帝，以乞上祐，吉莫大焉。《郊·特牲》曰：“卜郊受命于祖庙，作电于祢宫官”，是为享帝用龟之事。《象传》以“自外来”释之，以《益》为内，《损》为外，龟自《损》来，故谓“外来”也。" ,
                占:
                "【问时运】主得意外之财，且能世守，永吉。\n" +
                "【问战征】古者行军先卜，出师必祷，此爻均吉，其战必克。“自外来也”，可由外而攻之也。\n" +
                "【问营商】贝货即货币也，“十”，数之盈也；“或益之”者，疑有神助也。营商得此爻，必获厚利，永吉。\n" +
                "【问功名】古者命相举贤，皆从枚卜，既得吉兆，其显可知，故曰永吉。\n" +
                "【问疾病】祷之即愈。\n" +
                "【问家宅】二至四为《坤》，《坤》为安，为土，有安宅之象。《坤》“利永贞”故曰，“永贞吉”。此宅可以久居也。\n" +
                "【问婚姻】《震》《巽》为长男长女，卜凤之兆，自昔称祥，百年好合，故得永吉。\n" +
                "【问六甲】生男。"
            },
            {
                原: "六三：益之用凶事，无咎。有孚中行，告公用圭。",
                象: ["益用凶事，固有之也。"],
                析: "六三以阴居阳，处《震》之极，是动而求益者也，故曰“益之”。下互《坤》，《坤》为用，为事，为死丧，故曰“用凶事”。《益》在于三，民信素著，不特处常为益，即处变亦为《益》。盖《益》非私己，用适其时，志在拯凶，事得无咎，故曰“无咎”。三动体《家人》，《家人》上爻曰“有孚威如”，《震》为应，诚心相应，有威孚之象。三当内外卦之中，《震》又为行，故曰“有孚中行”。《震》为诸候，又为告，故曰“告公”。《周礼》，“珍圭以征守，以恤凶荒”；毛氏西河云，“凡王者忧凶之礼，出珍圭以致王命，使恤凶之地，或去其征，或弛其政”，此即《益》下之“用凶事”者也。圭为符信，所以示信，以通上下之情也，故曰“告公用圭”。《象传》以“固有之也”释之，谓《益》“用凶事”，在民若第知为益，而不知为凶，以为其事为固有之也。夫《益》而至于“用凶事”，斯真其益之无方矣；。凶事而若“固有之”，愈见民悦之无疆矣。初爻《象传》曰，“下不厚事”，意亦相同。" ,
                占:
                "【问时运】运途多歉，以其素行诚实，人皆信之，可以无咎。\n" +
                "【问战征】兵本凶事，又陷危地，幸众军同心戮力，得奔告大营，获救出险，无咎。\n" +
                "【问功名】先苦后甘，先难后获。\n" +
                "【问营商】谚云“欲求富，走险路”。\n" +
                "【问家宅】此宅多凶，惟有中行之德，斯能逢凶化吉。\n" +
                "【问婚姻】恐从丧服中成亲，然无咎也。\n" +
                "【问讼事】须诉之上官，乃得准信，罢讼。\n" +
                "【问失物】恐涉词讼。\n" +
                "【问六甲】生男。"
            },
            {
                原: "六四：中行告公从，利用为依迁国。",
                象: ["告公从，以益志也。"],
                析: "四居《巽》之始，与初相应，与三相比。初曰“利用”，故四亦曰“利用”；初曰“为大作”，四之“迁国”，即“大作”之事也。三曰“中行”，曰“告公”，故四亦曰“中行告公”，三四皆当内外卦之中，故皆为中行。“告”，指三，“公”，指四，以四为《益》主爻，三欲益下，恐四阻之，是以告于四也。“公从”者，四从之也，上互《艮》，《艮》为社稷，下互《坤》，《坤》为国邑，《震》为奔走，《巽》为进退，皆有迁之象，故曰“迁国”。卦体本为《乾》《坤》《否》，《否》五爻曰，“其亡其亡，系于苞桑”，有国难之忧焉；《否》《象传》曰“俭德辟难”，有遁避之意焉；《否》变而为《益》，故利用迁国。《左传》隐公五年，《传》曰“我国之东迁，晋郑焉依？”盘庚曰：“视民利用迁”，皆以迁为益者也。《象传》以“益志”释之，谓四从而迁之，四之志，惟在《益》下也。按《震》为东方，《巽》为东南，《易》当殷周之际，“迁国”者，指太公迁歧而言，岐属殷西南，为《坤》方，是明证也。" ,
                占:
                "【问时运】目下有难，宜择善地暂避。\n" +
                "【问战征】宜退兵移营，急请救援。\n" +
                "【问营商】宜禀告店主，改迁别地，另开市面。\n" +
                "【问家宅】宜迁居。\n" +
                "【问功名】不成，须改就别业。\n" +
                "【问婚姻】须别寻媒妁。\n" +
                "【问失物】不得。\n" +
                "【问六甲】生女。"
            },
            {
                原: "九五：有孚惠心，勿问元吉。有孚惠我德。",
                象: ["有孚惠心，勿问之矣。惠我德，太得志也。"],
                析: "五爻刚健中正，得位居尊，为《益》之主。以惠为益，其益越大，以心行惠，其惠愈宏，是以实心行实惠，心无尽，惠亦无尽，故谓“有孚惠心”。自初爻以来，凡巡狩、祭告、赈灾、迁国，无一非惠民之事，即无一非惠民之心，所谓“乾元以美利利天下”者，即此心也。事之《益》，其吉待问，心之惠，其吉不待问矣，故谓之“勿问元吉”。信惠之施于下者，在我为心，下之受此信惠者，目之为德；九五得《坤》气，《坤》为我，故谓之“有孚惠我德”。“问”，问卜也，古者举大事，必卜之，以决吉凶。以惠行政，勿疑何卜？“元吉”，即从初爻“元吉，无咎”来，上以孚惠下，下即以孚德上，下上交孚，上益下而上亦受其益也。《象传》以“大得志”释之，谓本此惠心，行此惠政，天下皆受我德惠，而中心诚服，正可得志而有为也，故曰“大得志也”。" ,
                占:
                "【问时运】“心好无歹运”，以仁存心，事无不吉，不待问也。\n" +
                "【问营商】以义为利，诚实相交，利益与共，以此为商，利益广矣。\n" +
                "【问功名】实至名归，大吉。\n" +
                "【问战征】罚必信，赏必公，战无不克，大吉。\n" +
                "【问家宅】此为仁里德门，勿问而知为善人之室也，大吉。\n" +
                "【问婚姻】非亲即友，必是旧交，“勿问元吉”。\n" +
                "【问六甲】生女。"
            },
            {
                原: "上九：莫益之，或击之，立心勿恒，凶。",
                象: ["莫益之，偏辞也。或击之，自外来也。"],
                析: "上九，阳刚居外卦之极，是求益而过甚者也，太过则变，变则不为益而为击矣。圣人观象设卦，以“损上益下”为《益》，其心本偏在厚下，至上九，为上之益下者已多，转而责下之益上，非待“莫益之，”夫且“或击之”。“或”者众而未定之辞。上动体为《屯》，“屯其膏”，即“莫益之”之谓也；反卦《损》，《损》上为《艮》，《艮》为手，故称“击”也。《巽》为进退，为不果，是无《恒》也；上动为《坎》；《坎》为心，本以《益》下之心，易而为《益》上之心，是无《恒》也。旁通为《恒》，《恒》上曰“振恒，凶”，振恒致败于垂成，无《恒》不可以持久，故皆凶也。《象传》所云“偏辞”者，谓其心之偏而不公也。“外来”者，谓其击之出于意外也。" ,
                占:
                "【问时运】好运已退，贪心过甚，防有意外之祸。\n" +
                "【问战征】不待添兵加饷，即可进击。\n" +
                "【问营商】专求利己，所谓不夺不厌，必启争端，凶。\n" +
                "【问功名】夺人之功以为名，其名必不久也，凶。\n" +
                "【问家宅】此宅地位太高，有害无利，不可久居。\n" +
                "【问婚姻】恐不能偕老。\n" +
                "【问讼事】讼事无恒，转凶为吉。\n" +
                "【问行人】防中途有盗劫之患，凶。\n" +
                "【问失物】或已打破，不可得也。\n" +
                "【问六甲】生女。"
            },
        ]
    },
    {
        x:"111110",//夬
        e:{
            原: " 夬：扬于王庭，孚号有厉。告自邑，不利即戎，利有攸往。",
            象: ["泽上于天，夬，君子以施禄及下，居德则忌。"],
            彖: ["夬，决也，刚决柔也。健而说，决而和。扬于王庭，柔乘五刚也。孚号有厉，其危则光也。告自邑，不利即戎，所尚乃穷也。利有攸往，刚长乃终也。"],
            析: "《序卦传》曰：“益而不已必决，故受之以夬。夬者，决也。”夫物未有增益盈满而不溃决者，夬所以继《益》也。《夬》与《剥》反，《剥》以五阴剥一阳，阳几于尽，《剥》者，削也，其心险，故其《剥》也深而刻；夬以五阳决一阴，阴几于尽，“夬者，决也”，其气刚，故其决公而明。卦体《乾》下《兑》上，泽在天上，有决而欲下之势，故名其卦曰《夬》。\n" +
            "通观此卦，五阳一阴之卦凡四，《履》、《夬》、《姤》、《小畜》是也。《姤》、《小畜》，一阴属《巽》，《夬》、《履》一阴属《兑》；《履》一阴在三，《小畜》一阴在四，是小人处君子之间。《姤》一阴在下，是初进之小人也，其势本孤，其力皆微；《夬》则一阴在上，是小人居高临下，足以压制群刚，未可轻用力夬者也。故《彖传》言“健”，言“决”，言“扬”，言“号”，言“往”，皆示以必夬之意；言“悦”，言“和”，言“厉”，言“危”，言“不利”，皆惕以用夬之惧。《大壮》之戒“用壮”，夬之用决，其旨同也。若藐视孤阴，恃群阳之盛势，而造次求决，此私智自雄，非观变时中之道，古来党祸，可为前鉴。六爻之辞，多与《彖传》相表里：初诫以“不胜”，二惕以“有戎”，三警以“有凶”。内三爻为《乾》，《乾》健也，健所以宜进也。四曰“牵羊悔亡”，五曰“无咎”，上曰“不可长”。外三爻属《兑》，《兑》，和也，和乃可以用夬也。在五阳秉刚决柔，是以盛决衰，以强决弱，宜若易易，而《易》辞谆谆垂诫，不胜危惧，盖谓尹子易消，小人难退，由来已久。夬之一阴，夬之未尽，姤之一阴，即生于下。阴阳消长，不能与造物争，而因时保护，惟存乎其人而已。" ,
            占:
            "【问时运】目下气运强盛，财宜散，不宜聚，聚则有祸。\n" +
            "【问战征】赏要明，罚要公，切勿夸张自伐，克减军粮。\n" +
            "【问营商】获利颇厚，但利己利人，分财宜均，若靳而不施，必致众嫉。\n" +
            "【问功名】泽上于天，有居高位之象；盈满致损，所当自警。\n" +
            "【问家宅】“泽上于天”，防有水溢之患。\n" +
            "【问婚姻】《夬》有决绝之义，且《夬》反为《姤》，《姤》曰“勿用娶女”，此婚不成。\n" +
            "【问讼事】夬者决也，有断之义，一断便可了讼。\n" +
            "【问六甲】生男。"
        },
        ye:[
            {
                原: "初九：壮于前趾，往不胜为咎。",
                象: ["不胜而往，咎也。"],
                析: "初九居卦之下，为夬之始，是率先而用夬者也，故曰“壮于前趾”。壮趾之辞，与《大壮》初爻同，所谓“前”者，较《大壮》尤长一阳也。夫以最下之阳，往而决最上之阴，上下悬殊，其不胜也必矣。若其径情直往，不特无济于事，反以招咎，亦何取其往乎！爻辞为初当观变待时，量力而进，毋以躁妄速祸也。《象传》以“不胜而往”释之，谓于未往之先，而已知其不胜也，较爻辞而益激切矣。" ,
                占:
                "【问时运】负气太盛，任意妄动，动必得咎。\n" +
                "【问战征】将微位卑，恃勇直前，必致败北，咎由自取也。\n" +
                "【问营商】不度地位，不审机宜，率意贩货前往，不特伤财，更防损命，宜慎宜戒！\n" +
                "【问功名】躁进取败。\n" +
                "【问婚姻】门户不当，不合，合则有咎。\n" +
                "【问家宅】此宅地势低下，迁居不利。\n" +
                "【问行人】宜即归，可以免咎。\n" +
                "【问失物】不必往寻，寻之反有余祸。\n" +
                "【问讼事】宜即罢讼。\n" +
                "【问六甲】生男。"
            },
            {
                原: "九二：惕号，莫夜有戎，勿恤。",
                象: ["有戎勿恤，得中道也。"],
                析: "二居《乾》卦之中，得《乾》“夕惕”之义，故曰“惕号，莫夜”。“惕号”者，内凛警惕，而外严号令也，即《彖》所云“孚号，有厉”之旨。“莫夜”者，凡阴爻皆属《坤》象，《坤》为夜，兑寇盗窃发，乘其不备，多在昏暮，故严密周防，暮夜尤宜加警。二动体为《离》，《离》为戈兵，故曰“有戎”。“勿恤”者，九二为《坎》爻，《坎》为恤，《坎》变《坤》，故“勿恤”。“有戎，勿恤”，谓有备无患也。《象传》以“得中道”释之，二居《乾》之中，谓“有戎，勿恤”者，能得“大哉乾元”，“刚健中正”之道也。" ,
                占:
                "【问时运】目下运途中正，事事谨慎，即有意外之事，皆可坦然无患。\n" +
                "【问战征】军事最患夜袭，宜时作警备，可以无忧。\n" +
                "【问营商】贩运货物，盗警水火，总宜保险，使可无虑。\n" +
                "【问家宅】此宅阳刚过盛，二爻动而变《离》，火灾宜防。暮夜更当小心。\n" +
                "【问婚姻】婚字从女，从昏，故称“昏礼”，有暮夜之象。诗云“弋凫与雁”，弋有戎象。“勿恤”，即有喜也，婚姻吉。\n" +
                "【问讼事】即可断结无忧。\n" +
                "【问疾病】日轻夜重，是阴虚火盛之症，当慎意调治，可以无患。\n" +
                "【问六甲】生男。"
            },
            {
                原: "九三：壮于頄，有凶。君子夬夬独行，遇雨若濡，有愠，无咎。",
                象: ["君子夬夬，终无咎也。"],
                析: "“頄”者，面颧也。三爻居《乾》卦之极，过刚不中，且《夬》卦大象，大率与《大壮》相似似，故初与三皆称“壮”。“壮”者，刚壮也；“壮于頄”者，是刚怒之威，先见于面也。凡谋逐奸臣，最宜深计密虑，不动声色，若事未举而怒先形，则机事不密，灾必及身，故曰“有凶”。《夬》三之君子，即《乾》三也，《乾》曰“乾乾”，故《夬》亦称“夬夬”，谓《夬》之又夬也。《夬》阴者，五阳而三独与上应，《乾》为行，故曰“独行”。《兑》为雨，《夬》反则为姤，《姤》为遇，故曰“遇雨”。《兑》泽在上，有降雨之象，三独行前进，有遇雨之象。“濡”，濡滞也，“独行遇雨”，而若有濡滞焉。“愠”，即《诗》所谓“愠于群小，”故曰“有愠”。然君子志在祛邪；虽与上应，实与上敌，即濡滞而必进，虽“有愠”而“无咎”。《象传》以“终无咎”释之，谓“无咎”即从《乾》三来。阳盈于三，当上下之交，其地本危，“君子夬夬独行”，虽“若濡有愠”，有危心无危地也，故终得无咎焉。" ,
                占:
                "【问时运】目下运得其正，但阳气过盛，率意独行，未免被人疑忌，然幸可无咎。\n" +
                "【问战征】孤军独入，防中途遇水有阻，然亦无咎。\n" +
                "【问营商】孤客独行，虽得无咎，恐遇雨有阻，濡滞时日。\n" +
                "【问功名】孤芳独赏，恐遭小人所忌。\n" +
                "【问家宅】此屋门面壮丽，栋上恐有渗漏，致被濡湿，急宜修葺，无咎。\n" +
                "【问婚姻】爻辞曰“独”，一时未得佳偶。\n" +
                "【问疾病】面上浮肿，必是湿热之气，上冲所致，医治无咎。\n" +
                "【问六甲】生男。"
            },
            {
                原: "九四：臀无肤，其行次且。牵羊悔亡，闻言不信。",
                象: ["其行次且，位不当也。闻言不信，聪不明也。"],
                析: "《夬》与《姤》反对，姤四“臀无肤，其行趑趄”，姤之四，即为夬之三，故其辞同。四体《坎》，《坎》为臀，故有臀象。《易》例阳为脊，阴为肤，四本阴位，故“无肤”。且夬旁通《剥》，《剥》四曰“剥床以肤”，“无肤”，则《剥》之已尽矣。《夬》四出《乾》入《兑》，与上同体，不无瞻徇之意，故“其行趑趄”，欲行而复退也。《兑》为羊，羊善决，四亦羊之一，能牵率群羊以行，则悔可亡。朱子曰：“牵羊者，当前则不进，继之使前，而随其后，则可行。”四随九五之后，可以牵之使进也。“闻言不信”，言即《象》“孚号”之辞，一时声罪致讨，大言疾呼，天下莫不闻知，四首鼠两端，“其行趑趄”；四非不闻其言，特以疑信不定，故欲进复止，尚得谓有耳能听乎？《象传》以“位不当”释趑趄，谓四以阳居阴位，刚为阴掩，故曰“位不当也”。“聪不明”释“不信”，谓四居《兑》首，与上相比，故曰“聪不明也”。" ,
                占:
                "【问时运】目下运途不当，作事颠倒，精神不安，所谋难成。\n" +
                "【问营商】心无主见，故贩售货物，每失机宜，获利殊难。\n" +
                "【问功名】“趑趄”者，不进之状，焉得成名？\n" +
                "【问战征】“臀无肤”，是见伤也；“行趑趄”，是欲退也；“闻言不信”，是号令不行也。以此行军，何能决胜乎！\n" +
                "【问疾病】剥肤之灾，其疥癞之患乎？防溃烂及耳，致两耳失聪。\n" +
                "【问家宅】此宅屋后无余地，屋前行路迂斜，为羊肠小径，居者尚无灾悔。\n" +
                "【问婚姻】始则踌躇不决，久之得以牵羊成礼。\n" +
                "【问讼事】防有杖笞之灾。\n" +
                "【问行人】一时不归。\n" +
                "【问六甲】生女。"
            },
            {
                原: "九五：苋陆夬夬，中行无咎。",
                象: ["中行无咎，中未光也。"],
                析: "“苋陆”之说，马、郑、王皆云：苋陆，一名商陆。宋衷以苋为苋菜，陆为商陆，分作两物，本义从之。《虞氏易》作“莞睦”，以苋为莞，以陆为睦，诸说纷如，各有偏解。按《说文》：“苋，山羊细角者，胡官切，音桓。”苋字从廿，象羊角，不从艹，《夬》全卦是《兑》，皆有羊象。羊性善决，五动体《大壮》，夬之爻象，多与《大壮》相同；《大壮》五曰“丧羊”，故夬五取象山羊。古称皋陶决狱，有疑罪者，令羊触之，羊能《夬》邪，是其明证。四曰“牵羊”，羊指五，四在其后，而牵之也。“夬夬”者，四五同卦，牵引并进，故曰“夬夬”。五居《兑》卦之中，下承乾来，《乾》为行，故称“中行”。五阳至五而尽，上爻一阴，与五比近，最易惑聪，必待夬而又夬，始得去谗远佞，廓清王庭。“中行”者，中道而行，示无偏曲，不为已甚。《象传》以“中未光也”释之，谓五始近小人，纵能联合群阳，决而去之，虽不失中，而于光明之体，终未尽显，故曰“中未光也”。" ,
                占:
                "【问时运】运得中正，万事无咎。\n" +
                "【问战征】五为卦主，是主将也，率诸军以齐进；“中行”者，就大道而行，故得无昝。\n" +
                "【问营商】《夬》，决去也。爻当五位，时令将过，货物宜决计速售，斯可无咎，否则有悔。\n" +
                "【问功名】五为尊位，其名必显，惟宜远小人，近君子，斯可无咎。\n" +
                "【问家宅】此宅蔓草丛生，几成荒废，当速剪除尽净，居住无咎。\n" +
                "【问婚姻】五与二应，五居《兑》中，二居《乾》中，阴阳相合。“羊”取义于祥，有吉祥之兆，故无咎。\n" +
                "【问疾病】五以阳居阳，气过盛，宜调剂得中，可以无咎。\n" +
                "【问讼事】以正决邪，决去务尽，不使复萌，讼乃得吉。\n" +
                "【问六甲】生女。"
            },
            {
                原: "上六：无号，终有凶。",
                象: ["无号之凶，终不可长也。"],
                析: "“号”者，即《彖》之“孚号”、二之“惕号”也。至上则卦己终，《夬》已尽，谓小人之道己消，可以“无号”矣，不知“无号”，则小人之罪名不彰，小人之奸谋，亦将复起。《夬》于此终，《姤》即于此始，故曰“终有凶”也。《象传》申之曰“无号之凶，终不可长也”；《姤》夬相反，《姤》上五阳，喜君子之犹存，夬上一阴，虑小人之复盛。阴阳消长，本相倚复，明“无号”之凶，《姤》之始，即伏于夬之终，故曰“终不可长也”。" ,
                占:
                "【问时运】正运已退，更宜警惕，斯可免凶。\n" +
                "【问战征】军事将毕，余孽犹在，所当重申号令，警严戒备，始得廓清。若偷安忘备，终必有凶。\n" +
                "【问营商】上为卦之终，是货物脱售将尽，当重申后约，斯商业得以继续。“无号”，为无商业名目，其业必凶。\n" +
                "【问功名】“无号”，为声名灭绝之象，凶。\n" +
                "【问家宅】凡一宅之中，或书声，或歌声，或笑语声，以至鸡鸣狗吠，皆有声也，“无号”，则寂灭无闻，其家必凶。\n" +
                "【问疾病】是阳尽阴息之症，痛痒不觉，叫号无声，其病危矣。凶。\n" +
                "【问婚姻】媒妁无言，不成。\n" +
                "【问讼事】冤莫能伸，讼不得直，凶。\n" +
                "【问行人】未通音问，凶。\n" +
                "【问六甲】生女。"
            },
        ]
    },
    {
        x:"011111",//姤
        e:{
            原: " 姤：女壮，勿用取女。",
            象: ["天下有风，始，后以施命诰四方。"],
            彖: ["姤，遇也，柔遇刚也。勿用取女，不可与长也。天地相遇，品物咸章也。刚遇中正，天下大行也。姤之时义大矣哉！"],
            析: "《姤》为《夬》之反，《夬》为一阴在上，五阳决之，几至于尽，至《姤》而一阴复生于下。造化之理，阴阳奇偶，如影随形，循环反复，去而复生。天地不能有阳而无阴，圣人虽恶阴，而终不能绝阴。《姤》之一阴，即自坤元下画而来，履霜之渐，已兆于此矣。按：《姤》字从女，从后，女阴象，后与後通，谓阴即伏于《乾》后也。此五阳一阴卦之所以名姤也。\n" +
            "通观此卦，卦之体属夫女，卦之义取夫遇，卦之象用惩其壮，卦之用戒其与长。天下不能无女也，天下亦不可无遇也，因其壮之为害，而遂欲绝其女，却其遇，是率天下于寂灭之途，岂圣人作《易》之旨哉？盖壮之为害，不在于壮，而在与壮以权者，壮乃得以渐长。《传》曰“不可与长”，则壮无其权，而女不为害，相遇适足以相成，而遇正大可用也。\n" +
            "姤之为卦，何尝不善？《乾》天上运，《巽》风下行，“帝出乎震，齐乎巽，相见乎离”，遇之象也，是以天地得遇而物生，刚柔得遇而道平，君臣得遇而治成，《姤》之时义，所以为大也。天下有风，为天风相遇，天无远而不覆，风无远而不届，古先哲以大中至正之道，宣告四方，象取此耳。\n" +
            "爻以九五阳刚居尊，为卦之主。初以一阴方来，有君民相遇之象；二以刚中下应，有大臣宣化之象；五所用以招携怀远，风行下国者也；三、四、上三爻，或病于“牵”，或失于“远”，或伤于“穷”，是皆不善于包，而相遇之未得其中正也。圣人爱阳而恶阴，爱阳而喜其来，故于复之一阳，而喜其“来复”，恶阴而亦不能禁其不来，故于《姤》之一阴，而戒其用壮。可见圣人之于阴，未尝不予阴以并生，但不使阴之浸长为患也已。",
            占:
            "【问时运】好运盛行，能使四方闻名。\n" +
            "【问战征】军令迅速，赏必信，罚必行，有席卷天下之势。\n" +
            "【问营商】为商为利，宜贩运远方，可以随在获利。\n" +
            "【问功名】有名扬四海之象。\n" +
            "【问婚姻】婚礼所重，在父母之命，媒妁之言，犹政事之有诰命也。得其正，则天下可行也。\n" +
            "【问家宅】此宅防有被风倾圯之虑。\n" +
            "【问疾病】小儿为惊风，大人为肝风，防有四肢不仁，或手足牵拘之症。\n" +
            "【问讼事】此讼牵连甚广，一时未得罢休。\n" +
            "【问失物】窃者已远飚，难以再得。\n" +
            "【问六甲】生女。"
        },
        ye:[
            {
                原: "初六：系于金柅，贞吉。有攸往，见凶。羸豕孚蹢躅。",
                象: ["系于金柅，柔道牵也。"],
                析: "初得《巽》下一阴，女象也。《乾》为金，《巽》为木，木入金，成柅之象，故曰“金柅”。“金柅”，络丝之栿，女子所用，“系于金柅”，系丝也。“系”犹牵也，丝至柔，故《传》曰“柔道牵”。九家《易》曰：“丝系于柅，犹女系于男。”《高古录》云：晋武帝选女子有姿色者，以绯采系其臂，是其证也。按系者为系著不动，妇人之德，静为吉，动为凶，系而不动，则“贞吉”，“有攸往”，则“见凶”。妇人言不出阃，行不履阈，行将何往？有往则必不安于室也，凶可知矣。初六辰在未，上值柳，南宫侯曰，柳，其物为豕，故象豕；初《巽》阴柔，为之牝豕。群豕之中，牡强而牝弱，故曰“赢豕”。“蹢躅”，不安也，牝豕阴质而淫，躁动尤甚；初以柔承五刚，不系而往，故曰“赢豕孚蹢躅”。总之，丝为柔物，豕为阴兽，一失其系，丝必紊乱，豕必奔突，任其所往，势必消阳而剥刚。其蹢躅也，不待否剥之至，而已可预知矣。“孚”，信之先至者也。" ,
                占:
                "【问时运】目下运途，有所牵制，不可妄动，妄动必凶。\n" +
                "【问战征】初爻为出军之始，《巽》象阴柔，兵力必弱，显见固守则吉，躁进则凶。\n" +
                "【问营商】利坐贾，不利行商。\n" +
                "【问功名】宜守旧而已。\n" +
                "【问婚姻】九家《易》曰：“丝系于柅，犹女系于男”，正位夫内，故吉。\n" +
                "【问家宅】此宅防有闺范不修之羞。\n" +
                "【问疾病】此病是阴弱之症，宜安居静养。\n" +
                "【问失物】必为绳索所系，即寻则得，过日不能得也。\n" +
                "【问行人】在外必有女子牵连，不能即归。\n" +
                "【问六甲】生女。"
            },
            {
                原: "九二：包有鱼，无咎，不利宾。",
                象: ["包有鱼，义不及宾也。"],
                析: "《乾》为包，《巽》为鱼，鱼阴物，谓初，二包之，故曰“包有鱼”。《剥》之“贯鱼”，即从《姤》之一鱼所生，能就《姤》之始而包之，故得无咎。二居内卦之中，当刚柔相遇之始，见其为柔，特以优容而并包之，不敢以激烈而启变，亦不至以姑息而养奸，斯诚御阴之善道也。“宾”，谓九四，四辰在午，上值张，石氏曰“张主赐宾客”；二“有鱼”，四则无之，是不及四也，故曰“不利宾”。《传》以“义不及宾”释之，“不及”者，即《彖传》不与长之义。千古御小人之法，莫善于使之不相及；予之以并生，不予之以渐长，则终无相及之时矣。《姤》初之“不利宾”，以二为之包也。" ,
                占:
                "【问时运】人生处世，安得相遇尽为君子？惟当曲意调护，不为小人所害，自得无咎。\n" +
                "【问功名】鱼有化龙之象，“包有鱼”者，鱼已为其所包矣，则升腾可必也。“不利宾”，利必在己也。\n" +
                "【问营商】“包”为包罗富有之象，众惟鱼矣。鱼亦有众多之象，主货物充盈，财利富厚。“不利宾”，为其利非外人所得窃取也。\n" +
                "【问战征】马融曰，“鱼介鳞之物，兵象也”，鱼而能包，是必善用其兵者也。曰“不利宾”，宾即敌也，敌必可破矣。\n" +
                "【问婚姻】鱼阴物，以阳包阴，姻事成矣。\n" +
                "【问家宅】鱼为阴物，象取女子，此宅定是女子主政。\n" +
                "【问疾病】防有池鱼殃及之灾。\n" +
                "【问六甲】生女。"
            },
            {
                原: "九三：臀无肤，其行次且，厉，无大咎。",
                象: ["其行次且，行未牵也。"],
                析: "《姤》与《夬》反对，《姤》之臀在三，《夬》之臀在四，《姤》三即《夬》四也。三居下体之上，《巽》为股，臀在股上，故三有臀象。《剥》四曰剥肤，是《剥》阳也，《姤》三亦为初阴所《剥》。故曰“无肤”。上卦为《乾》，《乾》为行，三居《乾》《巽》之间，柔未变也，故“其行次且”，有危心焉。《乾》之三“厉，无咎”，《姤》三化《巽》变柔，进退不果，其“次且”也，即其咎也。幸其由此以进，行将入《乾》，尚不失健行之性，故曰“无大咎”。《象传》以“行未牵”释之，“牵”者，牵制也，谓其行虽缓，尚能不失《乾》健，不为阴柔所牵制也。" ,
                占:
                "【问时运】气运柔弱，诸事迟疑，是以动辄有危。\n" +
                "【问战征】欲进不进，因疑生危，不能得胜也。无大败亦幸矣。\n" +
                "【问营商】贩运不快，安能获利？\n" +
                "【问功名】尚须迟缓以待。\n" +
                "【问婚姻】迟缓可成。\n" +
                "【问家宅】此宅后面墙屋，定已倾圯矣，殊为可危，修葺斯可免咎。\n" +
                "【问疾病】此病必是下体溃烂，行坐不安，治之无咎。\n" +
                "【问讼事】防受笞杖。\n" +
                "【问失物】物已损坏，迟之可得。\n" +
                "【问六甲】生女。"
            },
            {
                原: "九四：包无鱼，起凶。",
                象: ["无鱼之凶，远民也。"],
                析: "四入《乾》，复变而为《巽》，《巽》为鱼，鱼已为二所包，故“无鱼”。盖天包乎地，阳包乎阴，得所包而“含宏光大”，并育无害，此二之包所以“无咎”也。失所包，而鱼将吸浪扬波，顿生凶患，小人之施毒以害君子者，其凶由是而起也。《象传》以“远民”释之，“鱼”，犹民也，谓鱼之不可不包，犹民之不可或远。不以民为小人，而驱而远之，必以民为同胞，而亲而近之，斯民得兼包并育，何致有消阳之患哉！" ,
                占:
                "【问时运】刚变而柔，运途不正，气量浅狭，是以多凶。\n" +
                "【问战征】主将才力微薄，不能包容众军，防有兵变之祸。\n" +
                "【问营商】“包无鱼”，有囊里空虚之象，何以获利？\n" +
                "【问功名】鱼喜得水，人喜得名，无鱼则水涸，无名则人穷，故凶。\n" +
                "【问婚姻】婚姻之道，重在生育，“包无鱼”，言无胎孕也。凶。\n" +
                "【问家宅】《象》曰“远民”，此宅必在民居相远之地，是孤村也。恐有不测之灾。\n" +
                "【问疾病】鱼阴象，无鱼是阴已亏极，阳不能包，必凶。\n" +
                "【问六甲】生女。"
            },
            {
                原: "九五：以杞包瓜，含章，有陨自天。",
                象: ["九五含章，中正也。有陨自天，志不舍命也。"],
                析: "《巽》为杞，杞，柳也，可屈以包物。“杞”谓五，“瓜”谓初，杞刚而瓜柔，刚包柔，即“杞包瓜”也。《姤》者，五月之卦，瓜以五月生，杞以五月盛，包之，正及其时矣。及时而包之，柔者扬其花，刚者蕴其美，自觉章采之内含也。五秉中正之德，初得其包，亦归于中正，即《彖传》所谓“天地相遇，品物咸彰”者，其在此爻乎？“有陨自天”者，瓜之为物，不能经久，黄熟而陨，亦天为之也。在包之者，不肯委诸于天命，故于其陨也，若不胜其哀矜焉，故《传》以“志不舍命”释之。" ,
                占:
                "【问时运】运行中正，才力所及，自能包罗诸有，虽不言吉，吉可知矣。\n" +
                "【问营商】生意虽不外木植瓜果等品，而包容甚广，自有大财可得。\n" +
                "【问功名】五居尊位，功名自显，但进退荣辱，俱当安命。\n" +
                "【问战征】堂堂之阵，正正之旗，王者之师也。逆者诛，顺者从，有包扫一切之势焉。\n" +
                "【问婚姻】有瓜蓏绵绵之象。\n" +
                "【问疾病】为热包寒之象。\n" +
                "【问六甲】生女。"
            },
            {
                原: "上九：姤其角，吝，无咎。",
                象: ["姤其角，上穷吝也。"],
                析: "上九辰在戌，得乾气，《乾》为首，位居首上，故曰“角”；遇而在上，遇亦极矣，故曰“姤其角”。角善触，遇之而触，不如遇之而包也，触之，故“吝”；然触亦不害其正，故“无咎”。《象传》以“上穷”释之，凡上穷必返下，《剥》之穷上返下，而“硕果不食”，一阳乃“来复”焉。“姤其角”，正穷上返下之象，故虽吝无咎。圣人之于阴，欲以并生，不欲其浸长，上之“姤其角”，令其穷而自返也。" ,
                占:
                "【问时运】运至于上，运亦穷矣。\n" +
                "【问营商】角逐者争利也，“姤其角”，为能得其首利也。盖吝在商人，“吝，无咎”焉。\n" +
                "【问功名】有头角峥嵘之兆。世传魁星有角，“姤其角”是遇魁星也，功名大利。\n" +
                "【问战征】角力角胜，皆有战象。角之字为刀下用，此战大有杀戮，是穷兵之祸也。\n" +
                "【问疾病】想头角之上患疮，医治无咎。\n" +
                "【问婚姻】上居《乾》之极，上穷返下，必是老夫而求女妻也。\n" +
                "【问失物】物本在高处，穷而返下，须就低处寻之，可得。\n" +
                "【问六甲】上穷而返，生男。"
            },
        ]
    },
    {
        x:"000110",//萃
        e:{
            原: " 萃：王假有庙，利见大人。亨，利贞。用大牲吉，利有攸往。",
            象: ["泽上于地，萃。君子以除戎器，戒不虞。"],
            彖: ["萃，聚也。顺以说，刚中而应，故聚也。王假有庙，致孝享也。利见大人，亨，聚以正也。用大牲吉，利有攸往，顺天命也。观其所聚，而天地万物之情可见矣。"],
            析: "卦体泽上地下，泽能畜水，地能畜泽。卦通《大畜》，有畜聚之象；反则为《升》，《升》《象》曰“积小以高大”，有积聚之义。卦自《姤》来，《序卦传》曰：“姤者，遇也。物相遇而后聚，故受之以萃。萃者，聚也。”此卦之所以名《萃》也。\n" +
            "通观此卦，“国之大事，在祀与戎”，故《彖》言“假有庙”，象言“戒不虞”，而其要首在于得众，此卦之所以取《萃》也。卦体下顺上悦，顺而悦，故兆民归往，以之执笾豆而相祀事，而礼仪不忒，以之执戈矛而从王事，而踊跃知方。上以兴孝，下以兴仁，风同道一，万邦协和，《萃》莫萃于此焉。《萃》易位为《临》，《临》《象》曰“容保民无疆”，《萃》之象矣。二卦同为泽地，泽足以惠民，地足以容众，故泽下地上为《临》，地下泽上为《萃》。六爻以五为《萃》之主，乃刚中之大人也，二《萃》焉，初与四亦《萃》焉，其位足以致《萃》，故曰“萃有位”。上则无位，未免泣涕而不安矣。三与上应，上悲而三亦嗟矣。内三爻为地，地之所归不择土壤，《萃》虽众，心不一，故初因之而“号”，三因之而“嗟”，二虽吉犹待引也。外三爻为泽，泽之所《萃》，心自悦矣。五之《萃》，得“永贞”也；四之《萃》，自“无咎”也；上居泽之极，泽满则水溢，故有“涕澺”之象焉。盖惟天民有欲，无主乃乱，万国来会而禹帝，万姓悦服而武兴，人心之所向，即见天命之所归也，故《萃》不可力取，惟在德化也。",
            占:
            "【问时运】气运平顺，但能安不忘危，自得欢乐无忧。\n" +
            "【问战征】兵凶器，战危事，惟能临事而惧，好谋而成，可无意外之虞也。\n" +
            "【问营商】《萃》有财聚之象，然聚必有散，盈必有亏，亦理之循环，所当时时预防。\n" +
            "【问功名】宜由武功得名。\n" +
            "【问婚姻】“匪寇婚媾”，《易》每以寇婚对言，盖防兵祸，犹防女祸也。惟能预防，自可无咎。\n" +
            "【问家宅】泽上于水，防有大水入屋之象。\n" +
            "【问疾病】防胸腹有水胀之症，宜预为调治。\n" +
            "【问行人】中途兵阻，一时难归。\n" +
            "【问六甲】生女。"
        },
        ye:[
            {
                原: "初六：有孚不终，乃乱乃萃。若号，一握为笑，勿恤，往无咎。",
                象: ["乃乱乃萃，其志乱也。"],
                析: "《兑》为孚，故“有孚”；《坤》为终，初失位，故“不终”；《坤》为聚，亦为乱，故曰“乃乱乃萃”。初为《萃》之始，相孚犹浅，是以有初鲜终也；不得其终，则一念萃于此，易一念而萃于彼，其志先乱矣，是萃适以长乱也。《象传》以“志乱”释之，“乃”犹汝也，汝自萃之，汝自乱之也。初爻阴柔居下，虽得众，未足以总之；初与四应，则御萃之权，当在四也。“若”，顺也，“号”，令也，谓顺从四之号令。“一握为笑”，谓推诚相与，众皆欢悦，即《彖传》所云“顺以悦”也。上互《巽》，《巽》为号，下互《艮》，《艮》为执，执手，犹握手，退之所谓“握手出肺肝相示”者是也。《兑》为口，故曰“笑”，既得其笑，故“勿恤”。“往”，往四也，四能恩威并著，初自不致乌合为乱也，故“无咎”。",
                占:
                "【问时运】运当初交，一顺一逆，反复无常，得所救援，可以无咎。\n" +
                "【问功名】忽荣忽辱，由于中心无主也。\n" +
                "【问营商】有初无终，聚散不定，不能获利，仅可免咎而已。\n" +
                "【问战征】统军出征，防有兵变之忧。\n" +
                "【问婚姻】有始乱之，而终娶之之象。\n" +
                "【问疾病】此病忽号忽笑，由于心神昏乱，往而求医，必无咎也。可勿忧。\n" +
                "【问六甲】生女。"
            },
            {
                原: "六二：引吉无咎，孚乃利用禴。",
                象: ["引吉，无咎，中未变也。"],
                析: "二居下卦之中，上应于五，知《萃》之当归于五也。二与初、三为同体，初之“乱”，三之“嗟”，是失所《萃》也，二能引之，同《萃》于五，故曰“引吉，无咎”。上互《巽》，《巽》为绳，下互《艮》，《艮》为手，有引之象。“禴”，夏祭名，六二为《离》爻，《离》南方，为夏，故“利用禴”。二动体《困》，《困》二曰“利用享祀”，《萃》反为《升》，《升》二亦曰“利用禴”，以二得中，故其象同也。《彖》称假庙用牲，二为助祭，助祭当献方物，《坤》为吝啬，故薄，然输诚来《萃》，虽薄亦孚，孚，固不在多仪也。",
                占:
                "【问时运】运得正中，吉。\n" +
                "【问功名】可望汲引而进。\n" +
                "【问营商】“引”，牵引也，想是合众生意，必可获吉，但须答愿酬神。\n" +
                "【问战征】古者出师必祭，于内曰类，于野曰冯是也，盖祭神以誓师也。吉。\n" +
                "【问婚姻】二应于五，是二五订婚也，故曰“引吉”。\n" +
                "【问疾病】仙人辟谷之法，曰引导，为引运其元气，使之充实无亏，即可却疾。\n" +
                "【问六甲】生女。"
            },
            {
                原: "六三：萃如嗟如，无攸利。往无咎，小吝。",
                象: ["往无咎，上《巽》也。"],
                析: "三处《坤》之上，《坤》为众，得《萃》之象。盖《萃》必众心欢悦，其《萃》乃为可用，三以阴居阳，不能统率《坤》众。《萃》者以利而《萃》，《萃》而无利，则《萃》者嗟矣，故曰“萃如嗟如”。卦以五爻为《萃》之宗主，即《彖》所称“利见”之“大人”也，往而归之，有攸利焉。“小吝”者，三无御《萃》之才，致腾众口，为可鄙耳。《传》曰“上巽也”，《萃》上互《巽》，《巽》五曰“无不利”，谓往而可得《巽》之利也。",
                占:
                "【问时运】运途平平，无可获利也。\n" +
                "【问功名】功名不利，反被人鄙。\n" +
                "【问营商】货物虽多，不售可嗟，何所获利？惟转运他处，可得无咎。\n" +
                "【问战征】有兵而不得其用，反致怨嗟，在主将无御众之才也。\n" +
                "【问婚姻】未免兴怨偶之嗟。\n" +
                "【问家宅】同居不睦，致多口舌，往迁可以无咎。\n" +
                "【问疾病】胸膈积滞作痛，致声声叫苦，以两便不利所致，利则可以无咎。\n" +
                "【问讼事】不利。\n" +
                "【问六甲】生女。"
            },
            {
                原: "九四：大吉，无咎。",
                象: ["大吉，无咎，位不当也。"],
                析: "四出《坤》入《兑》，当内外卦之交，为多惧之地，初应之，三比之，开馆招宾，礼贤下士，如汉之王莽曹操，臣而得众，凶莫大焉。爻曰“大吉，无咎”，必其克尽“大吉”之道，乃得“无咎”；必其能立“无咎”之地，乃得“大吉”。若文王三分有二以服事殷，能有其萃，而不自以为萃，必率其萃而归之于君，斯可谓大吉而无咎矣。《象传》于“大吉，无咎”，而犹以“位不当”释之，其旨严矣！",
                占:
                "【问时运】气运大好，无往不吉，但于地位不当，宜慎。\n" +
                "【问功名】大吉，但恐德不称位。\n" +
                "【问营商】得财得利大吉；宜作退一步想，方能有始有终。\n" +
                "【问战征】战胜攻克，大吉大利；防功高震主，谤毁随之。\n" +
                "【问婚姻】四与初为正应，即为正配，吉；但门第恐不甚相当也。\n" +
                "【问家宅】此宅人口兴旺，家室平安，大吉；但地位少嫌卑下。\n" +
                "【问疾病】是外强中干之症，目下可保无咎。\n" +
                "【问六甲】生女。"
            },
            {
                原: "九五：萃有位，无咎，匪孚。元永贞，悔亡。",
                象: ["萃有位，志未光也。"],
                析: "五居尊位，为《萃》之主，故曰“萃有位”；居其位以御其众，故“无咎”。然亿兆之归往在有位，亦不仅在有位也，要必有足以服众者，而众乃中心诚服矣。是《萃》以位，实《萃》以德，以德服人，此之谓“孚”，若徒曰“萃有位”而已，是以权位胁取，非心服也，孚何有焉？“非孚”而《萃》，后且有悔。“元永贞”者，《乾》《坤》之德也，“元”者，《乾》之“长人”，“永贞”者，《坤》之载物，既具此德，则德位兼备，群黎百姓，罔不相应，悔自亡矣。《象传》曰“志未光”，为徒有其位言之耳。按：《比》《彖》亦曰“元永贞”，《比》以一阳统众阴，故“元永贞”言于卦；《萃》虽有二阳而统众阴者，以五为主，故“元永贞”言于五。义各有当也。",
                占:
                "【问时运】得位得权，运当全盛，自可无咎。\n" +
                "【问营商】财则聚矣，信尚未也，能守其正，业自可久。\n" +
                "【问功名】位则高矣，望则隆矣，更宜修德履正。\n" +
                "【问战征】三军既集，大业可成，更宜推诚相与，可保永终。\n" +
                "【问婚姻】位尊金多，可称贵婿。\n" +
                "【问家宅】此宅地位，山环水聚，聚族而居，吉。\n" +
                "【问疾病】心神不定，宜静养。\n" +
                "【问讼事】以讼者爵位隆，声势盛，虽枉得直。\n" +
                "【问六甲】生女。\n" +
                "【问失物】久后可得，无咎。"
            },
            {
                原: "上六：赍咨涕洟，无咎。",
                象: ["赍咨涕洟，未安上也。"],
                析: "“赍咨”，嗟叹之辞。目出曰涕，鼻出曰洟，“赍咨涕洟”，悲泣之状也。上爻阴柔不中，居《萃》之极，三与上为敌应，敌应则无《萃》，孤立于上而安得安乎？知其不安，则忧之深，虑之甚，极之“赍咨涕洟”，悲愁百结，人亦当谅其哀怨而来《萃》也，故得“无咎”。皖江陈氏以“咨”为资财，“赍”为持，谓财聚民散，是有其财而不能有其众，则坐拥厚资，适以自危，如鹿台巨桥，卒供兴王之恩赏，此诚当痛哭流涕者也。其说亦亲切。",
                占:
                "【问时运】人必年老运退，极至穷极悲苦，为可悯也。然必有怜而救援者，得以无咎。\n" +
                "【问营商】孤客无伴，途穷日暮，大可悲虑，幸而得救，无咎。\n" +
                "【问功名】时衰运极，难望成名。\n" +
                "【问战征】有军众叛离，主将孤立之象。\n" +
                "【问婚姻】有生离死别之悲。\n" +
                "【问家宅】仳离啜泣，家室不安。\n" +
                "【问疾病】病自悲泣过甚而来，宜宽怀调养。\n" +
                "【问六甲】生女。"
            },
        ]
    },
    {
        x:"011000",//升
        e:{
            原: " 升：元亨。用见大人，勿恤，南征吉。",
            象: ["地中生木，升。君子以顺德，积小以高大。"],
            彖: ["柔以时升，巽而顺，刚中而应，是以大亨。用见大人，勿恤，有庆也。南征吉，志行也。"],
            析: "卦体《坤》上《巽》下，按《坤》辰在未，未土也，故坤为地，《巽》辰在巳，上值轸，轸主风，故《巽》为风。陆绩云，“风土气也”，《巽》为《坤》所生，故风从地而起，即庄子所云“大块嘘气，其名为风”也。地上风下，盖风起自地下，顷刻而行于天上，有《升》之象。《升》为十二月之卦，阴气下凝，阳气上升，此其时焉。此卦所以名地风《升》也。\n" +
            "通观此卦，卦名取地风，卦象取地木，风从地而起，木自地而出；《巽》为风，亦为木，木与风，其为《升》一也。《升》反《萃》，《萃》《坤》居下，为群众之象，《升》则举于众，而登之民上，是古者论秀书升之制也，故反《萃》为《升》。《彖》辞曰“用见”，曰“征吉”，谓贤士怀抱道德，乐为世用也；曰“大亨”，曰“有庆”，谓朝廷任用俊彦，得奏时雍也。往见者在士，举而用之者在大人，故士之吉，即为大人之吉，大人之“有庆”，亦即为士之庆也。柔依刚而能立，志得《坤》而斯行，《象》曰“积小以高大”，譬如升高，必自卑而登，譬如升阶，必由下而进，盖有愈升而愈上者矣。其大旨惟在“柔以时升”，先时则躁，后时则悔，皆失《升》进之道也。士者出而用世，审时其至要也。《易》之作也，多在殷周之际，周室王化之行，始于二南，所谓征南，是明证也。爻象内三爻为《巽》，初“合志”，二“有喜”，三无疑，是《升》之得其人、得其道也。外三爻为《坤》，四曰“山”，五曰“阶”，六曰“冥”，是《升》有其地、有其时也。总之，二为大人，五应之，则升阶以见；初得允吉，四应之，则恭顺以事；三尚可《升》，六应之，则其《升》已极。卦体《坤》《巽》皆柔，如木初出，枝条柔软，及其干霄直上，自然刚健不屈，所谓“巽而顺，刚中而应”者也。",
            占:
            "【问时运】得春生之气，运途当日进日盛。\n" +
            "【问功名】有指日高升之象。\n" +
            "【问营商】积累锱铢，可渐成富饶巨室。\n" +
            "【问战征】宜平地架列木梯，可以登高攻城。\n" +
            "【问婚姻】顺为妇德，有以妾作嫡之象。\n" +
            "【问家宅】此宅初时低小，近将改造大厦。\n" +
            "【问疾病】是肝木春旺之症，若不顺气宽养，势将日积日重，颇为可危。\n" +
            "【问货价】有逐步腾贵之象。\n" +
            "【问秋收】风雨调顺，年谷丰登。\n" +
            "【问行人】一路顺风，且积蓄颇丰。\n" +
            "【问六甲】生女。"
        },
        ye:[
            {
                原: "初六：允升，大吉。",
                象: ["允升，大吉，上合志也。"],
                析: "初居《升》之始，为《巽》之主，《升》者下也，而允其升者上也，上允其升，则《升》之志遂矣。上互《震》，《震》雷出地，声闻百里，有《升》之象；下升上允，志同道合，吉莫大焉。《晋》六三曰“众允”，下为二阴所信；《升》初六曰“允升”，上为二阳所信。以阴信阴，悔亡而已，以阴信阳，乃得大吉。",
                占:
                "【问时运】运途大顺，求名求利，无不如志，大吉。\n" +
                "【问功名】一举成名，大吉。\n" +
                "【问营商】货价高升，大可获利。\n" +
                "【问战征】升高窥望，得识敌情，一战可得胜也，大吉。\n" +
                "【问婚姻】两姓允合，大吉。\n" +
                "【问家宅】有出谷迁乔之兆，吉。\n" +
                "【问疾病】爻象本吉，于问病独非吉兆，惟在下痢下陷等症，则吉。\n" +
                "【问讼事】宜上控，吉。\n" +
                "【问六甲】生女。"
            },
            {
                原: "九二：孚乃利用禴，无咎。",
                象: ["九二之孚，有喜也。"],
                析: "二居《巽》之中，备刚中之德，即为“用见”之“大人”。初欲升五，必先历二，以求孚于二也。古者求贤审官，得人则告诸宗庙，二既孚初之《升》，特为斋祓以进之。上互《震》，《震》为祭，故“用禴”。《巽》，孟夏之月，“禴”，夏祭，“用禴”者，取“柔以时升”之义也。“禴”，祭之薄者，然输诚求升，虽薄亦孚，在诚不在物也，故“无咎”。《象传》曰“有喜”，即《彖传》所云“有庆”也。《萃》六二以柔应五之刚，《升》九二以刚应五之柔，其至诚感应，则一也，故爻象“用禴”同，“无咎”亦同。",
                占:
                "【问时运】运途得中，必有喜事临门。\n" +
                "【问营商】商业全凭信实，有信卖买进出，无诈无虞，自能永远，且可获利。\n" +
                "【问功名】定有泥金报喜。\n" +
                "【问战征】出师必祭，信为兵家之要，得信则三军一心，无战不克矣。\n" +
                "【问婚姻】二五交孚，阴阳合德，大喜。\n" +
                "【问家宅】主有喜兆。\n" +
                "【问疾病】宜祷。\n" +
                "【问六甲】单月生男，双月生女。"
            },
            {
                原: "九三：升虚邑",
                象: ["升虚邑，无所疑也。"],
                析: "《升》之三，《巽》之终，《坤》之始也，《坤》为虚，亦为邑，故曰“升虚邑”。《说文》：“虚，大邱。九夫为井，四井为邑，四邑为邱”。邱，谓之虚，《诗》“升彼虚矣”，虚，即墟也。墟为空旷高地，由井升邑，由邑升虚，可见“积小以高大”，历试诸艰，胜任愉快，地日辟而日大，位日进而日高。《象传》曰“无所疑”，信乎三之《升》，《升》之得其任矣。征诸太王居岐，一年成邑，二年成都，三年五倍于初，爻所言升虚升邑，盖谓此也。《升》卦爻象三、四、五三爻，皆隐指周室之事。",
                占:
                "【问时运】目下运途恰好，渐进渐盛。\n" +
                "【问营商】市廛谓之趁虚，言就虚地，会集货物而成市邑，可见商业日盛也。\n" +
                "【问功名】《升》本发达之象，初方“允”，二则“孚”，至三则已升而在上，可无疑也。\n" +
                "【问战征】经此兵燹，城邑空虚，“升虚邑”，夺取空城矣。\n" +
                "【问家宅】有前空虚，后富实之象。\n" +
                "【问婚姻】“虚邑”，犹空房也，不吉。\n" +
                "【问疾病】必是虚弱之症无疑。\n" +
                "【问失物】不得。\n" +
                "【问六甲】九三阳爻，生男。"
            },
            {
                原: "六四：王用亨于岐山，吉无咎。",
                象: ["王用亨于岐山，顺事也。"],
                析: "岐山为周发祥之地，太王迁之，文王康之，时告祭乔狱，岐山当必在其内也。盖天子祭天地，诸侯祭其境内之山川。“亨于岐山”，岐山在周境内，周先王实主其祀焉。称王者，追王之谓也。迁岐山之始，避狄而来，而积小高大，遂成为王业之基，吉何如也！《象传》以“顺事”释之，盖隐指文王服事之诚，有顺德，无二心也。此周公不言之旨，合前后爻象观之，而可知矣。",
                占:
                "【问时运】事顺适，吉而无咎。\n" +
                "【问战征】古者祷战，祈克于上帝，然后接敌，此即用享之义也。享而后战，其必克矣，吉。\n" +
                "【问营商】货物之生也，多取于山林川谷之间。祭法，民之取财用者，必祭之。谓祭之可获利也。吉。\n" +
                "【问功名】“亨于岐山”，易侯而王，大吉之兆。\n" +
                "【问家宅】宜祭告宅神，吉。\n" +
                "【问疾病】宜祷。\n" +
                "【问六甲】生女。"
            },
            {
                原: "六五：贞吉，升阶。",
                象: ["贞吉，升阶，大得志也。"],
                析: "五以《坤》德居中，位极其尊，《象传》所称“君子以顺德，积小以高大”，惟五当之。“阶”，天子之阼阶也，升之于阶，尊之至焉。然不正则为新莽，为曹操，其何能吉？古来必如大舜之有鳏在下，侧陋明扬，以至命陟帝位，爻曰“贞吉”，《象》曰“大得志”，惟舜有之矣。而作《易》之旨，则隐指西伯方百里起，终受周命之事也。",
                占:
                "【问时运】平生志愿，无不得遂，大吉之兆。\n" +
                "【问功名】拾级而登，荣宠已极。\n" +
                "【问营商】五为中数，凡营财之道，不宜过盈，以得中为吉，故曰“贞吉”。\n" +
                "【问战征】凡攻城，必用梯阶，所以升高也。城必可克，故吉。\n" +
                "【问婚姻】五与二相应，爻曰“升阶”，有攀结高亲之象，故二曰“有喜”。\n" +
                "【问疾病】《升》，增也，病不宜升，乱阶厉阶，皆非吉兆。\n" +
                "【问讼事】讼本凶事，是谓祸阶，升阶则讼愈凶，何以得吉？\n" +
                "【问失物】当就阶墀间寻之。\n" +
                "【问六甲】生女。"
            },
            {
                原: "上六：冥升，利于不息之贞。",
                象: ["冥升在上，消不富也。"],
                析: "上居《坤》之极，《升》至于上，《升》无可升矣。如日之升，朝而日出，昼而日中，暮而日入，“冥”，则昏暮也，《坤》为冥，故曰“冥升”。“不息”者，昼夜循环之谓也，今日月没，明日复升，故曰“利于不息之贞”。《坤》曰“永贞”，即“不息之贞”也。在人之升，至上则禄位已尽，魂升魄散，归入幽冥之域，凡生前富贵利达，消归无有，惟此道德勋名，足以流传于不息耳，故《象传》以“消不富”释之，此之谓也。",
                占:
                "【问时运】好运已过，且待后运重来，可以得利。\n" +
                "【问战征】有率军夜进，误入幽谷之象，利于息，待天明可出险也。\n" +
                "【问营商】防有人财两失之患。\n" +
                "【问功名】《升》至于上，功名已显，防身后萧条。\n" +
                "【问婚姻】恐不得偕老。\n" +
                "【问家宅】宅运已过，势必中落。\n" +
                "【问疾病】大象不利，“冥升”者，魂升于天也。\n" +
                "【问六甲】生女，恐不育。"
            },
        ]
    },
    {
        x:"010110",//困
        e:{
            原: "困：亨，贞，大人吉，无咎。有言不信。",
            象: ["泽无水，困。君子以致命遂志。"],
            彖: ["困，刚揜也。险以说，困而不失其所亨，其惟君子乎？贞大人吉，以刚中也。有言不信，尚口乃穷也。"],
            析: "卦体本《乾》《坤》《否》，《坤》以上一阴往《乾》，成《兑》，《乾》以中一阳来《坤》，成《坎》，是为《兑》上《坎》下。易位为《节》，《节》《象》曰“泽中有水”，言泽能节水，不使漏溢，有滋润，无枯涸也。反是为《困》，泽在水上，则水无所节，随泻随下，而泽涸矣。上互《巽》，《巽》为木，泽竭则木槁；下互《离》，《离》为日，“日以烜之”，则水益涸。《序卦传》曰：“升而不已必困，故受之以困。”夫有升必有降，升而不降，上愈升，下愈竭，竭则困，故名其卦曰《困》。\n" +
            "通观此卦，按《蹇》、《需》、《困》三卦，皆处险：《蹇》“险而能止”，足以避难；《需》险而不陷，义不至穷；《困》卦上下三刚，为柔所揜，而无所容，是《困》也。《彖传》之旨，以险而悦，困而亨，爻象之义，以往为凶，来为吉。往者自下往上，来者自上来下，来者龃龉而不得合，往者内外互塞。初之“株木”障内；三之“蒺藜”拒中；上之“葛藟”蒙上。九二在险，九五同德，为拯困之主，而为四所隔，四与初应，而为二所隔，必待四来初，而五乃得与二合。苟三之“蒺藜”不去，则四未得行；上之“葛藟”不去，则五亦未得通。故《困》之害在三上，三上去而可无忧于初矣。总之，《困》之者柔，而为其所困者刚也，即《彖传》所谓“刚揜”也。岂知刚《困》而柔亦《困》，刚《困》为“酒食”，为“金车”，为“朱绂”，悦而在下，《困》亨之象；柔《困》为木石，为“蒺藜”，为“葛藟”，险而在上，困人之象。惟其险而能悦，则险不为陷，法《坎》之信，《坎》可以济，得《兑》之悦，《困》可以亨。彼“酒食”、“朱绂”、“金车”，即从木石、“蒺藜”、“劓刖”、“葛藟”而来，其百般而磨折者，正所以试历而成就之也。困愈深，成愈大，孟子所论“天降大任”一章，可作为《困》卦之注脚。",
            占:
            "【问时运】困穷至此，宜自安命。\n" +
            "【问战征】是为孤城危急之时，惟竭力图存，生死在所不计也。\n" +
            "【问功名】名成则身难保，身存则名恐败，惟善自处之。\n" +
            "【问营商】资财既竭，时事又危，爻取往凶来吉，不如归来，得可免困。\n" +
            "【问婚姻】《彖》曰“刚揜”，男必夭命，女必守寡。易位为节，女必能守节成名。\n" +
            "【问家宅】宅中有枯井，防致损命。\n" +
            "【问讼事】不特讼不能直，且防因讼损命。\n" +
            "【问行人】在外困苦不堪，且有生命之忧。\n" +
            "【问疾病】肾水亏弱，症象已危。\n" +
            "【问失物】坠入深潭之下，不可复得。\n" +
            "【问六甲】生男。"
        },
        ye:[
            {
                原: "初六：臀困于株木，入于幽谷，三岁不觌。",
                象: ["入于幽谷，幽不明也。"],
                析: "《坎》为臀，初处内卦之下，臀在人身之下，取《坎》下之象。《象传》曰“泽无水”，为漏泽，臀之象亦漏下。《坎》于木为坚多心，“株木”为根在土上者，最在低下。人以臀为下，木以株为下，故为“臀困于株木”。凡人间居失业，谓之株守，可以为证。《兑》为谷，为幽，《坎》为入，为穴，为陷，阴爻亦为穴，“入于幽谷”，是陷《坎》之底。《兑》为见，《坎》为三岁，《坎》伏《兑》下，自初至四，历三爻而《兑》始见，故曰“入于幽谷，三岁不觌”，皆从《坎》为隐伏取象。《象传》以“幽不明”释之，“幽”，暗也，人当困厄之来，宜审机度势，择地而蹈，冀可免厄。“困于株木，入于幽谷”，是困上加困也，亦因其不明所致也耳。",
                占:
                "【问时运】厄运初来，渐入苦境，三年后可望顺适。\n" +
                "【问战征】兵陷险地，如司马氏军入葫芦谷。\n" +
                "【问营商】是贩运材木生意，木在深谷，困于发运。\n" +
                "【问功名】卑下之象，名必不显。\n" +
                "【问家宅】宅在深山，人迹罕到，宜于幽人。\n" +
                "【问疾病】“株木”“幽谷”，有棺椁山丘之象，凶。\n" +
                "【问婚姻】男家卑微，恐有遇人不淑之叹。\n" +
                "【问行人】三年后可归。\n" +
                "【问六甲】生男。"
            },
            {
                原: "九二：困于酒食，朱绂方来，利用享祀。征凶，无咎。",
                象: ["困于酒食，中有庆也。"],
                析: "三、四、五三爻为刚，皆困于富贵者也。二与五应，二所云服饰祭享，与五爻同，五虽未言“酒食”，有祭享必有酒食，义亦可通。《坎》五曰“樽酒簋贰”，故有酒食象。《困》三阴三阳，卦自《乾》《坤》来，《乾》为衣，亦为朱，《坤》为裳，故有朱绂象。二动体为《萃》，《萃》二曰“利用禴”，故有享祀象。按：绂，蔽膝祭服；一作韨，《玉藻》曰：“一命组韨幽衡，再命赤韨幽衡，三命朱绂葱衡。”二为大夫，故祭服用朱绂。二得乾气，方膺大夫之命，故曰“方来”。“酒食”“朱绂”，谓膏梁足以伤生，文绣因而溺志，富贵之困人，即所谓死于安乐者是也。君子知之，不以酒食自养，不以朱绂自耀，而用诸祭祀，则俎豆馨香，孝孙有庆矣。“征凶”者，以斯而征，坎险在前，为三所阻，故“凶”；幸二居《坎》之中，故得“无咎”，是以《彖传》即以“中有庆”释之。",
                占:
                "【问时运】爻象富贵，运非不佳，惜其不知撙节，反为富贵所困也。\n" +
                "【问战征】防有因酒食误事，遂致败北，主将困而招褫绯之辱。\n" +
                "【问营商】因商起家，膏梁文绣，足以荣亨，但再往则有凶也。\n" +
                "【问功名】功名已显，但恐为功名所困耳。\n" +
                "【问疾病】是逸乐过甚，醉饱无度。宜祷。\n" +
                "【问家宅】是富贵之家，住宅六神不安，宜虔祭告。无咎。\n" +
                "【问婚姻】聘礼始备，彩礼方来，一说即成。\n" +
                "【问六甲】生男。"
            },
            {
                原: "六三：困于石，据于蒺藜，入于其宫，不见其妻，凶。",
                象: ["据于蒺藜，乘刚也。入于其宫，不见其妻，不祥也。"],
                析: "初、三、上三爻为柔，皆困于患难者也。柔爻象取草木，三与上应，三曰“蒺藜”，上曰“葛藟”，其象相近。三居《坎》之极，互体为《艮》，《艮》为小石，《象传》谓“泽无水”，无水之地，泥土皆成砂碛，有石之象，故曰“困于石”。《坎》为蒺藜，蒺藜，草之有刺者也。军中有铁蒺藜，形似蒺藜，以铁为之，布之于地，使敌不能前进。三爻陷下，乘二之刚，欲进不能，欲退不得，有似“据于蒺藜”。《坎》为宫为入，《兑》为少女，有妻之象，亦为见。三动体为《大过》，二曰“女妻”，五曰“老妇”，三则曰“栋挠”，则宫崩矣。宫之中已阒无人，何有于“女妻”，何有于“老妇”？故曰，“入于其宫，不见其妻”。《系辞》谓“非所困而困，名必辱，非所据而据，身必危”，辱且危，故凶。《象传》以“乘刚”释据“蒺藜”，以三乘二之刚也，以“不祥”释入其宫；以不见妻为凶也。",
                占:
                "【问时运】命运尴尬，进退两难，凶。\n" +
                "【问战征】上布矢石，下设陷阱，前进则身多危，后退则膏已陷，大凶之象。\n" +
                "【问功名】身将不保，奚以名为？\n" +
                "【问营商】卜例，妻为财爻，宫即命宫，既丧其命，又失其财，大凶。\n" +
                "【问疾病】《系辞》曰“死期将至”，知病不可救也。\n" +
                "【问婚姻】防有悼亡之戚。\n" +
                "【问失物】不得。\n" +
                "【问讼事】必散。\n" +
                "【问六甲】生男。"
            },
            {
                原: "九四：来徐徐，困于金车。吝，有终。",
                象: ["来徐徐，志在下也，虽不当位，有与也。"],
                析: "《兑》为金，《坎》为车，九四《震》爻，辰在卯，上值房，石氏曰“房主车驾”，故有金车之象。四与初应，故相往来。“徐徐”，舒迟之状；初居最下，四自外来，为二所间，疑惧不前，故曰“来徐徐”。四为诸侯，得乘金车，是亦乘刚而困于富贵者也。困于《坎》宫，困在身，困于富贵，困在心。四知初之困于柔，若不知已之困于刚也，乘此金车，徐徐来往，而不能以济困，车殆马烦，徒自苦耳，故“吝”。以阳居阴，为履不当位，然虽无二五之中，而自有二五之刚，惟刚足以自立，四得其刚，而二五复为推挽，庶几相与有成，岂至终“困于金车”哉！故曰“有终”。是以《象传》以“有与”释之。",
                占:
                "【问时运】运非不好，但地位不当，致多疑惧，未免为人所鄙。\n" +
                "【问战征】迟缓不进，以致车辙靡乱，幸得救援，不至终败。\n" +
                "【问营商】办事不力，致运载货物，中途失陷，急救得全。\n" +
                "【问功名】始困终亨。\n" +
                "【问家宅】地位不当，为间分间隔，不能联合，待迟缓乃佳。\n" +
                "【问婚姻】缓缓可成。\n" +
                "【问疾病】病势迟缓，已非一日，想是驰驱劳顿致损。爻曰“有终”，其命永终矣。\n" +
                "【问失物】想遗落车中，寻之可得。\n" +
                "【问讼事】迁延已久，今始可罢。\n" +
                "【问六甲】生女。"
            },
            {
                原: "九五：劓刖，困于赤绂，乃徐有说，利用祭祀。",
                象: ["劓刖，志未得也。乃徐有说，以中直也。利用祭祀，受福也。"],
                析: "《兑》为毁折，亦为刑人，劓截其鼻，刖断其足，古之所谓肉刑也。五居尊位，为《困》之主，是主刑者也。至治之朝，政简刑清，君民相得，不为无耻之幸免，而为有耻之且格，斯可谓之得志矣。若惟恃劓刖之用，自矜明察，上邀受服之荣，下蒙赭衣之苦，槛车毳衣，徒见其困而已，故“困于赤绂”，系诸“劓刖”之下也。《兑》为口，“乃徐有说，”弼教之道，以渐而入，故曰“徐”。知用刑之不得其志，则齐之以刑，不如道之以德，此为教化之渐；而仁义之流，非独肌肤之效也。道惟在于中直，中则无偏，直者无枉，以此中直而临民，即以此中直而事神，则服赤绂而荐馨香，而来亨来格，降尔遐福，斯困于人者，必不困于天矣，故曰“利用祭祀”。《象传》以“受福”释之，九五阳爻属《乾》，《乾》为福，福自《乾》来，既所谓自天受之也。",
                占:
                "【问时运】命运刚强，刚则必折，防有损伤。作事宜筹度舒迟，乃可变祸为福。\n" +
                "【问营商】货物底面，防有溃烂损伤，须拆看收拾，徐徐出售，无咎。\n" +
                "【问功名】防富贵后，致有刑伤，宜祷。\n" +
                "【问战征】主败，须徐缓收兵，可图后胜。\n" +
                "【问家宅】家业却好，主家人有烂鼻跛足之患，宜祈祷。\n" +
                "【问疾病】病在头足，徐徐调养，求神医治，可愈。\n" +
                "【问婚姻】主有残疾，始不合意，后得完好。\n" +
                "【问讼事】防有刑狱之灾，须徐徐辩白，方可免罢。\n" +
                "【问行人】在外有灾，宜祷，后可得意而归。\n" +
                "【问失物】必有破伤，久后可以寻获。\n" +
                "【问六甲】生女。"
            },
            {
                原: "上六：困于葛藟，于臲卼，曰动悔，有悔，征吉。",
                象: ["围于葛藟，未当也。动悔有悔，吉行也。"],
                析: "《兑》为附决，孔颖达曰，“附决为果瓜之属”，故有葛藟之象。上六居《兑》之极，与初三并为阴爻，故象取草木，是谓困于患难者也。上六去《坎》己远，似可出幽谷而迁乔木矣，乃重柔不中，不能自立，如葛藟之附物蔓延，摇宕不安，故臲卼。臲卼，不安之状；一作杌陧，文异而音义通也。欲脱此困，非动不可，然动则不能无悔，故曰“动悔”；惟知其动之有悔，而审慎以出之，正将因悔以求全，转以有悔而可往。盖道以穷而始达，境由苦而得甘，此迁善所以必先悔过也。由此以往，往无不吉，故曰“吉”。《象传》一则以“未当”释之，谓其为柔所困，柔“未当也”；一则以“吉行”释之，谓其以动得悔，悔亦吉也。",
                占:
                "【问时运】目下苦运已终，本可脱难，缘其心神不安，未能立作变计，一旦改悔，即可获吉。\n" +
                "【问功名】困穷既久，行将风云变动，一举成名。吉。\n" +
                "【问营商】“困于葛藟”，必是包扎货物，久不得售，今当时价发动，即可获利。吉。\n" +
                "【问战征】爻曰“征吉”，《象》曰“吉行”，其中虽有灾悔，定可因悔得吉也。\n" +
                "【问疾病】此病必缠绵已久，神志不安，当迁地静养，自然痊愈。\n" +
                "【问家宅】此宅已旧，藤葛丛生，栋柱倾斜，宜动工改作，乃吉。\n" +
                "【问婚姻】其中防有瓜葛未清，看其动静如何，一动之后，斯可成就。吉。\n" +
                "【问讼事】缠绕未休，致多臲卼，必待断结，乃可无事。\n" +
                "【问行人】一时被事纠缠，难归。\n" +
                "【问失物】被物绕住，不见，必移动后，乃可寻获。\n" +
                "【问六甲】生女。"
            },
        ]
    },
    {
        x:"011010",//井
        e:{
            原: "井：改邑不改井，无丧无得，往来井井。汔至，亦未繘井。羸其瓶，凶。",
            象: ["木上有水，井。君子以劳民劝相。"],
            彖: ["巽乎水而上水，井养而不穷也。改邑不改井，乃以刚中也。汔至，亦未繘井，未有功也。赢其瓶，是以凶也。"],
            析: "卦体《坎》上《巽》下，《巽》为风，亦为木，风善入，木善出，《巽》在《坎》下，是入水又能出水，有桔槔之象焉。《坎》为水，亦为穴，穴地出水，是为《井》也。卦自《困》来，《困》则泽涸，故“无水”，反之则有水。《坎》又为平，水之平莫如井，此卦之所以名《井》也。\n" +
            "通观此卦，《井》反《困》，《序卦传》曰：“困乎上者必返下，故受之以井”。《杂卦传》曰：“井通而困相遇也。”易位为《涣》，《涣》《传》曰“乘木有功”，《井》之取桔槔而不取舟，其用《巽》木一也。旁通为《噬嗑》，《噬嗑》，养也，有井养之义。下卦为《革》，《革》者，改也，有“改邑不改井”之象。要之，《井》为井，汲之而不穷也，其用取诸养，得地而不改也；其德在夫刚中，或汲或不汲，于井固无得丧也。此汲而彼亦汲，一任人之往来也，苟舍其繘，羸其瓶，以为井不可食也，是自弃其井矣，《井》固无咎，而汲者凶焉。卦体全象主《坎》，是为井中之象，阴虚为出汲之口。初阴在下，故为“井泥”；二承阳无《坎》，故为“敝漏”；三得位应上，故为“受福”；四修德补过，故为“井甃”；五阳刚中正，故为泉美，六进养功成，故为“井收”。以卦时论之，《巽》初当春夏之交，水潦混浊，故《井》有泥；二当《离》夏，而水多鱼。三四两爻为秋，秋水澄清；三为《坤》，泉泄地上；四为《兑》，故其毁折。五六冬也，故《井》寒冽；上爻终《坎》，为水养之终也。大抵下卦坎水流行东南，失时不遇，故不吉；上卦水归西北，得其方位，故多吉。",
            占:
            "【问时运】目下交木水相生之运，正可相助成事。\n" +
            "【问战征】有水灭木之象，水军有厄，宜劳力相助，可以出险。\n" +
            "【问功名】“木上有水”，有得春雨发生之象，功名可望。\n" +
            "【问营商】有利过于本之象，吉。\n" +
            "【问家宅】此屋栋柱，恐有水湿溃烂之患，宜急修葺。\n" +
            "【问婚姻】《坎》男《巽》女；男上于女，阴阳之正也，吉。\n" +
            "【问疾病】肾水暴溢，宜急调治。\n" +
            "【问六甲】生男。"
        },
        ye:[
            {
                原: "初六：井泥不食，旧井无禽。",
                象: ["井泥不食，下也。旧井无禽，时舍也。"],
                析: "“旧井”者，坏而不治之井也；“禽”者，辘轳之轴，运繘者也，轴上刻以禽形，故曰“禽”。或谓轴转之音，似禽鸣也。初居最下，象井底，水涸泥污，故曰“井泥不食”，成为废井，井久有毒，故人不食。其井既废，则辘轳之禽，亦腐朽而无有矣，故曰“旧井无禽”。《象传》以“下也”释“井泥”，谓泥在井下，故不可食，以“时舍”释“旧井”，谓井已废旧，故为时所舍。按：《鲁语》“取名鱼，登川禽”，韦昭注：川禽，鳌蜃之属。《易林》《遁》之《井》曰：“老河空虚，旧井无鱼。”此无禽即蜃蛤鱼蛙之类，说亦有据。",
                占:
                "【问时运】为时过运衰，不为世用。\n" +
                "【问战征】有兵器朽旧，不克制胜之患。\n" +
                "【问营商】货物陈腐，不可贩售。\n" +
                "【问功名】年老无用。\n" +
                "【问疾病】是旧症也。不治。\n" +
                "【问婚姻】人品卑下，虽属旧亲，不成。\n" +
                "【问讼事】必不得直。\n" +
                "【问六甲】生男，防难育。"
            },
            {
                原: "九二：井谷射鲋，瓮敝漏。",
                象: ["井谷射鲋，无与也。"],
                析: "“井谷”者，泉穴也。《汉书·沟洫志》，“井下相通行水为井渠”，井固有旁穿孔穴，二动体《艮》，《艮》为穴也。“鲋”，鱼之小者，《子夏传》谓虾蟆。《井》五月之卦，故有虾蟆；《尔雅翼》，“鲋，鰿也”，今作鲫。二体《巽》，《巽》为风，风主虫，虾蟆与鱼，要皆不离夫介鳞虫类。“射鲋”者，古有射鱼，《淮南子·时则训》，“季冬之月，命渔师始渔，天子亲往射鱼”；《史记》：“秦始皇至芝罘射，得巨鱼。”井谷无巨鱼，所射者鲋耳。“瓮”，盛水之器，与瓶相类，二至四互《兑》，象《兑》口，《巽》在下，象底穿，故曰“瓮敝漏”，即《彖》所谓“羸其瓶”也。盖《井》之为水，以上汲为功，而谷水下注，如敝瓮之无底者，复何与于井养之功哉！而徒以射鲋为能，故君子所不取也。",
                占:
                "【问时运】所得者小，所失者大矣。\n" +
                "【问战征】误中敌计，军入幽谷，致破釜缺养而不得出。\n" +
                "【问功名】弋获虚名，其何能久？\n" +
                "【问营商】为贪意外之财，致失本分之利。\n" +
                "【问婚姻】门地卑微，声名残败，不佳。\n" +
                "【问家宅】此宅有废井，井口残破，水不可食。\n" +
                "【问疾病】是下漏之症，医治可愈。\n" +
                "【问失物】物已敝败，得亦无用。\n" +
                "【问六甲】生男，防此儿有残疾。"
            },
            {
                原: "九三：井渫不食，为我心恻。可用汲，王明，并受其福。",
                象: ["井渫不食，行恻也。求王明，受福也。"],
                析: "“渫”，治也，谓治井而不停污也。初则“泥”，二则“漏”，三居《巽》之终，《巽》有洁齐之义，故为“井渫”。渫则泥去，漏塞，清洁可食。其有不食者，非井之咎也，犹人澡身浴德，惠泽足以养人，当局者莫之知，旁观者知之矣。“我”，则旁观自谓也，谓如此清泉，而竟弃之如遗，我则为之心侧矣。井既浚治，则可汲而用者，莫如此井也，此而不用，不明甚矣，安得明王出而用之也？是众人祈祷而求其用者也。“王”指五，三至五互《离》，故为明王。阳为福，喻王者登用贤才，则德泽单敷，遐迩受福，贤者之福，即明君之福，亦天下之福也。“并受其福”，是一井之利，遍及万家也。\n" +
                "（附言）《井》为《震》宫五世之卦，凡问疾厄，得下卦多不治。下卦变则瓶体破，不能汲水，即《彖》辞所谓“羸其瓶，凶”。补治其破，犹病者得医而治也，凶尚可救。其象如此，余二十年来，屡占屡验，无一或爽。",
                占:
                "【问时运】怀才不用，命为之也。\n" +
                "【问战征】兵器既修，士卒可用，惜无主将，以致士气颓丧，为可惜也。\n" +
                "【问营商】明见货物辐辏，可以获利，不知贩运，徒诿无用耳。\n" +
                "【问功名】有才无命，为世所弃；两年后至五爻，可望登用。\n" +
                "【问婚姻】目下不成，至五爻必得成就，须在二年后也。\n" +
                "【问家宅】此宅必有旧井久湮，宜渫治之。得食此水，一家获福，若不渫不食，大为可惜。\n" +
                "【问疾病】必是心神不安之症，宜饮症泉可愈。\n" +
                "【问六甲】生男。"
            },
            {
                原: "六四：井甃，无咎。",
                象: ["井甃无咎，修井也。"],
                析: "“甃”者，以砖垒井，防井之败坏者也。此卦三阳为泉，三阴为井，初六最下，曰“泥”，上六最上，曰“收”，四居其间，不失其正，故曰“甃”。凡井之坏，坏于污浊不修，而井遂至于无用，四能甃之，故得“无咎”。有四之甃乃得有五之“寒泉”，是助五以养人，皆赖四之甃也。甃井之功，不可为不大矣。",
                占:
                "【问时运】正当运途改变之时，宜自修饬，不特无咎，可望上进。\n" +
                "【问营商】宜整理旧业，自可获利。\n" +
                "【问功名】修身立名，二三年后，可大得志。\n" +
                "【问战征】诗云“修我矛戟，与子偕作”，在此时也。\n" +
                "【问婚姻】尚须待时。\n" +
                "【问家宅】此宅宜改修为吉。\n" +
                "【问六甲】有弄瓦之象，生女。"
            },
            {
                原: "九五：井洌寒泉食。",
                象: ["寒束之食，中正也。"],
                析: "“冽”，水清也，井水在上，故冽。五为《坎》之主，位居中正，《坎》为寒泉，辰在子，子水也，属北方，故寒。按水之性，冬则温，夏则寒，是阴中纳阳，阳中纳阴，其性然也；《井》为五月之卦，是以冽而且寒。孟子曰，“夏日饮水，冬日饮汤”，当此仲夏，汲此寒泉而食之，为得其时焉。盖《井》自三“渫”之，四“甃”之，则“泥”去“漏”塞，而五之“寒泉”乃出，复之者众，斯受福者亦众矣。王者德润生民，遍及万方，亦如是耳。《井》旁通为《噬嗑》，“《噬嗑》，食也”，故曰“井冽，寒泉食”。",
                占:
                "【问时运】家道必寒，幸运得其时，可望进用。\n" +
                "【问营商】井出寒泉，喻言财源之长也，可望获利。\n" +
                "【问功名】品行中正，可享鼎养之荣。\n" +
                "【问家宅】有廉泉让水之风。\n" +
                "【问婚姻】家风清白，同甘共苦，夫妇之正也。\n" +
                "【问疾病】是外寒内热之症，宜服寒凉之剂。\n" +
                "【问六甲】生女。"
            },
            {
                原: "上九：井收勿幕，有孚元吉。",
                象: ["元吉在上，大成也。"],
                析: "“收”，谓辘轳收缩。“幕”井盖也，“勿幕”者，即《彖》所云“往来井井”，汲者众多，无昼无夜，取之不竭：在井固不擅其有，不私其利，任人汲灌，故“勿幕”也。上居《坎》之极，偶画两开，有“勿幕”之象。“孚”，指五，五为“王明”，能用汲者也。“元吉”，元，大也，谓井之利大，故吉亦大。“在上”者，谓上在井口，养人之功，从此而出。“大成”者，谓井养之道，至此而大成矣，凡爻辞阴柔在上，多不吉，在上“元吉”，惟《井》一卦而已。",
                占:
                "【问时运】功德在世，信用在人，“大成，“元吉”，运之极盛者也。\n" +
                "【问功名】有大用大受之象，非一官一邑之微也。\n" +
                "【问营商】商务会集，利益浩繁，可久可大，无往不吉。\n" +
                "【问婚姻】上应在三，三曰“并受其福”，知两姓皆吉。\n" +
                "【问战征】凡军将发则撤幕，“勿幕”，即撤幕前进也。一战功成，故曰“大成”。吉。\n" +
                "【问疾病】幕亦作暮，言旦夕可即愈也，吉。\n" +
                "【问六甲】生女。"
            },
        ]
    },
    {
        x:"101110",//革
        e:{
            原: "革：己日乃孚。元亨利贞，悔亡。",
            象: ["泽中有火，革。君子以治历，明时。"],
            彖: ["革，水火相息，二女同居，其志不相得，曰革。己日乃孚，革而信之，文明以说，大亨以正，革而当，其悔乃亡。天地革而四时成，汤武革命，顺乎天而应乎人，革之时大矣哉！" ],
            析: "卦体泽渗下，火炎上，泽动则上者欲下，火动则下者欲上，上下相争，则不相得，不相得则不能不革。《革》之卦自《井》来，《井》《彖》首言改，改，犹革也。《革》反为《鼎》，《鼎》三曰“鼎耳革”，是《鼎》亦取《革》之象。《革》易位为《睽》，《睽》五曰“噬肤”，革为皮，肤亦皮也，是《睽》亦有《革》之义。卦象《兑》泽《离》火，上互《乾》，谓之金生水，下互《巽》，谓之木生火，合之谓金克木，水克火，上下相克，相克必相革。《洪范》曰，“金曰从革”，《兑》西方之卦，属金，故名其卦曰《革》。\n" +
            "通观此卦，卦自《困》来，时穷世困，天下之乱久矣，幸而出《困》入《井》。《井》者，养也，《井》《彖》曰“改邑不改井”，是知邑可改，而养不可改也。不可改，故必先养其元气，待养之既成，而后可从事于改矣，故《井》先于《革》。《杂卦传》曰，“革去故也，鼎取新也”，取新必先去故，故《鼎》后于《革》。古来处革之世，而善用其革者，莫如汤武，汤武之革，非汤武为之，时为之也，顺夫天，应夫人，天人交孚而革乃成矣。下卦三爻，文明以革，初爻未至己日，未可用革；二爻正中己日，乃可用革；三爻革事已成，无容前往矣。上卦三爻，革而成悦，四受天命，五正天位，六天下化成，无不悦服矣。是水得土而受革于人也，故《彖》辞首曰：“己日乃孚”。以卦言之，则《离》革《兑》，以爻言之，则阳革阴。《革》之道，首重夫信，《革》之事，惟求其当。而所以革者，贵得夫时，是以天地不能未春而革夏，未秋而革冬。四时之革，皆应夫时，可革而革，此革之时，所以为大也。",
            占:
            "【问时运】譬如有水之处，忽而出火，是气运之反常也，宜顺时改变，乃吉。\n" +
            "【问战征】屯兵之地，防溪谷林木间着火，最宜谨慎。\n" +
            "【问营商】《兑》为金，金入火则金熔矣，消耗之象。宜迁地贸易，乃可无咎。\n" +
            "【问功名】龙门变化，烧尾之象，吉。\n" +
            "【问婚姻】卦体上泽下火，泽有火，是水被火所制，夫为妻所制也。革者有出妻改娶之象。\n" +
            "【问家宅】此宅防有火灾，急宜改迁。\n" +
            "【问疾病】是肾水枯涸，肝火上炎之症，宜改延良医，顺时调养。\n" +
            "【问讼事】此事本无中生有，灾自外来。宜改易讼词，揆度时日，其辩自明，其讼得直。\n" +
            "【问六甲】生女。凡占此卦，皆女象，惟出月过时，变则成男。"
        },
        ye:[
            {
                原: "初九：巩用黄牛之革",
                象: ["巩用黄牛，不可以有为也。"],
                析: "《离》为黄牛，《革》为牛皮，“巩”，扬子《方言》谓，“火干也”，是皮方去毛，以火干之，犹未成其《革》也。初居《离》之始，其象如之。革者本大有为之事，初爻卑下，其时其地，皆未当革，其才与德，亦不足以任革，恰如取黄牛之革，始用《离》火以干燥之而已，未可躁急而妄改也。《象传》以“不可以有为”释之，谓不可先时而革也。",
                占:
                "【问时运】好运初来，犹宜固守，不可妄动。\n" +
                "【问营商】商业初成，宜先立巩固之基，未可妄事更张也。\n" +
                "【问功名】初出求名，其才未充，其时尚早，必待四五年后，方能变化腾达。\n" +
                "【问婚姻】男女之年尚幼，未可拟亲，俟三年后，可以成就。\n" +
                "【问家宅】此宅新造，屋宇坚固。\n" +
                "【问疾病】病是胃火微弱，脾土过强，致中腹胀硬，有类黄疸之症。药宜消积健脾以治之。\n" +
                "【问讼事】必是健讼，未易断结。\n" +
                "【问六甲】生女。"
            },
            {
                原: "六二：己日乃革之，征吉，无咎。",
                象: ["己日革乏，行有嘉也。"],
                析: "二为内卦之主，居《离》之中，《彖》所云“己日乃孚”，二实当之。在《彖》曰“乃孚”，是天人先期其孚也；在爻日“乃革”，是时会适当可革也。既“孚”“乃革”，不言孚而孚在其中矣。二与五应，“征”者，往也，谓往应大人之命，以共启文明之运，故吉而“无咎”。《象传》以“行有嘉”释之，《离》为火，火主礼，凡国家变革之事，要不外制礼之大法，《周礼·大宗伯》所谓“嘉礼亲万民”者，此也，故曰“行有嘉”也。",
                占:
                "【问时运】行土运可以兴事立业，大佳。\n" +
                "【问战征】宜择戊己日，行军接战，必可获胜。\n" +
                "【问营商】于摄绵土生意最宜。凡新立买卖，必择土日开市大吉。\n" +
                "【问功名】戊年或交土运必可成名。\n" +
                "【问婚姻】可称嘉偶。\n" +
                "【问家宅】修理旧宅，宜择土日。\n" +
                "【问行人】戊己日可归。\n" +
                "【问疾病】逢己日可愈，吉。\n" +
                "【问六甲】生女。"
            },
            {
                原: "九三：征凶，贞厉。革言三就，有孚。",
                象: ["革言三就，又何之矣。"],
                析: "三、四、五三爻，皆言“有孚”，是就《彖传》“乃孚”之辞，至再至三，而申明告示，以期其孚也。三处《离》之终，二既行《革》，则革之成败，正于三见之。操切行革，反以招败，故“征凶”；革当大事，革而不从，适以启祸，故“贞厉”。是骤革者危，不革亦危也。君子惟先求其孚而已，是以革之事未行，革之言先布，《离》为言，当《离》三爻，故为“三就”。昔盘庚迁殷，周公之告多方多士，皆反复详明，不嫌其言之烦，惟期其民之孚也。言既“三就”，则我之诚意，可深入于民心，民于此时，当必“有孚挛如”矣。或云“三就”者，如《左传》所云：“政不可不慎，务三而已，一择人，二因民，三从时。得此三者，而天人交孚矣。”其说亦通。《象传》以“又何之”释之，凡占象如《乾》之《坤》，“之”字皆作变解，谓“三就”而革，复有何变也。",
                占:
                "【问时运】当此有事之秋，一不谨慎，则有凶危立至，宜再三筹度而行，方得众人信服。从此而往，时运大佳。\n" +
                "【问战征】兵，凶事也，危事也，发军之日，先宜号令申明，斯信则人任，往无不利也。\n" +
                "【问营商】未计其盈，宜先防其亏。贸易之道，以信为主，必得众商信从，乃可获利。\n" +
                "【问功名】必三试可就。\n" +
                "【问婚姻】得三人为媒，可成。\n" +
                "【问家宅】宜三迁。\n" +
                "【问讼事】始审再审至大审，三审乃直。\n" +
                "【问疾病】症象本危，三日后可愈。\n" +
                "【问六甲】生女。"
            },
            {
                原: "九四：悔亡，有孚改命，吉。",
                象: ["改命之吉，信志也。"],
                析: "革而议之谓之言，革而行之谓之命。四爻出《离》入《兑》，当改革之交，《彖》曰“革而当，其悔乃亡”，四得专之。《兑》二曰“孚兑，吉”，《象传》谓“孚兑之吉，信志也”，四爻曰“有孚吉”，而《象》亦曰“信志”，谓举大事，动大众，必先得民心，而后可大得志也。是《革》四爻，即《兑》二爻，故其辞同，其象亦同。“改命”者，必上膺天命，下顺人心，鼎革一新，如汤武之革命是也。后世托言汤武，而妄思改命者，类皆灭亡，盖革命必有汤武之志则吉，无汤武之志则凶，“改命”之吉，专指汤武而言。《象传》曰“信志”，亦谓此也。",
                占:
                "【问时运】曰“悔亡”，曰“吉”，是灾悔既亡，而吉运来也。万事皆可改作，无不如志。\n" +
                "【问营商】必是旧业重兴，大可得利。\n" +
                "【问战征】改旗易辙，重振军令，可以开国，可以辟地，可以转败为胜，吉。\n" +
                "【问功名】改武就文，可以成名。\n" +
                "【问婚姻】不利原聘，利重婚。\n" +
                "【问家宅】改作改造，大吉大利。\n" +
                "【问讼事】灾悔已退，讼即可罢。\n" +
                "【问失物】可寻得之。\n" +
                "【问六甲】生女。"
            },
            {
                原: "九五：大人虎变，未占有孚。",
                象: ["大人虎变，其文炳也。"],
                析: "五爻得《坤》气，《坤》为虎，《兑》属正西，白虎西方之宿，故五爻有虎象。“虎变”者，虎之毛羽，变而成文，愈变而愈美者也。五居尊位，故称“大人”，为《革》之主，风虎云龙，变化莫测，为《革》之至盛至当者也，“汤武革命”，即在此爻。“未占有孚”者，大人德位俱隆，躬任制作，将为天下更新，大启文明之化，而天下之被其化者，早巳输诚悦服，不敢或后，所谓不疑何卜？无容质诸于鬼神，故曰孚在占先也。孚于人，尤孚于天，是天与之，人归之，有见其孚而不见其革者矣。上互《乾》，《乾》为大人，非“乾道变化，各正性命”之大人，曷克臻此？《象传》以“文炳”释之，五处《兑》之中，兑为泽，为金，泽谓润泽而有文也，金亦有文象，下应《离》火，《离》为光，为明，其文更著。丙火为《离》，丙即炳，故炳字，从火从丙。",
                占:
                "【问时运】如此大运，非“首出庶物”之大人，不克当此。若常人占得此爻，必能光前裕后，大振家声。\n" +
                "【问战征】虎臣桓桓，威声早著，可不战而来降也。\n" +
                "【问营商】白虎属西方之宿，西属秋，防货价至秋，大有变动。宜先订定价，自可获利，吉。\n" +
                "【问功名】《乾》曰“云从龙，风从虎”，言各得其际会也，吉。\n" +
                "【问婚姻】俗以白虎为不利，婚事未占先孚，犹言未嫁而先从也，为女不贞之象。\n" +
                "【问家宅】虎动，亦不利。\n" +
                "【问疾病】虎属寅，寅为木，是必肝木振动之症。不占先孚，必不药而愈也，吉。\n" +
                "【问六甲】象本生女，一变则为男。"
            },
            {
                原: "上六：君子豹变，小人革面。征凶，居贞吉。",
                象: ["君子豹变，其文蔚也。小人革面，顺以从君也。"],
                析: "上爻居卦之极，有德无位，必是去位之贤大夫也，故称“君子”。豹饰，大夫之服，故曰“豹变”。盖革之成，始于四，整于五，终于上，是以五之圣君，既得显虎文之灿，而上之大夫，亦得增“豹变”之华。“小人”，细民也，“面”者，向也，“革面”者，向化也，言小人皆潜移默化，于光天之下，革面洗心，欣欣然而有喜色也，是之谓“小人革面”。“征凶”者，上与三应，上之“征凶”，亦即三之“征凶”也。谓大变既定，若复纷更自取多事，必如汤之昭德建中，惟期裕后，武之修文偃武，不复用兵，是即所谓居贞则吉也。《象传》以“文蔚”释之，“蔚”，深密之貌；豹隐处雾雨，欲泽其身，以成其文，犹言君子相与于文明之治，以增服饰之光也。",
                占:
                "【问时运】运当全盛，光华显著，惟宜守成，无事纷更。\n" +
                "【问营商】创业以来，有名有利，已臻美备，此后宜知足谨守。\n" +
                "【问功名】上居卦之终，功名早极，劝令功成身退，所谓“人死留名，豹死留皮”也。\n" +
                "【问战征】军用多取兽名，兕甲虎贲，皆用之以焕其文而扬其威也。上六爻已终，谓战已定，宜罢兵退守，不可前往。\n" +
                "【问婚姻】上与三应，九三阳也，上六阴也，三日“三就，有孚”，当再三逑合，自可成就，吉。\n" +
                "【问家宅】爻位在上，其宅基必高。曰“征凶”，知迁移不利；曰“居贞吉”，知居之得安也。\n" +
                "【问失物】物已变革，寻亦不得。\n" +
                "【问六甲】生女。"
            },
        ]
    },
    {
        x:"011101",//鼎
        e:{
            原: "鼎：元吉，亨。",
            象: ["木上有火，鼎。君子以正位凝命。"],
            彖: ["鼎，象也。以木巽火，亨饪也。圣人亨以享上帝，而大亨以养圣贤。巽而耳目聪明，柔进而上行，得中而应乎刚，是以元亨。" ],
            析: "《序卦传》曰：“革物者莫若鼎，故受之以鼎”。《鼎》者新命之象，昔禹平水土，九州攸同，铸九鼎以象九州，历代宝之。夏亡鼎迁于商，商亡鼎迁于周，故三代革命，以鼎为重器也。卦自《革》来，《兑》互《乾》金居上，火互《巽》木居下，有铸《鼎》之象。本卦火上木下，木能生火，有《鼎》烹之象，故其卦曰《鼎》。\n" +
            "通观此卦，《井》取用于水，《鼎》取用于火，故《井》《鼎》二卦，爻象相似。盖《井》以坎水为主，下象井而上象水；《鼎》以《离》火为主，下象鼎而上象享。井汲在上，故《坎》居上，而上卦多吉；鼎烹在上，故《离》居上，而上卦亦多吉。二卦居《革》之间，《井》《革》则修，《鼎》《革》则迁，鼎者，新也。有王才兴，必以鼎为受命之符，特牲告庙，酒醴飨宾，心之诚，礼之隆，无不以鼎为重焉。“巽而耳目聪明”者，即所谓“且聪明，作元后”是也。其命维新，其道大亨，其化则柔而上行，其德则中而应刚，其器也，则宗庙享之，子孙保之，所愿万世有道而不迁也。",
            占:
            "【问时运】木上升，火上炎，有日进日上之象，大可成事立业。\n" +
            "【问战征】践主帅之位，率三军之命，正有如火如荼之势，马到功成，此其时也。\n" +
            "【问功名】贵不可言。\n" +
            "【问营商】木生火，鼎烹物，得其自然之利，可不劳而获也。\n" +
            "【问家宅】防有祝融之灾，宜谨慎。\n" +
            "【问疾病】必是肝火上冲之症，宜以泄肝顺气治之。\n" +
            "【问婚姻】爻为相生，鼎为重器，必是正配，又得内助。\n" +
            "【问讼事】火势正旺，一时未得罢休，宜定心安命，自然得直。\n" +
            "【问六甲】生女。"
        },
        ye:[
            {
                原: "初六：鼎颠趾，利出否，得妾以其子，无咎。",
                象: ["鼎颠趾，未悖也。利出否，以从贵也。"],
                析: "爻体《巽》为股，初在股下，故曰“趾”，上应九四则“颠”矣。初至五为《大过》，“大过，颠也”，故初为“颠趾”。按《少牢·馈食礼》，“雍人概鼎”，概，涤也，所以去其宿垢。“趾颠”则鼎倒，而垢自出，“否”，即垢也，故“利出否”。“出否”不得谓悖。爻体三之五，互《兑》，《兑》为妾，《鼎》为器，“主器者长子”，故有“得妾以其子”之象，主器，是以谓贵。“无咎”者，盖因败成功，以贱得贵也。陆氏希声曰：“颠趾出否，虽覆未悖，犹妾至贱，不当贵，以其子贵，故得贵焉。”《春秋》之义，母以子贵是也。",
                占:
                "【问时运】有因祸得福，转败为成之兆。\n" +
                "【问营商】初次小损，后获大利，且有商地成家之象。\n" +
                "【问功名】有荣封之喜。\n" +
                "【问家宅】此宅墙基有坏，修之获吉，且必出贵子。\n" +
                "【问婚姻】是为小妾，必生贵子。\n" +
                "【问疾病】腹有宿积，利在下泻，无咎。\n" +
                "【问六甲】生男，宜于庶出。"
            },
            {
                原: "九二：鼎有实，我仇有疾，不我能即，吉。",
                象: ["鼎有实，慎所之也。我仇有疾，终无尤也。"],
                析: "“实”者，鼎之实，即为鼎中之肉。阳为实，阴为虚，二爻阳实，位当鼎腹，是鼎有实之象，故曰“鼎有实”，则可享上帝，可养圣贤。古之人爵高禄厚，每多不免凶祸，是由仇即我也，二应在五，为三四两阳间隔，故曰“我仇有疾”。“仇”者，害我者也，“疾”者，恼我者也。二自守坚固，不相比附，故曰“不我能即”。人能守正，不正者不能就，所以吉也。鼎之“有实”，犹人之有才，当慎所趋向，斯不陷于非义。故《象传》以“慎所之”释之，谓一鼎不能动，则万夫废，一心不可动，则万议息，慎所之之谓也。“终无尤也”，“无尤”，乃所以得吉也。又曰：“疾”字，有妒害之义，入朝见疾是也。小人之为害也，必托为亲爱，以伺其隙，在我既志洁行芳，嫉我者自无隙之可乘，不能即而害之也。",
                占:
                "【问时运】运途正直，奸邪自远，无往不吉。\n" +
                "【问功名】“实”者，实获也。名成之后，多有忌嫉之者，宜慎防之。\n" +
                "【问营商】曰“鼎有实”，即所谓囊有财也，宜防匪人盗窃。\n" +
                "【问婚姻】二与五应，五变为姤，《姤》曰“勿用娶女”。“仇”，怨偶也，“不我能即”，是不娶也。\n" +
                "【问家宅】“实”者，富足之家，防分人窃伺。\n" +
                "【问疾病】阳为实，是实热之症，宜对症调治，吉。\n" +
                "【问六甲】生女。"
            },
            {
                原: "九三：鼎耳革，其行塞，雉膏不食。方雨亏悔，终吉。",
                象: ["鼎耳革，失其义也。"],
                析: "毛西河云：凡鼎既实，则以铉贯耳，扛近食前，仪礼所谓扃鼎是也。若未实，则撤铉脱耳，谓之“耳革”。凡物皆以足行，惟鼎以耳行，“耳革”则不能举之而行，故曰“其行塞”。上《离》为雉，下《巽》为鸡，鸡亦雉类，雉入鼎烹，故曰“雉膏”。雉膏，食之美者也，《鼎》之行既塞，雉膏虽美，人不得而食之矣。三动成《坎》，《坎》为雨，初之三为《睽》，《睽》上曰“遇雨则吉”，《睽》上互《坎》，雨皆取象于《坎》耳。“方雨”，乍雨也，雨之润者，谓之膏雨，喻言“雉膏”之芳润也。《坎》为破，亦为悔，故曰“亏悔”，谓有此美味，而不得食，举鼎者能无悔乎？悔则思变，将耳之革者不革，而行之塞者不塞，始虽悔，终则吉矣。古帝王铸鼎象物，以为世宝，鼎因一成而不易，举鼎之制，亦一成而不改，今欲以旧鼎变新鼎，妄革其耳，率至一步不能行，故曰“失其义也”。《井》《鼎》九三，皆居下而不用，《井》三“井渫不食”，《鼎》三“雉膏不食”，君子能调和其食，而不能使人之必食。此卦三虽欲革耳，五能以金铉实之，虽始有悔，终乃得吉也。",
                占:
                "【问时运】运非不佳，但妄意变改，以致所行辄阻，是以有悔也。\n" +
                "【问功名】目下虽美不售，改就他途，反多灾悔。\n" +
                "【问营商】业有改迁，致货物呆滞，须俟三年后，可复兴也。\n" +
                "【问战征】兵队有变，恐粮食被劫。\n" +
                "【问家宅】此宅两厢房。防有变动，或有火灾，遇雨得救。\n" +
                "【问婚姻】恐有悔婚改适之变，所谓“失其义”也。\n" +
                "【问六甲】生女。"
            },
            {
                原: "九四：鼎折足，覆公餗，其形渥，凶。",
                象: ["覆公餗，信如何也。"],
                析: "鼎三足，象三公。案九四辰在午，上值紫微垣。三师，隋《百官志》曰：三师之不主事，不置府僚，与天子坐而论道，盖贵戚近臣也。四下与初应，初为趾，体《大过》为颠，四震爻，《震》为足，上互《兑》，《兑》为毁折，故初之“颠趾”，至四则“足折”矣。鼎之所以安定不动者在足，足折则鼎倒，凡二之“实”，三之“雉膏”，皆为之倾覆矣，故曰“覆公餗”。“餗”，《释文》以为键，《周礼》以为糁，要皆为鼎实而已。“形渥”，郑作刑剭，“屋诛”注云；屋读如“其刑剭”之剭，谓所杀不于市，而以适甸师氏者也，盖就屋中刑之也。服虔云：《周礼》有屋诛，诛大臣于屋，不露也。四位比近五，盖谓大臣，鼎之折足，喻言臣下旷官，君视臣如手足，足折则臣道失矣，诛之于屋，凶之极也。《象传》曰“信如何”者，言四不胜其任，咎由自取，无可如何也。",
                占:
                "【问时运】运途颠覆，小则损折，大则刑戮，甚为可惧。\n" +
                "【问战征】有损兵折将之祸。\n" +
                "【问功名】未成者难望，已成者必败。\n" +
                "【问营商】资财覆灭，且有身命之忧。\n" +
                "【问婚姻】必男女均有足疾，且于家道不利。\n" +
                "【问家宅】有栋折榱摧之患。\n" +
                "【问疾病】必是足上患疮，难保完体。\n" +
                "【问讼事】凶。\n" +
                "【问六甲】生女，防有残疾。"
            },
            {
                原: "六五：鼎黄耳金铉，利贞。",
                象: ["鼎黄耳，中以为实也。"],
                析: "五偶画居鼎端，象鼎耳，《鼎》上卦《离》，《离》为黄，故曰“黄耳”。铉与扃通，所以贯鼎而举之也。按鼎之制，天子饰以黄金，诸侯白金，五为君位，宜用金鼎，故铉为金铉。“利贞”者，鼎为国之重器，利在正固而不动，举鼎者，亦当以正固之心临之，使无颠覆也。挈一鼎者听于耳，挈天下者听于君，耳为一鼎之主，犹君为天下之主也。《象传》曰“中以为实”者，“中”，谓鼎耳中虚，贯铉则可举，而鼎之实乃有以享上帝，养圣贤。是二、三、四，实在鼎腹，五之实，上鼎耳也。",
                占:
                "【问时运】运途贵重，贞守得福。\n" +
                "【问功名】大贵之象。\n" +
                "【问营商】信息明了，贩运便捷，可获厚利。\n" +
                "【问战征】防有洞胸贯耳之灾。\n" +
                "【问婚姻】“黄耳”“金铉”，贵兆也，主联姻贵族。\n" +
                "【问家宅】富贵之家。\n" +
                "【问六甲】生女。"
            },
            {
                原: "上九：鼎玉铉，大吉，无不利。",
                象: ["玉铉在上，刚柔节也。"],
                析: "上居外卦之极，一阳横亘于鼎耳，有铉象。玉之为物，其性坚刚，其色温润，上以刚居柔，其德似之，故以玉为铉。或谓上处卦外，是为就养之圣贤，而无位者也。按鼎之饰，各有品级，天子黄金，诸侯白金，大夫铜，士铁；五曰“黄耳”“金铉”，此为天子之鼎，上无位，特以玉铉别之。《集解》引干宝曰，“玉又贵于金者”，是其旨也。《彖传》曰，“玉铉在上，刚柔节也”，上谓在六五之上，“节”者，适均之意，言上与五，金玉相配，刚柔相济，得以成鼎养之功，故“大吉，无不利”也。",
                占:
                "【问时运】温润和平，无往不利。\n" +
                "【问战征】六师既张，进无不克，大吉。\n" +
                "【问功名】位趋鼎铉，大吉。\n" +
                "【问营商】美玉待沽，其价必善，无往不利也。\n" +
                "【问婚姻】如金如玉，大吉。\n" +
                "【问家宅】此宅地位甚高，大吉。\n" +
                "【问疾病】恐是耳痛之症。\n" +
                "【问六甲】生女。"
            },
        ]
    },
    {
        x:"100100",//震
        e:{
            原: "震：亨。震来虩虩，笑言哑哑。震惊百里，不丧匕鬯。",
            象: ["洊雷，震。君子以恐惧修省。"],
            彖: ["震亨。震来虩虩，恐致福也。笑言哑哑，后有则也。震惊百里，惊远而惧迩也。出可以守宗庙社稷，以为祭主也。" ],
            析: "“震”字从雨，辰声，《说卦》曰，“动也”，《杂卦》曰，“起也”。卦体二偶为《坤》，一奇为《乾》，《坤》阴在上，《乾》阳在下，阳伏而不能出，阴迫而不能蒸，于是乎《震》，是所谓“雷出地奋”也，故其卦曰：《震》为雷。\n" +
            "通观此卦，此卦次《鼎》，《序卦传》曰，“主器者莫若长子，故受之以震”，“器”者，鼎也。革命既定，必建长子，继体承乾，故曰．“主器”，此《震》之所以承《鼎》也。《震》得乾元刚阳之气，应时迅发，其威怒一击者，“天行”之健也，其发育群生者，“资始”之德也，故圣人以兢业为无为，以好生为神武。“虩虩”“哑哑”，理本一致，以“虩虩”者凛天威，而心不敢肆，以“哑哑”者承天德，而气得其和，是即震雷春发秋藏之旨也。上互《坎》，《坎》为忧，故有恐惧之象；下互《艮》，《艮》为顺，故有和悦之明。《艮》为宗庙，为社稷，故有宗庙社稷之象。《震》为出，为守，故曰“出可以守”；《震》为祭，故曰“为祭主”。《震》之为卦，由《鼎》出《震》，《鼎》取其新，是静而变动；由《震》反《艮》，《艮》取其止，是动而变静。动者声闻百里，静者敬主一心，是以可“致福”，可垂后，可“惊远”，可“惧迩”，可以守，可以祭，而不至丧失也，谓能善处夫《震》者矣。至六爻之义，各应其时：初秉一阳，为《震》之主；二至《巽》，为春夏之交，雷始发声也；三至《离》，四至《坤》，五至《兑》，上至《乾》，阳气伏而《震》道终焉。其爻皆两两相对：初与四对，初为刚，四溺柔，故四之“泥”，不如初之吉；二与五对，二“丧贝”，五“有事”，故二之“勿逐”，不如五之“无丧”；三与上对，三“苏苏”，上“索索”，故上之征有凶，不如三之“行无眚”也。大抵处《震》之道，以“恐惧修省”为主，除初爻之外，皆不得处《震》之道，故《彖传》之辞，惟初得专之。",
            占:
            "【问时运】运当发动，防其过盛，宜谨慎敛抑，可免丧失。\n" +
            "【问战征】有连日接战之象，须临时知惧。\n" +
            "【问营商】震雷出滞，滞者，积滞也，谓积滞货件，一时皆得出而销售。《象》曰“洊雷，震”，知有一二番好卖买也。\n" +
            "【问功名】雷者生发之气，“洊雷”，则有连捷之象。\n" +
            "【问家宅】宅基防有动作，上爻曰“于其邻”，必近邻有兴造之役，宜祭祷。\n" +
            "【问婚姻】《震》为长男，旁通为《巽》，《巽》长女，佳偶也。\n" +
            "【问疾病】是肝木太盛之症，防有变动，可惧。\n" +
            "【问六甲】生男。\n" +
            "【问失物】一动乃见。"
        },
        ye:[
            {
                原: "初九：震来虩虩，后笑言哑哑，吉。",
                象: ["震来虩虩，恐致福也。笑言哑哑，后有则也。"],
                析: "“虩虩”者，惊顾之状，“哑哑”者，笑语之声。初爻以阳居阳，得《乾》之刚，为成卦之主，故得系《彖》之辞，谓能临事而惧，后事而乐，虩虩哑哑，任天而动，与时偕行，所谓时然后笑，时然后言，“哑哑”之中，仍不忘“虩虩”之意。爻辞添一“后”字，其旨益明。“吉”，即谓“致福”也。凡天下之理，宴安每多招祸，危惧自能致福，《象传》曰“恐致福”，谓恐惧戒慎，可以转祸而招福也。又曰“后有则”，则即乾元之“天则”，谓乐得其时，是能与天合则也。此爻变则为《豫》，《豫》者乐也，亦有“笑言哑哑”之象。爻中《震》有二义，初四两爻，皆以阳震阴，为震动之《震》；二、三、五、上四爻，皆受《震》者，为震惧之《震》。",
                占:
                "【问时运】好运新来，万事皆可振作。先难后易，先忧后乐，百般获吉。\n" +
                "【问战征】初时敌势奋勇，可惧，后得胜捷，可喜。\n" +
                "【问营商】商业新兴，百般可惧，待经营成就，既获利益，随时欢乐，无不得吉。\n" +
                "【问功名】谚云“吃甚苦中苦，方为人上人”，自有先难后获之象。\n" +
                "【问家宅】此宅防有变动，其象为先号后笑，可以无咎。\n" +
                "【问婚姻】此婚始有忧惧，后得欢乐，吉。\n" +
                "【问疾病】先危后乐，“勿药有喜”。\n" +
                "【问六甲】生男。"
            },
            {
                原: "六二：震来厉，亿丧贝。跻于九陵，勿逐，七日得。",
                象: ["震来厉，乘刚也。"],
                析: "二得《坤》体，居内卦之中，“震来”者，与初爻辞同，威声急激，故曰“厉”。“亿”叹辞，《坤》“东北丧朋”，《震》东方，《震》出则《坤》之朋丧，二贝为朋，“丧朋”，即“丧贝”也。古者十朋五贝，皆用为货，是贝为重货。《震》为陵，初居阳九，故曰“九陵”，二据初之上，故曰“跻于九陵”。《震》为逐，《坤》丧其贝，《震》二逐之，不知穷通得失，自有定数，逐之而得，不逐亦未始不得也，故曰“勿逐”。《震》下《坤》上为《复》，《复》曰“反复其道，七日来复”，谓阴阳之数，各极于六，至七则相对而冲，二则返，返则丧于前者，可复得于后也，故曰“七日得”。是《复》之内卦，本为《震》也，《复》曰“朋来无咎”，“朋”即为“贝”，“来”即为“得”。《象传》以“乘刚”释之，谓六二阴柔，下乘初爻之刚，以致丧其资贝，故有“震来厉”之危。",
                占:
                "【问时运】运途尴尬，不无丧失，幸可复得。\n" +
                "【问营商】得失相偿，然亦危矣。\n" +
                "【问功名】既得患失，既失患得，品亦卑矣。\n" +
                "【问战征】一受惊恐，粮饷俱失，移营高阜，危殆已极，幸而得之，未为胜也。\n" +
                "【问婚姻】主夫妻不睦，防有携资潜逃之患。无须追究，缓即来归。\n" +
                "【问家宅】防有凶盗劫掠之祸，所失尚可复得。\n" +
                "【问疾病】疾势颇危，七日后可愈。\n" +
                "【问失物】不寻自得。\n" +
                "【问六甲】生男。"
            },
            {
                原: "六三：震苏苏，震行无眚。",
                象: ["震苏苏，位不当也。"],
                析: "“苏苏”，《正义》谓畏惧不安之貌，盖较初虩虩觉不安也。三内外之交，内卦之《震》未止，外之《震》又来，天之雷，愈震而愈厉，人之心，亦愈震而愈惧，“恐惧修省”，无可暂息，一念之肆，灾咎乘之矣。《震》为行，《震》以继《震》，行乃无咎，盖天以震警人，人即当震承天，承天而行，眚自无焉。《象传》曰“位不当也”，夫人之处世，安能时位皆得其当？惟其不当，一经震动，更宜加谨，斯可免害也。",
                占:
                "【问时运】运途不当，宜谨益加谨，谨慎而行，必无灾咎。\n" +
                "【问营商】销路不得其当，宜改行别路，可免耗失。\n" +
                "【问功名】“位不当”，谓才不胜任也，虽得亦危。\n" +
                "【问战征】《震》卦全体，皆处危惧之地，“苏苏”，谓死而重生，此战难望获胜，仅得逃生而已。\n" +
                "【问婚姻】门户不当。\n" +
                "【问疾病】虽危得以重生。\n" +
                "【问六甲】生男。"
            },
            {
                原: "九四：震遂泥。",
                象: ["震遂泥，未光也。"],
                析: "“遂”者，往而不返之意，“泥”者，陷而不拔之象。四为外卦之主，上体互《坎》，介处《坤》中，《坤》为泥，《坎》为雨，《坤》土得雨，为泥涂，故曰“震遂泥”。谓其震也，经一鼓再鼓三鼓之余，阳威已竭，如陷入淤泥之中，而不能自拔，君子“恐惧修省”，故于四尤凛凛焉。《象传》以“未光”释之，四本与初应，四之卦体，即初之体也，然不能如初之体乎乾元。《乾》为光，初得之，四则《乾》阳已息，故曰“未光”。亦爻位为之也。",
                占:
                "【问时运】正运已过，精力既衰，虽欲振作，终觉致远恐泥也。\n" +
                "【问战征】战争之交，所谓“一鼓作气”，至三至四，则勇已衰，若鲁莽前进，防车马陷入泥淖，被敌所困。\n" +
                "【问营商】商业亦佳，但挥财如泥沙，恐终不能积蓄也。\n" +
                "【问功名】有曳尾泥涂之象，宜退不宜进也。\n" +
                "【问婚姻】遂则必遂，惟相隔如云泥，或名分有上下之别，或道路有南北之分。\n" +
                "【问疾病】必中焦有食积泥滞，致腹鸣作痛，药宜开通下焦。\n" +
                "【问家宅】此宅为门前积土成堆，屋中沟道，亦多不通，致阳气闭塞，不利。\n" +
                "【问六甲】生男。"
            },
            {
                原: "六五：震往来厉，亿无丧，有事。",
                象: ["震往来厉，危行也。其事在中，大无丧也。"],
                析: "卦例自内而外曰往，自外而内曰来，五处外卦之中，内《震》乍往，外《震》又来，故曰“往来厉”。二与五应，故爻辞亦相似。“有事”，谓祭事，《春秋》“有事于大庙”，“有事于武官”是也。五居尊位，秉中德，此心兢业，常如承祭，故能“无丧，有事”。虞氏谓，“无丧”，即《彖》之“不丧匕鬯”。按祭仪，主祭助祭，皆欲有事，“无丧”者，不丧其所执之事，不必专指匕鬯，而匕鬯要亦在其中矣。《象传》曰“危行也”，《震》为行，行至于五，迭经往来，皆在震中，其心危，故行亦危也。又曰“大无丧也”，“国之大事，在祀与戎”，五动体为《随》，《随》上曰“用享”，初之五为《萃》，《萃》《彖》曰假庙，皆大事也，故曰“亿无丧”。",
                占:
                "【问时运】运得中正，虽经历多险，终可完成大事。\n" +
                "【问营商】贩货往来，保无危厉。万万曰亿，财利甚巨，或小有挫损，大必无丧也。\n" +
                "【问功名】此功名必从患难来，可占大用，成大功。\n" +
                "【问婚姻】防婚姻完后，家有祭葬大事。\n" +
                "【问家宅】此宅有厉鬼为祟，幸不丧人，宜祭祷之。\n" +
                "【问讼事】两造皆危，得中人调剂，可不至败。\n" +
                "【问失物】小数难觅，大件无损。\n" +
                "【问六甲】生男，主贵。"
            },
            {
                原: "上六：震索索，视矍矍，征凶。震不于其躬，于其邻，无咎。婚媾有言。",
                象: ["震索索，中未得也。虽凶无咎，畏邻戒也。"],
                析: "“索”，求也，“索索”者，内外搜求也。“矍”，顾也，“矍矍”者，左右惊顾也。《震》至上而已极，五为尊位，上则为宗庙社稷，神明之所至。《震》而在上，如史所书震太庙，震正殿，是必慝之大者，其可惧可畏，不有更甚者乎！由是而索求其天怒之所由来，中心恻惕，甚至顾视彷徨，惊疑不定。惟宜恭默省愆，谨益加谨，若复躁动前往，凶可知也，故曰，“征凶”。“其躬”者，上之躬；上与五相邻，“其邻”，指五也。五为祭主，居尊任重，索矍之所集也，故曰“不于其躬，于其邻”。君子“恐惧修省”，不以震在邻而或懈，正以震在邻而愈虔，畏与戒相循，故虽凶无咎。“婚媾有言”者，即《彖》“笑言哑哑”之言。上为《震》之终，君子夕惕朝乾，反躬内省，至《震》之终，而得告无咎。当此震威既霁，惧尽欢来，哑哑有言。凡在婚媾，亦得则君子之言以为言，所谓一家之中，忧乐相同，亦君子刑于之化所致也。此即《彖传》“虩虩”“哑哑”之全义，特于上申言之耳。",
                占:
                "【问时运】时当震惊将定，妄进则凶，静守则吉。\n" +
                "【问功名】位高必危，正宜退守，可保无咎。\n" +
                "【问营商】变动已定，不可过贪，见他人亏折，更宜谨守，乃得无咎。\n" +
                "【问战征】时本一战可定，闻邻近营队有变，急宜往救，不得坐视。\n" +
                "【问婚姻】《震》与《巽》有夫妇之象，想近时即有媒妁来言。\n" +
                "【问家宅】震“于其邻”，恐邻宅有震动之象。无咎。\n" +
                "【问疾病】病由心魂不安，致目视不明，宜静养。此人无碍，邻人有病，恐难挽也。\n" +
                "【问六甲】生男，防有目疾。"
            },
        ]
    },
    {
        x:"001001",//艮
        e:{
            原: "艮：艮其背，不获其身，行其庭，不见其人，无咎。",
            象: ["兼山，艮。君子以思不出其位。"],
            彖: ["艮，止也。时止则止，时行则行，动静不失其时，其道光明。艮其止，止其所也。上下敌应，不相与也。是以不获其身，行其庭，不见其人。无咎也。" ],
            析: "《艮》二阴一阳，得地之体，以《坤》之上画，变而成《乾》，故得《乾》》最上之一阳。乾为天，天本动也，天之最上一爻，为动极而静，故为止。一阳高踞于《坤》地之上，故象山。卦与《震》反，《震》一阳内起，《艮》一阳外塞，起于内则动，塞于外则止。《序卦传》曰：“震者，动也。物不可以终动，止之，故受之以艮。艮者，止也。”此《艮》之所以继《震》也。\n" +
            "《艮》《彖传》曰，“艮，止也”，即狠戾不进之谓。“不见其人”，即目相上不相下之象，《艮》为山并立，即取象两目比并也。总之，一动一静，为天地自然之橐仑，一行一止，为人身有定之枢机。卦体一阳止于二阴之上，外实内虚，阴虚居内，阳实揜外，如人北向背立，还视内听，是以“其道光明”。卦位《艮》《震》相因，《震》因《艮》止，《艮》因《震》动，天下无动不止，无止不动，止而动，故《震》先夫《艮》，动而止，故《艮》继夫《震》也。六爻之象，皆取诸身。初为“趾”；二为“腓”，腓足肚，在后也。三“夤”，脊膂也；四“身”，不言心，心在前也，不言背，夤即背也；五“辅”，不见面，见其旁辅也；六在卦外，不言所止，而曰“敦艮”，象山之加高也。其爻象，内三爻不如外三爻之吉。二曰“不快”，三曰“薰心”，惟初尚得其利；四曰“无咎”，五曰“悔亡”，六曰“厚终”，故《艮》外多吉。天下事终而能止，未有不善者也，所贵止之得其时也。",
            占:
            "【问时运】时运平平，宜退守，不宜妄动。\n" +
            "【问战征】宜各守疆界，不得驰域外之想。\n" +
            "【问营商】宜确守本业，不得贪意外之财。\n" +
            "【问功名】宜守旧，毋干幸进。\n" +
            "【问家宅】此宅地位虽狭，不可妄行改造。\n" +
            "【问婚姻】命由前定，不可贪富嫌贫。\n" +
            "【问讼事】不可以曲作直。\n" +
            "【问失物】当在原处寻之，可得。\n" +
            "【问疾病】止者终也，带病延年而已。\n" +
            "【问六甲】生女。"
        },
        ye:[
            {
                原: "初六：艮其趾，无咎，利永贞。",
                象: ["艮其趾，未失正也。"],
                析: "居《艮》之初，当趾之位。凡人动止，必自趾始，是以欲止其心，先止其身，欲止其身，先止其趾。趾止则不妄动，不妄动，则止得其所，而无失矣，故曰“无咎”。吉凶悔吝，每生乎动，止其趾，止动之初也，是遏人欲于将萌，存天理于未著，图之于始，尤当持之以永，故曰“利永贞”。《象传》曰“未失正也”，谓以阴居阳，位虽失正，而止其所止，初基正矣，故曰未失其正。",
                占:
                "【问时运】运途初交，宜守稳步，不可妄进，自得无咎。\n" +
                "【问战征】屯军山足，宜静守，不宜妄动。\n" +
                "【问营商】宜知足。\n" +
                "【问功名】初步虽微，不失其正。\n" +
                "【问家宅】此宅近在山麓，可以长住，无咎。\n" +
                "【问婚姻】百年好合，无咎。\n" +
                "【问疾病】病是足疾，艰于步履，一时难愈。\n" +
                "【问讼事】不失其正，无咎。\n" +
                "【问行人】因足不能行，一时不归。\n" +
                "【问失物】必不遗失，宜就地下僻处寻之。\n" +
                "【问六甲】生女，防有足疾。"
            },
            {
                原: "六二：艮其腓，不拯其随，其心不快。",
                象: ["不拯其随，未退听也。"],
                析: "“腓”，《本义》释为足肚，《正字通》云，胫后肉腓也。腓上于趾，故二象之。《咸》之二曰“咸其腓”，《咸》主夫感；《艮》二曰“艮其腓”，《艮》主夫止，止则安止不动矣。然趾与腓，皆为动体，本不欲止也，所欲止者心也。心欲止，则趾不能不止；趾既止，而腓亦随之，是腓固随趾为动止者也。“拯”，援也，“不拯其随”者，谓三“限”在上，不肯俯听，趾腓相随而动，故二之心有“不快”也。《象传》曰，“未退听也”，谓既不能拯其动，又不能退而听命，以从其止，是以“其心不快”矣。",
                占:
                "【问时运】运途有阻，宜裹足不前，不宜随心而动。\n" +
                "【问战征】止，不进也，坚守不动，又无外援，是以戚戚也。\n" +
                "【问营商】货物止而不售，甚为可忧。\n" +
                "【问功名】不得寸进，又苦无大力之援。\n" +
                "【问疾病】“腓”，病也，《诗》云“百卉具腓”，为秋风所虐也。此病亦必是秋症，恐非药力所能救援也。甚为可忧。\n" +
                "【问婚姻】腓亦为避，宜避绝之。\n" +
                "【问六甲】生女。"
            },
            {
                原: "九三：艮其限，列其夤，厉薰心。",
                象: ["艮其限，危薰心也。"],
                析: "“限”者，门限，为内外之界限。三处内外之间，横亘一画，故象限。“列”，分解也，虞氏作裂。“夤”，通作；马云“夹脊肉”。按《咸》五曰“脢”，《易传》谓“在脊曰脢”，郑云，“脢，脊肉”，是夤与脢，字异而义同也。“薰”，通作熏，灼也。三之《艮》限，为隔绝一身上下，使不相通，则将分心背而为二，一若门限之隔绝内外，此释氏所谓“降伏其心”是也。以强伏其心，心者，火也，心火上灼，烛烛炎炎，薰灼于方寸之中，不可扑灭，则其心危矣，《诗》云“忧心如薰”，此之谓也。岂知心本虚灵，感而遂通，《咸》之“咸其脢”，与《艮》之“艮其限”，一感一止，初无二致，《彖传》所谓“时止则止，时行则行，动静不失其时”，一任心之自然，而未可以隔绝为止者。隔绝为止，是欲定其心，乃适以危其心，心岂可以强制者哉！夫人一身脉络血气，上下前后，必周流贯通，无所阻隔，而此心自觉泰然，否则上不降，下不升，则脉络不通，血肉分裂，心其能得安乎？故曰“厉”。“薰心”，《象传》易“厉”曰“危”，盖危较厉，为更可惧也。",
                占:
                "【问时运】运途顺逆，皆当顺时，强制者危。\n" +
                "【问战征】两军相对，各争疆界，安得划界自守乎？自守者危矣。\n" +
                "【问营商】货物务在流通，乃可获利，况今万国通商，输入输出，互相交易，若闭关自限，必穷之道也，可危甚矣。\n" +
                "【问功名】专守一艺者，必非大器。\n" +
                "【问家宅】治家之道，内外出入，固宜严谨，但不宜隔绝，隔绝则财用不通，而家道危矣。\n" +
                "【问婚姻】婚姻之道，本由天合，若苟守门户，不能成两姓之欢。\n" +
                "【问疾病】必是隔症，上下不交，血脉不通，病势可危。\n" +
                "【问讼事】是上下之情不达，曲直难分。\n" +
                "【问六甲】生女，防难产。"
            },
            {
                原: "六四：艮其身，无咎。",
                象: ["艮其身，止诸躬也。"],
                析: "“身”者，总括全体而言，分言之，则一身亦有上下之别。六四居下卦之上，上卦之下，当心之位，在一身之中也。爻得柔正，上比六五，为能“止其所止”，洁身自好，虽不能兼善天下，亦可以独善其身，较之内卦三爻，为稍胜也。但以阴居阴，不堪有为，只能以身为天下模范而已，故曰“艮其身，无咎”。三爻言心，四爻言身，心虚而身实，期人含虚而践实，斯不坠入释氏虚无之弊。《象传》以“止诸躬”释之，躬，犹身也。是以身止心，即《大象》所谓“思不出其位”也。" ,
                占:
                "【问时运】运途柔顺，能保其身，自得无咎。\n" +
                "【问战征】难望进取，但于我身无所伤败，咎复何有？\n" +
                "【问营商】只能保本。\n" +
                "【问功名】无得无失。\n" +
                "【问家宅】安居无咎。\n" +
                "【问婚姻】平平。\n" +
                "【问疾病】是带病延年之症。\n" +
                "【问失物】即在身上寻之。\n" +
                "【问六甲】生女。"
            },
            {
                原: "六五：艮其辅，言有序，悔亡。",
                象: ["艮其辅，以中正也。"],
                析: "五居外卦之中，二偶分列，有辅之象。按《咸》上曰，“辅，腾口悦也”，是辅所以出言；“艮其辅”，斯言无失言矣。君子之道，寡言则寡悔。“艮其辅”者，固非止其辅而不言也，惟在时然后言耳。时然后言，则言有其序，可以默则默，可以语则语，语默不失其时，故“悔亡”。《象传》以“中正”释之，“艮其辅”，谓上得其中正，是以“言有序”而“无悔”也。" ,
                占:
                "【问时运】运得中正，故无悔忧。\n" +
                "【问战征】行军之际，最忌谣言妄作，惑乱军心，“艮其辅”使不妄言，斯号令严明，所向无敌矣。\n" +
                "【问营商】商情犹如军情，消息不容漏泄，“艮其辅”，则言得其要矣。\n" +
                "【问功名】巧言必黜，昌言则拜，言得中正，立谈可取卿相也。\n" +
                "【问家宅】此宅位得中正，居之无悔。\n" +
                "【问婚姻】媒妁之言，每多虚诞，听者宜慎。\n" +
                "【问疾病】必是牙关紧闭，口不出声，得能发声，病乃可治。\n" +
                "【问六甲】生女。"
            },
            {
                原: "上九：敦艮，吉。",
                象: ["敦艮之吉，以厚终也。"],
                析: "上居《艮》之终，即止之终也。“敦”，加厚也，所谓泰山不让土壤，故能成其高，即敦厚之谓也。上能以敦厚自止，是以获吉。《艮》六爻，惟上言吉，盖《艮》之为道，上爻足以尽之。上能坚守此心，知其所止，是以厚重如山，不可动摇，吉莫大焉。《象传》以“厚终”释之，谓止以敦而乃安，敦以终而弥厚，是《艮》之所“成终”者，在此厚，而所以“成始”者，亦即在此厚也。" ,
                占:
                "【问时运】运途至此，无可复进，惟厚益加厚，是以得吉。\n" +
                "【问战征】地位至上已极，要在兵力加厚，无不获吉。\n" +
                "【问营商】是上手生意，价高物美，获利必厚。\n" +
                "【问功名】必应上选，吉。\n" +
                "【问家宅】必是世代忠厚之家，吉。\n" +
                "【问婚姻】吉。\n" +
                "【问疾病】素体厚实，不药有喜。\n" +
                "【问六甲】生女。"
            },
        ]
    },
    {
        x:"001011",//渐
        e:{
            原: "渐：女归吉，利贞。",
            象: ["山上有木，渐。君子以居贤德善俗。"],
            彖: ["渐之进也，女归吉也。进得位，往有功也。进以正，可以正邦也。其位，刚得中也。止而巽，动不穷也。"],
            析: "《序卦传》曰：“艮者，止也。物不可以终止，故受之以渐。渐者，进也。”为卦《艮》下《巽》上，《巽》为风，为木，《艮》为山，风善入，木易长，有进之象；山则止而不动，欲进而为山所止，是以其进不速也。《正义》曰，“凡物有变移，徐而不速谓之渐”，此卦之所以名《渐》也。\n" +
            "通观此卦，卦本《乾》《坤》三四往来，阴进而止乎四，九居五而得中，上六以阴居阴，各得其所。爻与《家人》同，而其所异者，初爻九六之别耳，故渐在家则内外顺，在国则上下安。《彖》《象》取“女”，爻象取“鸿”，其卦为《艮》男《巽》女，迨吉于归。《诗》云“弋凫与雁”，是婚礼用雁之证也。雁之飞识时，女之归待聘，《渐》之义也。然鸿飞有序，知长幼之礼，其群有偶，厚夫妇之别，其来有候，适寒暑之期，是物之进而能渐者，莫如鸿焉，是以六爻之象，其始栖息甚近，其终飞翔甚远。初言“干”，象其进之始；二言“磐”，象其进之安；三言“陆”，则非所安；四言“木”，则始危而终安；五言“陵”，则升天位之高；上言“陆”，则出于人位之外。而初之不得所安，无应而不能进也；三之不得所安，无德而不能进也；四乘刚有德，可安也；上九过高，其德犹可则也；二五以中正相应，是以独得其吉也。卦画皆以奇先偶，象鸿飞有序；下卦以一奇率二偶，上卦以一偶随二奇，象鸿飞大者先小者随。阳大阴小，长幼之节，倡随之礼，夫妇之道也。六爻皆言渐，自初至上各有次序，实与《彖》辞渐进之义，足以相发明矣。",
            占:
            "【问时运】如木在高山，得逢春生发之象。\n" +
            "【问营商】山藏货财，木能生发，且《巽》为商，利市三倍，得此卦象，自必能逐渐得利也。\n" +
            "【问功名】足膺贤才之选。\n" +
            "【问战征】防三军前进，在深山茂林之处，有敌兵埋伏。\n" +
            "【问婚姻】必是贤德淑女，是以“君子好逑”。\n" +
            "【问家宅】必是德门仁里，君子居之。\n" +
            "【问疾病】是木克土之症，宜安居调养。\n" +
            "【问六甲】望前生者男，望后生者女。"
        },
        ye:[
            {
                原: "初六：鸿渐于干，小子厉，有言，无咎。",
                彖: ["小子之厉，义无咎也。"],
                析: "鸿，水禽，来往有时，群飞有序。相传汉土婚礼用雁，取其飞行不乱，失偶不再，有女贞之象。大曰鸿，小曰雁，鸿与雁一也。《彖》曰“女归”，故六爻皆取喻于鸿。“干”，水湄，鸿渐干而得所栖，犹女适人而得所托。但《艮》为少男，故称“小子”，《巽》为长女，一长一少，年齿相悬，未免于归愆期，或有不测之变，是为“小于厉”也。《说卦》“成言乎艮”，有言，为有成言也。女子许嫁，惟凭媒妁之言，既有其言，不得以有变而渝，故曰“有言无咎”。初应在上，初与上爻，高下悬殊，即可见夫妇年齿，长幼亦悬殊。女能待年不乱，守礼无失，无所为厉，复有何咎？《彖传》以“义无咎”释之，盖谓义在则然，咎自无焉。" ,
                占:
                "【问时运】人微年少，运途初行，虽危无咎。\n" +
                "【问战征】屯军江干，防有危厉，幸有谍言来告，得以免咎。\n" +
                "【问营商】货物交易，防有小人从中作难，因约言早成，得以无害。\n" +
                "【问功名】鸿运亨通，初虽在下，自有渐进之象。\n" +
                "【问婚姻】女长男少，妁言既定，当以待年而嫁，无咎也。\n" +
                "【问家宅】此宅临水，防小人有疾厄，然无大咎。\n" +
                "【问疾病】不利小人，大人无咎。\n" +
                "【问六甲】生女。"
            },
            {
                原: "六二：鸿渐于磐，饮食衎衎，吉。",
                彖: ["饮食衎衎，不素饱也。"],
                析: "磐者，水中平石，“衎衎”，和乐之貌。“鸿渐于磐”，有水可饮，有蒲鱼稻梁可食，为足乐也，犹女子嫁得其夫，合卺而饮，共牢而食，自见“宜室宜家，和乐且耽”。二与五相应，即为配偶，妇人贤德，足以内助，固非虚食夫家之食者也。《彖传》以“不素饱”释之，即此意也。" ,
                占:
                "【问时运】既得安乐，又得醉饱无忧，吉。\n" +
                "【问战征】兵食充足，军心欢悦，自有安似磐石之象。\n" +
                "【问营商】二爻居《巽》之中，《巽》为商，为利。就爻辞言“干”进“磐”，有渐进渐高之势，吉。\n" +
                "【问功名】有嘉宾宴乐之象，成名必矣，吉。\n" +
                "【问婚姻】二与五相应，即以二五为婚；二五皆吉，可咏百年偕老矣。\n" +
                "【问家宅】此宅地基巩固，一门和乐，吉。\n" +
                "【问疾病】饮食过度所致，宜消食安胃，病即日可愈。\n" +
                "【问六甲】生女。"
            },
            {
                原: "九三：鸿渐于陆，夫征不复，妇孕不育，凶。利御寇。",
                彖: ["夫征不复，离群丑也。妇孕不育，失其道也。利御寇，顺相保也。"],
                析: "“陆”，高平之地，鸿所集也。九三阳刚为夫，六四阴柔为妇，三又与六正应，六亦曰“陆”。自内往外为征，三往就外之陆，而遂弃内之陆，故“不复”。上互《离》，《离》为大腹，孕之象；下互《坎》，《坎》为灾，为鬼，不育之象。三与四以比邻私通，坏彝伦之大纲，背渐进之大义，安能得室家和睦，夫妇偕老，生育以延嗣续之庥乎？故曰“夫征不复，妇孕不育，凶”。且雁呼芦避缴，巡呼警夜，飞则相随，止则相保，亦有御寇之象，故曰“利御寇”。夫鸿之有雌雄，犹人之有夫妇也，雄飞不返，是离其群矣；胎孕之道，期其长育，孕而不育，是失其道矣。雌雄相守，是所以“御寇”，是“顺相保”也。《彖传》逐句释之，有以夫！" ,
                占:
                "【问时运】运途不正，防有外祸。\n" +
                "【问战征】利于守御，不利往征。\n" +
                "【问营商】难望获利，防有盗劫之虞。\n" +
                "【问功名】惟从事军政，可以得名。\n" +
                "【问婚姻】防有始乱终离之憾。\n" +
                "【问家宅】此宅于生产不利。\n" +
                "【问疾病】妇人生产，恐母子不能两全。\n" +
                "【问六甲】生女。"
            },
            {
                原: "六四：鸿渐于木，或得其桷，无咎。",
                彖: ["或得其桷，顺以巽也。"],
                析: "四居《巽》之始，《巽》为木。鸿水鸟，本不栖木，“桷”者，枝柯之大而平者也，于木之中，而得方平之桷，则亦可以容足矣。“或”者幸得之辞，此以鸿之失所，喻妇之失所也。四夫在三，三“征不复”，四妇失其所矣，或得其桷而集之，亦无咎焉。巽顺自守，不失妇道之正，虽无夫可也。" ,
                占:
                "【问时运】运失其正，但以顺自处，随遇得安，亦可无咎。\n" +
                "【问营商】聊有所得，差足免咎。\n" +
                "【问战征】得其倚角，敌势已衰。\n" +
                "【问功名】从事角逐，所得亦微。\n" +
                "【问疾病】病在肝木太盛，宜顺气调养。\n" +
                "【问家宅】此宅多寡居之妇，有遇人不淑之感。\n" +
                "【问行人】在外失年，聊以将顺容身，一时不归。\n" +
                "【问六甲】生男。"
            },
            {
                原: "九五：鸿渐于陵。妇三岁不孕，终莫之胜，吉。",
                彖: ["终莫之胜，吉，得所愿也。"],
                析: "《尔雅》，“大阜曰陵”；又八陵，北陵、西俞、雁门是也。此陵当是北陵，雁之家也。《月令》，“季秋鸿雁来宾”，鸿之南来为宾，北陵则为家，孕育则在家也。五与二正应，为夫妇，故以“鸿渐于陵”，喻夫妇之居家也。三至五互《离》，《离》为大腹，三动则《离》坏，故“不孕”；自二至五历三爻，象“三岁”。《艮》少男，《巽》长女，女及笄，而男犹未冠，是以不能生育，迨及时而阴阳和合，自然得孕矣。男少女长，似女偏胜，然二五正应，内外得当，夫倡妇随，故曰“终莫之胜”。时至而孕，各得所愿，吉可知也。又云：此卦三五皆言妇，九五以二为妇，正也，九三以四为妇，非正也。故三四相比为夫妇，虽孕而不敢育。女之归不以渐也，故凶；二五以相应为夫妇，不孕而得所愿，女之归以渐也，故吉。" ,
                占:
                "【问时运】运途中正，三年后，无往不利，吉。\n" +
                "【问战征】屯军大阜，三年后，所向无敌，吉。\n" +
                "【问功名】三年后必成。\n" +
                "【问营商】目下难望获利，至上爻自可独占厚利，盖在三岁后也。\n" +
                "【问婚姻】得子稍迟，吉。\n" +
                "【问家宅】宅在大阜之间，吉。\n" +
                "【问六甲】生男。"
            },
            {
                原: "上九：鸿渐于陆，其羽可用为仪，吉。",
                象: ["其羽可用为仪，吉，不可乱也。"],
                析: "上与三皆处卦极，故并称“陆”。《渐》卦六爻，皆取象于鸿，以喻夫妇，即本《彖》辞“女归”之旨。三之《渐》“陆”，夫道不正，致妇失所，不如鸿之雌雄相守；上则犹是陆也，犹是渐也，而以礼相接，人咸称美，不特表闺阃之令范，且足树邦国之合仪矣。一羽本轻，而先王制礼，纳采问名，皆取以为用，非以其有偶而不乱乎？夫妇之道，亦如是焉，故曰“其羽可用为仪”。“女归”之“吉”，其以此乎？" ,
                占:
                "【问时运】气运正盛，可出而用也，吉。\n" +
                "【问战征】从平陆进军，威仪显赫，攻无不克\n" +
                "【问营商】货美价高，定可获利。\n" +
                "【问功名】出而用世，可以仪表天下。\n" +
                "【问婚姻】吉。\n" +
                "【问家宅】此宅地位崇高，瞻观有耀，吉。\n" +
                "【问六甲】生男。"
            }
        ]
    },
    {
        x:"110100",//归妹
        e:{
            原: "归妹：征凶，无攸利。",
            象: ["泽上有雷，归妹，君子以永终知敝。"],
            彖: ["归妹，天地之大义也。天地不交，而万物不兴。归妹，人之终始也。说以动，所归妹也。征凶，位不当也。无攸利，柔乘刚也。"],
            析: "卦体《震》上《兑》下，《震》长男，《兑》少女。凡《彖》之取象男女者，如《咸》之少男少女，如《渐》之长女少男，皆言夫妇，而独于《震》男《兑》女，取象兄妹。按女子先生为姊，后生为妹，诸侯一娶九女，姊嫁则妹媵。孔颖达曰：“少女谓之妹，从姊而行，谓之归。”此卦之所以曰《归妹》也。\n" +
            "通观此卦，《归妹》，少女也，少女无知，故称妹；情欲相感，见可悦而昏，动不以礼，是为《归妹》。姊未嫁而妹先归，紊其序也；躬居媵而思夺嫡，越其分也。妇德若此，凶莫大焉，夫何利乎？六爻柔上刚下，内外倒置：二四以阳居阴，男以不正而从女；三五以阴居阳，女以不正而从夫；上卦六五乘九四，下卦六三乘九二，夫屈于妇，妇制其夫；阴反居上，阳降居初，皆失其渐。故《渐》六爻多吉，至上愈吉，《归妹》初爻独吉，至上则“无攸利”矣。是以君子贵《艮》渐而戒轻悦也。",
            占:
            "【问时运】一时发动，恐难持久。\n" +
            "【问营商】货价升动，卖客喜悦，但恐不能图终。\n" +
            "【问功名】进不以道，防有后悔。\n" +
            "【问战征】地雷陡发，足以制胜，恐一胜以后，兵力疲敝，无以保终。\n" +
            "【问婚姻】徒恋一时情欲之私者，难期百年偕老也。\n" +
            "【问家宅】地磐有动，已嫁之妇，不宜同居母家。\n" +
            "【问疾病】“永终”二字，独于占病不利，显见命限已终。\n" +
            "【问讼事】可以终结。\n" +
            "【问六甲】生女。"
        },
        ye:[
            {
                原: "初九：归妹以娣，跛能履，征吉。",
                象: ["归妹以娣，以恒也。跛能履，吉相承也。"],
                析: "六爻以五为尊，是正嫡也，其他皆为娣，初爻在最下之位，故曰“归妹以娣”。娣承嫡妻之命，不能专制，犹跛足之不能行，惟守为娣之分，行承顺之道而已，故曰“跛能履”；《震》为足，《兑》为毁折，有跛之象。九居初，为当位，是能安于娣而在下，行不先人，知其无陨越也，故曰“征吉”。就全卦论，以悦而动，女子感情悦之私，故其征也凶；就一爻论，以刚居刚，女子有贤正之德，故其征也，吉。《象传》以“恒也”释之，谓妹而为娣，礼之恒也；以“相承”释之，谓百事承顺，是以吉也。" ,
                占:
                "【问时运】运途低微，祇可依人成事而已。\n" +
                "【问营商】不能自主，听命而行，幸得获利，吉。\n" +
                "【问功名】偏裨之位。\n" +
                "【问战征】非主帅也，能以偏帅制胜，吉。\n" +
                "【问家宅】此屋必是廊庑偏屋，吉。\n" +
                "【问疾病】必是足疾，不良于行，身命无妨。\n" +
                "【问六甲】生女，防有足疾。"
            },
            {
                原: "九二：眇能视，利幽人之贞。",
                象: ["利幽人之贞，未变常也。"],
                析: "此爻阳刚得中，亦娣之贤者也。下互《离》，《离》为目，上互《坎》，《坎》为疾，有眇之象。眇一目小也，两目之视正，一目之视偏。妾媵则处于偏者也，不敢正视，故取“眇能视”为喻。二与五正应，二能侧视，得其宠矣，然正未可以宠自恃，故又戒以“利幽人之贞”。“幽人”者，犹云静女也，女子行不逾阈，窥不出户，有幽人之义焉。《象传》曰“未变常也”，谓能守其道，安其分也。幽则至静而不动，贞则至贤而不渝，幽人不以不遇变其道，女子不以失偶改其节，其致一也。",
                占:
                "【问时运】运途不正，宜幽贞自守。\n" +
                "【问营商】以其窥察商情，有独见之明，颇有暗得之利。\n" +
                "【问功名】以高尚不仕为贵。\n" +
                "【问战征】能察幽窥微，有料敌如神之妙。\n" +
                "【问家宅】此宅最宜幽居。\n" +
                "【问婚姻】此女宜作偏房，若在嫡室，恐反目不和。\n" +
                "【问讼事】防有幽禁之灾。\n" +
                "【问六甲】生女。"
            },
            {
                原: "六三：归妹以须，反归以娣。",
                象: ["归妹以须，未当也。"],
                析: "“须”者，贱女之称。三爻居《兑》之极，为悦之主，“归妹以须”者，以之为须也。三以柔乘刚，务为悦人，故于其始归也，降为之须，虽明知其未当，以故为抑之，不令其工妍献媚，开以妾夺嫡之嫌，所以惩淫逸而正名分者，其旨严矣。迨三能反其悦之为，始得复归娣之位，故曰“反归以娣”。《象传》曰“未当也”，谓阴柔不正，不当位也。《正义》以须为待时也，以三未当其时，则宜有待，故曰“归妹以须”，既及其时，以娣乃行，故曰“反归以娣”。亦通。" ,
                占:
                "【问时运】运途尴尬，受人抑制，是宜忍耐，后可得伸。\n" +
                "【问营商】货价低落，不能获利，过后可望提升。\n" +
                "【问功名】所得卑微。\n" +
                "【问婚姻】必非正娶。\n" +
                "【问家宅】此屋非正宅，必是廊庑，地位低小。\n" +
                "【问疾病】待时可愈。\n" +
                "【问行人】且宜暂待，缓时可归。\n" +
                "【问讼事】待时可以断结。\n" +
                "【问六甲】生女。"
            },
            {
                原: "九四：归妹愆期，迟归有时。",
                象: ["愆期之志，有待而行也。"],
                析: "九四以阳居阴，为动之主，动则急欲于归，但《兑》为少女，故曰“妹”，未可先姊而行也，是宜待年于闺，故曰“归妹愆期”。年及而归，未为迟也，故曰“迟归有时”。《诗·江汜》之篇，序谓媵有待年于国，而嫡不与之偕行，其后嫡悔而迎之，亦终归矣，即可作此爻之注脚也。三爻主悦，求贵而得贱；四爻主动，求速而反迟，皆深戒“悦以动”之必凶也。告之以迟归有待，所以遏其躁动之志，使知待时而行之为得也。" ,
                占:
                "【问时运】须知顺时而动，行运有时，躁进无益。\n" +
                "【问战征】最宜审时度势，无取躁急轻进，致损兵力。\n" +
                "【问营商】待时得价，自可获利。\n" +
                "【问功名】躁进必败。\n" +
                "【问婚姻】待年而归。\n" +
                "【问家宅】宅运未来，未可迁居。\n" +
                "【问行人】一时不归。\n" +
                "【问讼事】宜缓，可了。\n" +
                "【问失物】迟久可得。\n" +
                "【问六甲】生男。"
            },
            {
                原: "六五：帝乙归妹，其君之袂不如其娣之袂良。月既望，吉。",
                象: ["帝乙归妹，不如其娣之袂良也。其位在中，以贵行也。"],
                析: "“帝乙”者，殷纣之父；“君”者，小君之称，谓嫡妻也；“袂”者，袖也，“月”者，太阴之精，以象妇德；“望”者，谓月之圆满，“几”者，近也。五爻居《震》之中，《震》长男，下与二应；二居《兑》，《兑》少女，是兄妹也。所谓“帝乙”，乃为《震》兄，“归妹”者，是以天子之妹，下嫁于诸侯，故爻曰“其君”。《传》曰“以贵行”，即所称君夫人曰小君是也。卦体变《乾》成《兑》，《乾》为衣，故曰“袂”。《史记》“长袖善舞”，女子之态也，是袂足以取悦。月盈于望，八日《兑》见丁，十五《乾》盈甲，《兑》长至十五始盈，《乾》化《兑》；故曰“几望”。《京房易传》载汤嫁妹之词曰：“阴之从阳，女之从夫，天地之义也。往事尔夫，必以礼义。”其训以礼义者，即戒其不可以袂美取悦，亦不可以恃贵而妄动也。六五爻辰在卯，仲春之月，嫁娶男女之礼，故吉。《传》曰“其位在中”，五居《震》中，二居《兑》中，以二嫁五，中与中应，其位悉当；且五爻最贵，故曰“以贵行也”。" ,
                占:
                "【问时运】事事谦抑，不敢自夸，不敢自满，运途得中，是以吉也。\n" +
                "【问战征】降尊居贱，能得军心；从月夜进兵，出敌不备，可得全胜。\n" +
                "【问营商】前进货品，不如后进者良，约在望前可售，必得高价。\n" +
                "【问功名】如有兄弟，同出求名，弟必获隽。\n" +
                "【问婚姻】当有二女同归，吉。\n" +
                "【问家宅】宅位居中，当有喜事临门。\n" +
                "【问行人】望前可归。\n" +
                "【问疾病】半月可愈。\n" +
                "【问六甲】生男。"
            },
            {
                原: "上六：女承筐无实，士刲羊无血，无攸利。",
                象: ["上六无实，承虚筐也。"],
                析: "“士”者，未娶之称，“女”者，未嫁之称。《士婚礼》云，妇入三月而后祭行，上，宗庙爻，故曰祭。三月祭行，而后成妇，未承祭，犹称女也。宗庙之礼，主妇奉筐，即《诗》所咏“于以盛之，维筐及莒”是也。《兑》为羊，少牢馈食，司马刲羊，“刲”杀也，承筐刲羊，皆助祭事也。《易》例阳为实，阴为虚，三四复位，变《坤》为虚，故曰“承筐无实”；四互《坎》，《坎》为血卦，三四复位成《泰》，《坎》象不见。故曰“刲羊无血”。按祭礼，执盎者宗妇，荐豆者夫人，设黍者主妇，未闻有以娣妾从事者，使娣而与祭，是渎伦也，欲以示宠，适以启祸，亦何利焉？“永终知敝”者，可不戒哉！" ,
                占:
                "【问时运】万事不利。\n" +
                "【问战征】糗粮不备，戈矛不修，以斯从征，必败之道。\n" +
                "【问营商】资本既虚，货物又匮，奚以获利？\n" +
                "【问功名】空手求名，其何能得？\n" +
                "【问婚姻】婚娶不正，维家之索。\n" +
                "【问家宅】此宅家范不端，防有妾嫡纷争之患。\n" +
                "【问疾病】是虚劳失血之症，不治之象。\n" +
                "【问失物】不得。\n" +
                "【问六甲】生男。"
            },
        ]
    },
    {
        x:"101100",//丰
        e:{
            原: "丰：亨，王假之。勿忧，宜日中。",
            象: ["雷电皆至，丰。君子以折狱致刑。"],
            彖: ["丰，大也。明以动，故丰。王假之，尚大也。勿忧，宜日中，宜照天下也。日中则昃，月盈则食，天地盈虚，与时消息，而况于人乎？况于鬼神乎？"],
            析: "卦体《震》上《离》下，《离》本《乾》体，变《乾》中画而成《离》，《离》为日，日本悬象于天也；《震》本《坤》体，变《坤》之下画而成《震》，《震》为雷，雷本奋出于地也。“雷以动之，日以暄之”，万物化生，自然丰茂。《震》，动也，《离》，明也，明与动合而成《丰》，此卦之所以名《丰》也。\n" +
            "通观此卦，《京房易传》曰：“上木下火，气禀纯阳，阳为大，大则必丰。”卦以《离》遇《震》，《震》为君，君作于上，明烛于下，故得成崇隆丰大之业。然有丰必有歉，丰于功者傲，傲则必亡，丰于财者奢，奢则必败，傲与奢，皆由于动之失中也；动失其中则损明，损明则安能长保其丰乎？《杂卦传》曰，“丰，多故也”，“多故”，是以难保也，道在有以假之耳。王者能推心置腹，上下交孚，假以生明，明以运动，期明无不照，亦动罔不臧，如午日正中，光明遍烛，此《离》象所以为明也。明愈大，丰亦愈大，是可尚也，复何忧乎？卦体《离》日在下，《震》雷在上，互卦《巽》木为蔀，《兑》泽为水，雷施雨，木含日，故自二至四，有晦昧之象。圣人处此，虚以养其明，悦以霁其威，断以决其壅，使上下之情相通也。若六五动而得中，明良际会，则皎日澄空，氛翳全消，纯熙之运至矣，风雨晦冥，其何伤日乎？初爻如日初出，故“往有尚”也；二爻如日方中，故“有孚”吉也；三爻明为沫蔽；四爻明为斗掩；五与二相应，所以资明；上则《丰》极而凶矣。六爻皆有明象，而为“灾”，为“疾”，为“沫”，为“斗”，为“凶”，皆足以蔽其明而害其动，惟五独得其吉，《彖》所谓“王假之，尚大也”，在此爻矣。",
            占:
            "【问时运】气运旺盛，但当丰不忘歉，斯丰可长保矣。\n" +
            "【问营商】财利丰盛，但须公平谨守，否则恐有讼狱牵连。\n" +
            "【问功名】雷电有威名发达之象，宜任刑官。\n" +
            "【问战征】雷电皆至，见兵威显赫，声势远扬，攻战必克。\n" +
            "【问婚姻】世称雷为公，电为母，是天合也。\n" +
            "【问家宅】宅向东南，财气颇丰。\n" +
            "【问疾病】是肝火上升之症，宜泄肝泻火之剂，尤宜静养。\n" +
            "【问失物】皆速追究，可得。\n" +
            "【问行人】防有讼事纠缠。\n" +
            "【问六甲】单月生男，双月生女。"
        },
        ye:[
            {
                原: "初九：遇其配主，虽旬无咎，往有尚。",
                象: ["虽旬无咎，过旬灾也。"],
                析: "“配”郑作妃，卦体《震》上《离》下，初本《震》爻，为诸侯，初与四应，故以四为“配主”。初九爻辰在子，九四爻辰在午，君南面，臣北面，初以修礼朝四，四以匹敌厚恩遇之，虽留十日，不以为咎。正以十日者，朝聘之礼，自行聘至问大夫，才五六日，即事毕请归，郑注谓主国留之，飨食燕献，无日数，尽殷勤也。主虽绸缪，而客行淹久，乐不可言。旬以内，尚不逾节，故“无咎”。“往有尚”者，其往或因助祭而行朝聘，或因入朝而遇助祭，留之经旬，神人欢洽，故为可尚。然以旬为限，过则非常。《象传》谓过则灾生，盖凛凛于日中之戒，示以盈满为惧也。或以旬始为星名，《史记·天官书》，“旬始出于北斗旁，状如雄鸡”，二爻曰“斗”，三爻曰“沫”，斗沫皆星名，言其蔽明也。初以旬始为星，爻象相同，义亦可取。" ,
                占:
                "【问时运】得其相助，可有十年好运。\n" +
                "【问营商】当有巧当货物可售，旬日之内，即可获利，过旬则不利。\n" +
                "【问功名】“邂逅相遇，适我愿兮”，即日当有佳报。\n" +
                "【问战征】两敌相遇，当速进兵，十日外，恐有败象。\n" +
                "【问婚姻】姻缘相当，即日可成，迟则不谐。\n" +
                "【问疾病】得遇良医，旬日可愈，迟久不治。\n" +
                "【问讼事】得遇良吏，即可断结，迟缓不了，恐有外祸。\n" +
                "【问失物】宜速寻。\n" +
                "【问六甲】生女。"
            },
            {
                原: "六二：丰其蔀，日中见斗。往得疑疾，有孚发若，吉。",
                象: ["有孚发若，信以发志也。"],
                析: "六二居《离》之中，为明之主，日中之象也。“蔀”，虞谓日蔽云中，王弼谓蔀，覆，暖障光明之物。郑作菩，《说文》，“菩，草也”；《广韵》“蔀，草名”。《震》为草，故取象于草。《离》夏之时，草木蒙密，故曰“丰其蔀”。按诸说取象虽不同，而为蔽明则一也。“斗”者星名，《春秋·运斗枢》曰：北斗七星，第一至第四为魁，第五至第七为杓，合为斗。九四《震》动，斗柄之象，斗柄左旋，日体右转。日中非见斗之时，“日中见斗”，则有斗无日矣。喻言殷纣昏乱，奸臣弄权，俨如昼日掩光，而宵斗腾辉也，故曰“日中见斗”。当群奸蔽惑，虽周文之圣，犹不免羑里之囚，故曰“往得疑疾”。“有孚”者，即《彖》所云“王假”也，文以忠贞服事，至诚相假，是以纣志可回，蔽障开而疑疾自去矣，故“有孚发若”，转凶而为吉也。《象传》曰“信以发志”，为言后世人臣，忠而被谗者，能以积诚感主，无不可假也。" ,
                占:
                "【问时运】能以蒙难艰贞，自得逢凶化吉。\n" +
                "【问营商】见识不明，浑如白昼昏暗，不能办事，致生疑忌。当以至诚待人，得人扶助，方可获利。\n" +
                "【问功名】始凶终吉。\n" +
                "【问战征】屯军于丰林茂草之间，伏藏不发，往则恐有不利；必待敌兵内应，一发必得大胜。吉。\n" +
                "【问婚姻】始疑终谐。\n" +
                "【问家宅】此宅花木太盛，日光被掩，致窗牖失明，必须开豁明亮，方吉。\n" +
                "【问疾病】是胸襟不明，积疑成疾，宜以婉言开导，疑窦一开，病体自愈。\n" +
                "【问失物】被尘污所掩，宜拨开芜草，可寻得之，或在斗升之间。\n" +
                "【问六甲】生女。"
            },
            {
                原: "九三：丰其沛，日中见沬。折其右肱，无咎。",
                象: ["丰其沛，不可大事也。折其右肱，终不可用也。"],
                析: "毛西河引刘熙云，“沛者，水草相生之名”，《公羊传》“草棘曰沛”是也。“丰其沛”，喻言纣朝，群奸在下，如水草丛生，蒙密而蔽明也。三居内外之间，得《巽》气，《巽》之刚爻为木，柔爻为草，故取沛为水草。“沫”，郑作昧，服虔云“日中而昏”是也。《王莽传》“地皇元年，二月壬申，日正黥，莽恶之，下书曰：日中见昧，阴薄阳，黑气为灾”，即引《易》此文为证。九家《易》云：沫，斗杓后小星，即辅星也。按辅星在斗第六星左；《汉书·翟方进传》，辅沉没，张晏曰，辅沉没不见，则天下之兵销，是辅见则有兵祸。二说为昏为星，所据不同，要皆为周兴殷亡之兆。“折其右肱”者，臣以君为元首，君以臣为股肱，文为西伯，故曰“右肱”，纣听谗言，囚文于羑里，是“折其右肱”也。然当时虽三分有二，文能笃敬止之节，终身事纣，故右肱虽折而无咎。《传》曰“不可大事”，三居《离》之极，谓人心既离，天下大事，其已去矣。《传》又曰“终不可用”，三与上相应，上处《震》之极，为卦之终，上爻曰“阒其无人”，纣之所以为匹夫，故曰“终不可用”也。" ,
                占:
                "【问时运】运途颠倒，明明白昼，浑如黑夜，防有灾祸。幸一时身命，尚无恙也。\n" +
                "【问战征】“沛”或作旆，谓幡旆飘扬，率军前进，防风云有变，卒时昏暗，右军有失。\n" +
                "【问营商】防货价涨落不测，致被耗折。\n" +
                "【问功名】终不可用。\n" +
                "【问疾病】防右肱有损。\n" +
                "【问家宅】田园荒芜，水草从生，右庑已倾，暂居而已，终不可用也。\n" +
                "【问六甲】生女。"
            },
            {
                原: "九四：丰其蔀，日中见斗。遇其夷主，吉。",
                象: ["丰其蔀，位未当也。日中见斗，幽不明也。遇其夷主，吉行也。"],
                析: "四居外卦之始，为动之主，其爻象与二同，四之蔀，犹二之蔀也，四之斗，犹二之斗也。但二以阴居阴，《离》日被掩，四则阳刚发动，王心感假，障蔽开而疑疾消矣。“夷主”之遇，即《彖》所云“王假”也。二以疑疾而囚，四以遇主得释，遇则吉矣，故曰“吉”。《彖》曰“王”，文所称也；爻曰“夷主”，周公据其实而夷之也。《丰》沛见斗，《传》独于四释之，邪之害正，其蔽始于近习，故曰“位不当”；阴之掩阳，其灾见于白昼，故曰“幽不明”。《震》为行，行得所遇，故曰“吉行”。" ,
                占:
                "【问时运】曩时被人蒙蔽，今能翻然改作，得好际遇，可以获吉。\n" +
                "【问战征】兵入幽谷，不知去路，不见天日，幸遇向导，得以前行也。\n" +
                "【问营商】前因货物，真赝混杂，难以销售，今始得遇受主，方可获利。\n" +
                "【问功名】得此绝好际遇，名可立就，吉。\n" +
                "【问婚姻】良缘巧遇，吉。\n" +
                "【问家宅】此宅苦于地位不当，幽暗不明，得遇其人，动作一新，则吉。\n" +
                "【问疾病】病在目中生翳，所视失明，得良医，病可治也。\n" +
                "【问六甲】生男。"
            },
            {
                原: "六五：来章，有庆誉，吉。",
                象: ["六五之吉，有庆也。"],
                析: "五居外卦之中，五与二应，二言“往”，五言“来”，盖五视二为来也。“章”，美也；“庆”，赏赐也；“誉”，声誉也。二既得以“往”而“有孚”，五乃因其“来”而“有庆”，盖隐指文献文马，纣赐弓矢之事也，庆出于纣，誉归于文。丰在是，吉亦在是焉，所谓一人有庆，兆民赖之。二之庆，亦五之庆，故二五之吉同也。" ,
                占:
                "【问时运】盛运大来，实至名归，吉莫大焉。\n" +
                "【问营商】货物往来，无不获利，更可得名。\n" +
                "【问功名】得膺恩赏，名利兼全，大吉。\n" +
                "【问婚姻】天合良缘，门楣既显，嫁资亦丰，吉。\n" +
                "【问战征】可不战而成功也，奏凯而还，得邀封赏，吉。\n" +
                "【问家宅】必是旌表名门，吉。\n" +
                "【问疾病】有名医自来，即可全愈。\n" +
                "【问讼事】讼了，且可得赏。\n" +
                "【问行人】即日可归，且有喜事。\n" +
                "【问失物】不寻自来。\n" +
                "【问秋收】大有丰年。\n" +
                "【问谋财】不求自来。\n" +
                "【问六甲】生男，主贵。"
            },
            {
                原: "上六：丰其屋，蔀其家，窥其户，阒其无人。三岁不觌，凶。",
                象: ["丰其屋，天际翔也。窥其户，阒其无人，自藏也。"],
                析: "“丰其屋”者，自高也，“蔀其家”者，自蔽也。丰大其屋，又障蔽其家，亦有“行其庭，不见其人”之象也。上六重阴，居卦之极，是动极成惫，明极生昏，丰极致衰，极其甚则宗社倾覆，宫室空虚，故曰“窥其户，阒其无人”。“阒”即无人之状。干令升以上爻为说纣之亡，为独得其旨焉。上为宗庙，“三岁不觌”，是必三岁不祀也。《书》曰：自成汤至于帝乙，罔不明德恤祀，至纣不肯事上帝，弃厥先神祗不祀，故庙中虚旷，“三岁不觌”也。纣惟深藏于瑶台璇室，以自娱乐，所谓七世之朝，可以观德者，未几而为丰草矣，故曰凶也。《传》所释“天际翔也”，“际”或作降，“翔”郑王作祥，谓天降祥，祥，变异之通称。又所释“自藏也”，“藏”诸家作戕，王作残，郑作伤，皆谓国灭而自亡也。",
                占:
                "【问时运】有屋无人，大凶之象。\n" +
                "【问战征】营垒空虚，败亡之象。\n" +
                "【问营商】货物空存，无人经理，凶。\n" +
                "【问功名】身既不保，名于何有？\n" +
                "【问婚姻】凶。\n" +
                "【问家宅】田园虽富，必是破落之户，人烟稀少，凶。\n" +
                "【问疾病】命不久矣，凶。\n" +
                "【问行人】归聚无期。\n" +
                "【问六甲】生男，防不育。"
            }
        ]
    },
    {
        x:"001101",//旅
        e:{
            原: "旅：小亨，旅贞吉。",
            象: ["山上有火，旅。君子以明慎用刑，而不留狱。"],
            彖: ["旅，小亨，柔得中乎外而顺乎刚，止而丽乎明，是以小亨，旅贞吉也。旅之时义大矣哉！"],
            析: "为卦内《艮》外《离》。《艮》，山也，《离》，火也，山者得主而有常，火者附丽而不定。有常者，象所寓之地，不定者，象寄寓之人。“离者，丽也”，别也，别其家，丽于外，此卦之所以名《旅》也。\n" +
            "通观此卦，《艮》山止而在内，《离》火明而烛外，下卦为旅客远行之象，上卦为于时庐舍之象，互卦有《大过》，为行迈跋涉之象。六爻中曰“所”，曰“次”，曰“处”，曰“巢”，各有其地也；曰“灾”，曰“焚”，曰“丧”，曰“亡”，各有所失也；曰“怀”，曰“得”，曰“誉”，各有所获也。大凡羁旅之人，宜柔和谐众，不宜刚暴自恃，故六爻以柔为吉，以刚为凶。初以柔居下，是旅之微贱者；二柔中，故兼得；三过刚，故“丧”；四刚居柔，虽得“不快”；五柔中，小费大得；六刚遇高，大丧而凶矣。卦与《丰》反，聚则成《丰》，散则成《旅》。旅而能止，是《旅》之寄迹于外也；旅而遇明，是《旅》之择地而蹈也。总之，明有誉，昏有灾也；得于柔，丧于刚也；为“笑”为“号”，时为之也；曰“贞”曰“厉”，义所在也。圣人之栖栖者，为道而行也；庸人之攘攘者，为利而往也。夫非为旅之故与？其为则同；而其义要各有不同者焉。",
            占:
            "【问时运】运未全盛，宜明以察之，慎以防之，即有灾害，可随即解脱。\n" +
            "【问营商】宜出外贩运，随来随售，不可留积。\n" +
            "【问功名】火在山上，有光明远烛之象，升用在即。\n" +
            "【问战征】须用火攻。\n" +
            "【问家宅】慎防火灾。\n" +
            "【问婚姻】即日可成。\n" +
            "【问疾病】是肝火上炎之症，其势可危，生死在即，宜慎。\n" +
            "【问讼事】即日可了。\n" +
            "【问行人】即归。\n" +
            "【问六甲】上半月生女，下半月生男。"
        },
        ye:[
            {
                原: "初六：旅琐琐，斯其所取灾。",
                象: ["旅琐琐，志穷灾也。"],
                析: "初居卦之最下，是始为旅人者。“琐琐”，小也；“斯”，《尔雅》曰“离也”；“所”，即《诗》“爰得我所”之所，谓居处也，与二三爻曰“次”，四曰“处”，皆为旅舍之地也。“斯其所”者，谓旅行在外，因琐琐细故，遂致离其旅处。《序卦》曰，“旅而无所容”，离其所，则必无地可容矣，故“取灾”，言其灾由自取耳。《传》推本于“志穷”，以其较量于琐琐之故，一有不遂，则离其旅处，不特旅穷而志亦穷矣，穷则招灾，故曰“志穷灾也”。",
                占:
                "【问时运】出身既微，行运亦陋，孤身作客，恐难获利。\n" +
                "【问营商】资财微细，生业亦卑，难免灾祸。\n" +
                "【问功名】虽得亦卑。\n" +
                "【问战征】按五百人为旅，军力单薄，有败无胜。\n" +
                "【问家宅】地位委琐龌龊，必小户之家也。慎可免灾。\n" +
                "【问婚姻】《诗》“琐琐姻娅，则无膴仕”，知非名门大族也。\n" +
                "【问疾病】有小灾悔，初起可治。\n" +
                "【问六甲】生男。"
            },
            {
                原: "六二：旅即次，怀其资，得童仆贞。",
                象: ["得童仆贞，终无尤也。"],
                析: "“即”者，就也；“次”者，舍也；“资”者，货也。幼者童，壮者仆，《艮》为童仆，故曰“童仆”。《离》为资斧，故曰怀资。二爻柔中居正，有“即次”之象。以虚承实；有怀资之象；柔顺，则童仆亦尽其忠信，三事皆得其便宜。内不失己，而己无不安，外不失人，而人无不与，皆由柔顺中正之德所致也，故曰“旅即次，怀其资，得童仆贞”。不言吉者，旅寓之际，得免灾厉为幸耳。《象传》之意，亦不外此也。",
                占:
                "【问时运】有财有人，运途中正，自无忧也。\n" +
                "【问营商】得财则可以谋利，得人则可以共事，千里作客，可以无忧矣。\n" +
                "【问功名】是以财捐纳者。\n" +
                "【问战征】资财，即军饷也，“童仆”，即军卒也，饷足兵强，攻无不克。\n" +
                "【问家宅】必是寄居之宅，喜得财用充裕，童从顺正，家室和平，自无咎祸也。\n" +
                "【问婚姻】有富室赘婿之象。\n" +
                "【问疾病】旅处得病，喜有童仆，尽心服侍，可以调养痊愈。\n" +
                "【问六甲】生男。"
            },
            {
                原: "九三：旅焚其次，丧其童仆贞，厉。",
                象: ["旅焚其次，亦以伤矣。以旅与下，其义丧也。"],
                析: "三爻处内卦之极，出《艮》入《离》，《离》为火，故有焚象；《艮》为居，为舍，“次”，旅舍也，故曰“焚其次”。童仆随侍于次者，次焚，而童仆亦丧，是背主而去者也。《艮》为童仆，故曰“丧其童仆”。旅次焚，祸起不测，有由童仆之不戒者，亦有不由于童仆者。三爻“童仆贞”，然虽贞亦危，故曰“贞厉”。旅次经焚，身危资失，旅客固受伤矣，而在童仆，向承使令，一经焚灾，深恐主人责问，舍此而去，亦其义也，故《象传》两释之。",
                占:
                "【问时运】运途颠倒，破败重重，大为可危。\n" +
                "【问战征】谨防火攻，尤虑军心涣散，不战自遁。\n" +
                "【问营商】防有不测之祸，可危。\n" +
                "【问功名】目下难望，必二年后，至五爻曰“终以誉命”，可以成名矣。\n" +
                "【问婚姻】一时不成，难偕其老。\n" +
                "【问家宅】防有祝融之灾。\n" +
                "【问疾病】本人可愈，儿女或童仆，难以保全。\n" +
                "【问失物】必是童仆所窃。\n" +
                "【问六甲】生男。"
            },
            {
                原: "九四：旅于处，得其资斧，我心不快。",
                象: ["旅于处，未得位也。得其资斧，心未快也。"],
                析: "四居《离》之始，《离》为见，四之旅行，是往而求利见也。得位进于朝，不得则旅于处，故《传》曰“未得位也”。《离》为资斧，故曰“资斧”，即《春秋传》所谓“居则具一日之积，行则备一夕之卫”是也。资与二怀资不同，二之资，由我而具，四之资，自外而来，故曰“得”。《离》为干戈，有斧象，斧所以为卫也。四之所以仆仆行旅者，惟期得位乘时耳，乃所得而仅在资斧，所愿未偿，故“我心不快”也。以四初入《离》爻，文采未彰，名誉未显，故禄位犹末得也。",
                占:
                "【问时运】盛运未至，所得亦仅耳。\n" +
                "【问营商】出外贩运少有获利，未能满望。\n" +
                "【问功名】一时未得，容待来年，定可成就也。\n" +
                "【问战征】可以掳得敌粮，未能遽获大胜。\n" +
                "【问婚姻】嫁资颇厚，但是偏房，非正嫡也。\n" +
                "【问家宅】地位不当。\n" +
                "【问疾病】是心疾也，因谋望不遂，忧郁所致。\n" +
                "【问失物】可得。\n" +
                "【问六甲】生女。"
            },
            {
                原: "六五：射雉一矢亡，终以誉命。",
                象: ["终以誉命，上逮也。"],
                析: "五爻柔顺文明，为《离》之主，《离》为雉，又为弓矢，故取象“射雉”。五动体《乾》，矢动雉飞，故“一矢亡”。五自《坤》三来，《坤》为终，《离》为誉，下互《巽》，《巽》为命，故曰“终以誉命”。古者士以雉为贽，射雉而得，是士之进身有阶也。五以远适他邦，得以射雉著能，一时翕然称美，名誉上闻，而来赐命之庆也。故《传释》之曰：“上逮也。”",
                占:
                "【问时运】运途柔顺，小往大来，终有庆也。\n" +
                "【问营商】虽小失，有大得也，名利兼全。\n" +
                "【问功名】晚运亨通，声名上达。\n" +
                "【问战征】有一翦成功之象。\n" +
                "【问家宅】翚飞鸟革，善美堪称。\n" +
                "【问婚姻】二五得应，世称佳偶。\n" +
                "【问疾病】想是身临矢石，以忠殉难，得有赐命之荣。\n" +
                "【问六甲】有桑弧蓬矢之兆，男喜也。"
            },
            {
                原: "上九：鸟焚其巢，旅人先笑后号咷。丧牛于易，凶。",
                象: ["以旅在上，其义焚也。丧牛于易，终莫之闻也。"],
                析: "《离》为鸟，《艮》为止，故曰“巢”。《离》为火，互《巽》为木，故曰“焚其巢”。鸟之有巢，犹《旅》之有次也，三居内卦之极，刚而过中，故其次焚；上居全卦之极，高而忘危，故其巢亦焚，辞虽不同，其义一也。三至五互《兑》，《兑》为悦，为口，有笑之象；《离》五曰“出涕沱若”，有号咷之象。先互《兑》，后入《离》，故曰“先笑后号咷”。《离》本《坤》体，《坤》为牛，亦为丧，故曰“丧牛”。牛性最顺，《旅》卦全体，以柔顺者吉，刚暴者凶，上以刚处极，失其顺矣，是谓“丧牛”。“易”，不难也；丧其牛，势必凶矣。《象传》以《旅》处上极，犹如《离》木上槁，故曰“其义焚也”。“终莫之闻”者，“丧牛于易”，犹客死于外，无室无家，终无人过而问之者矣。《大壮》曰“丧羊”，丧其狠也；《旅》曰“丧牛”，丧其顺也。狠可丧，顺不可丧也。",
                占:
                "【问时运】行运已极，高而无与，乐极悲来，凶之道也。\n" +
                "【问战征】防有焚营劫寨之危。\n" +
                "【问营商】先小利，后大损，凶灾叠至，可危可危。\n" +
                "【问功名】有丧无得。\n" +
                "【问家宅】有覆巢累卵之危。\n" +
                "【问婚姻】先成后散，先喜后悲，凶。\n" +
                "【问疾病】属牛者必凶。\n" +
                "【问六甲】生女，不育。"
            },
        ]
    },
    {
        x:"011011",//巽
        e:{
            原: "巽：小亨，利有攸往，利见大人。",
            象: ["随风，巽。君子以申命行事。"],
            彖: ["重巽以申命。刚巽手中正而志行，柔皆顺乎刚，是以小亨，利有攸往，利见大人。"],
            析: "《序卦传》曰：“旅而无所容，故受之以巽。巽者，入也。”为卦二阳在上，一阴伏下，阳实阴虚，虚则能入。风无形无色，本虚象也；风之所行，无隙不入，是物之虚而善入者，莫如风。《巽》下画二偶为虚，故象风。以卑顺为体，以善入为用，此卦之所以名《巽》也。\n" +
            "通观此卦，卦体一阴伏二阳之下，阳上阴下，情本相得，而阴又能下，其入阳也，阳遂俯听其令，是以阴为主而阳为从也；故《巽》之阴，能权能制，非优柔而寡断也。卦画一偶象虚，凡物虚则能入，风亦虚也，故取其象于风。风行而万物鼓舞，令出而万民率从，风有声无形，命亦有声无形，故取其象。善令民者，卑虚以察闾里之情，然后从容晓谕；命之既申，然后划一遵守，以考厥成。所谓“刚巽乎中正而志行”，四之所以“有获”，五之所以“无不利”也。惟其柔顺乎刚，故六爻多吉。初之“进退”，二之“纷若”，其谋审也，故其命顺，若谋不审，是非不明，可否不衷，徒以甘言为欢娱，其谁顺之！不巽之咎，起于自用，故下卦谋顺出命，上卦行命为事。初“志疑”而不断；二详审折衷；三不中正，不能谋，又不能断；四以断有功，五制命中正而志行；上《巽》懦无能，甚于九三，其究为躁，故凶。《巽》者，选也，与算通，算故能权，权者，谋也，巽“称而隐”，非惟诺谄奉之谓也，“以天下之至柔，驰骋天下之至刚”。爻辞曰“武人”，曰“田获”，曰“资斧”，其象为高，为长，故巽非徒柔也。阴阳刚柔，相济为用，若以阳乘阳，则阳无所施，以刚用刚，则刚无所入。阴虚以承阳，柔顺以用刚，故用刚莫如巽，此《彖》所以谓之“小亨”也。然则五之《彖》曰“先庚”“后庚”者，何也？《巽》与《兑》相往来，《巽》位东南，天干甲木，《兑》位正西，天干庚金。木柔而能刚，故从直；金刚而能柔，故从《革》；木之性上遂，归根于土，故顺下；金之性下沉，利于致用，故悦上。顺故从绳而理解，悦故从《革》而响利。《巽》之时为春，《兑》之时为秋，万物齐于《巽》，悦于《兑》，一出一入，一始一终，而天地西南之用毕。二卦相资，金反为木，则为“后甲”，故随之《兑》，反为《蛊》之《巽》，《兑》为“先甲”，自秋还春，有事之象也。木反为金，则为“后庚”，故《巽》上反为《兑》下，则《巽》为“先庚”，自春往秋，悦利之象。《巽》入而隐伏，则不悦，故反《兑》；《兑》出而毁折，则不顺，故反《巽》。然《兑》未有不顺而能悦者，金未有不资本而能利者，故《巽》以阳顺阴而来下，《兑》以阳悦阴而往上，往来屈伸，自然之法象也。此《巽》之不为《蛊》者，惟以九五之一爻而已。圣人戒人君，制命于未乱，因以《蛊》之《彖》辞，为《巽》之爻辞。在《蛊》振饬更新，治乱相循，故“先甲”“后甲”“终则有始”；在《巽》勿劳更始，惟“申命行事”，故“先庚”“后庚”，无初而自有终也。盖甲有初，庚无可为初，庚后三日，以癸终而已；苟颠覆自用以为命，与委靡阿顺以为《巽》者，皆非申命之治，而《蛊》且至也。是爻所以戒九五也。",
            占:
            "【问时运】运途顺遂，百事盛宜。\n" +
            "【问营商】商业最宜随机应变，听命而行，斯可获利。\n" +
            "【问功名】“风从虎”，有虎变之象焉。\n" +
            "【问战征】军令之行，捷如风火，令出惟行，无可迟疑。\n" +
            "【问婚姻】凭父母之命，媒妁之言，礼之正也。夫唱妇随，百年偕老，吉。\n" +
            "【问疾病】是风痹之症，须人扶持而行。\n" +
            "【问讼事】须重申禀诉。\n" +
            "【问失物】为风飘失，须重番寻觅，或可复得。\n" +
            "【问六甲】生女。"
        },
        ye:[
            {
                原: "初六：进退，利武人之贞。",
                象: ["进退，志疑也。利武人之贞，志治也。"],
                析: "初爻阴柔居下，为《巽》之主，巽，顺也，柔顺少断，故象为进退。狐疑不决，每见于发念之初，蓄疑败谋，此志之所以不治也。《巽》反成《兑》，《兑》为武人，武人果决，足以断疑，故曰“利武人之贞”。“贞”者，正也，斯刚强奋发之气，可以矫逡巡畏缩之偏。《象传》释以“志治”，是以武治疑，即以《兑》制《巽》也。",
                占:
                "【问时运】运途不正，心神犹豫，是以谋事皆颠倒无成。\n" +
                "【问营商】《巽》本为利，因疑而败，以断而成，知犹豫者必难获利也。\n" +
                "【问功名】就武可成。\n" +
                "【问婚姻】不在彬彬文士，而宜桓桓虎臣。\n" +
                "【问家宅】此宅朝东南，地位不当，进退不便，宜改朝西为利。\n" +
                "【问六甲】生女。"
            },
            {
                原: "九二：巽在床下，用史巫纷若，吉无咎。",
                象: ["纷若之吉，得中也。"],
                析: "《巽》为床，床下为初，《巽》以一阴在下，故曰“床下”。凡阴气中人，必使其人神魂不定，疑鬼疑神，若有物凭之者焉，非用刚克，不能去其疑妄。“史”者掌卜筮之官，“巫”者掌祓禳之官，皆取诸《兑》象。《兑》又为附决，用史以释疑，用巫以禳灾，斯得感格于上下神祗，而吉祥汇集也，故曰“纷若，吉”。“纷”，众多之称，“若”，语辞。《象传》以“得中”释之，谓能行得其中，以感孚夫神祗，是以有“纷若”之吉也。",
                占:
                "【问时运】得神明保佑，运途多吉。\n" +
                "【问营商】凡贩运货物，有不决者，宜问诸卜筮，自能迪吉。\n" +
                "【问功名】得有神助，吉。\n" +
                "【问战征】地位既低，进退两难，当此之时，惟告求神明，自可获吉。无咎。\n" +
                "【问婚姻】卜之则吉。\n" +
                "【问家宅】宜祷。\n" +
                "【问疾病】宜祭祷床公床婆，自得无咎。\n" +
                "【问六甲】生女。"
            },
            {
                原: "九三：频巽，吝。",
                象: ["频巽之吝，志穷也。"],
                析: "三爻以阳居阳，处下《巽》之极。“频”者，数也，下《巽》终而上《巽》接，故曰“频巽”。所谓“刚巽乎中正”，固非徒取夫巽也，九三乃亟亟于巽以继巽，若一巽为不足，而又加一巽焉，是第知巽之为巽，而不知制《巽》之道，偏于巽者也。偏则吝矣，吝则穷矣。《象传》以“志穷”释之，三居《巽》之终，志卑道屈，是终穷也。",
                占:
                "【问时运】目下运途卑低，未免为人所贱。\n" +
                "【问战征】一味委靡，力弱志衰，难以免辱。\n" +
                "【问功名】卑而又卑，所得亦微矣。\n" +
                "【问营商】巽顺过甚，未能与人争强，何能获利？\n" +
                "【问婚姻】门户低微，成亦可羞。\n" +
                "【问家宅】屋宇低小，必是贫穷之户。\n" +
                "【问讼事】柔弱被欺，咎亦自取。\n" +
                "【问六甲】生女。"
            },
            {
                原: "六四：悔亡，田获三品。",
                象: ["田获三品，有功也。"],
                析: "四为重《巽》之主，得正而顺乎刚，故“悔亡”。四与初同体，初曰“利武人”，取《离》之为甲胄，为弓矢，四曰“田”，亦取《离》之为网罟也，其象亦相同。《周礼》四时之田，皆前期示戒，及其听命，即《大象》所云“申命行事”之义也。“获”，田所获也”。“三品”者，一为干豆，二为宾客，三为充君之庖。《象传》以“有功”释之，如《诗·豳风》所咏：“献豜私豵，载续武功”，谓致禽兽而有功也。一云，《解》九二曰“田获三狐”，言去小人也；《巽》九四曰“田获三品”，言用君子也。",
                占:
                "【问时运】运途得正，灾悔俱亡，出而有功也。\n" +
                "【问战征】从东南进兵，自得斩获有功。\n" +
                "【问功名】当以献功获赏，出身成名。\n" +
                "【问营商】当以采办皮革羽毛等品致富。\n" +
                "【问婚姻】婚礼，古时弋凫射雀，亦田象。\n" +
                "【问疾病】曰“悔亡”，病必可愈。\n" +
                "【问失物】可得。\n" +
                "【问六甲】生女。"
            },
            {
                原: "九五：贞吉，悔亡，无不利。无初有终，先庚三日，后庚三日，吉。",
                象: ["九五之吉，位中正也。"],
                析: "九五居卦之尊，中而且正，是即“刚巽乎中正”之大人也，故诸吉俱备。“先庚三日”为丁，丁者，取叮咛告诫之意，“后庚三日”为癸，癸者，取揆度周详之义。卦体五动成《蛊》，《蛊》六五曰“先甲三日”辛，“后甲三日”丁，《巽》九五曰“先庚三日”丁。《蛊》终于丁，而《巽》则始于丁，不始于“先甲”之辛，为“无初”也；癸为十干之终，《巽》终“后庚”之癸，为“有终”矣，故曰“无初有终”。《蛊》为三月之卦，春旺于木，故用甲；《巽》为八月之卦，秋旺于金，故用庚。木腐生虫成《蛊》，《巽》用金克之，斯不至变而为《蛊》矣，故《蛊》用甲，而“小有悔，无大咎”；《巽》用庚，乃得“贞吉”而“悔亡”。《象传》即以位释之，谓其“中正”而得吉也。凡六十四卦中，于九五言“贞吉悔亡”者，惟此一卦而已。",
                占:
                "【问时运】逢丁癸日作事，无往不利，大吉。\n" +
                "【问营商】生业宜取木爻，日辰宜用金日，初有小悔，后必大利，吉。\n" +
                "【问功名】位得中正，爻曰“贞吉”，逢丁癸之年，必得成名。\n" +
                "【问战征】其于师旅，必叮咛以告诫，其于地势，必周详以揆度。临事好谋，先后不怠，故战无不胜，大吉。\n" +
                "【问婚姻】丁火癸水，水火相配，吉。\n" +
                "【问家宅】其宅坐北向南，地位中正，大吉。\n" +
                "【问疾病】三日可愈。\n" +
                "【问六甲】生女。"
            },
            {
                原: "上九：巽在床下，丧其资斧，贞凶。",
                象: ["巽在床下，上穷也。丧其资斧，正乎凶也。"],
                析: "上与初为终始，初在下多疑，既示以“武人之贞”；至于上居卦之极，位高责重，任事益当勇决，何得一味畏葸，自甘退伏，同于二之床下？宜其高而益危，无以自立也。“资斧”者，虞喜《志林》云资当作斋，斋戒入庙而受斧，谓上身居高位，入庙受斧，自足振其威权者也，盖即初利用武人之义；乃巽顺不断，失其威权，是即所谓“丧其斋斧”也。畏事而事益滋，避祸而祸反集，故曰“贞凶”。《传》以“上穷”释“在床下”，以上之高居廊庙，畏首畏尾，无异伏处床第，其穷为可哀也。以“正乎凶”释“贞凶”，明过《巽》者之失其正矣，失其正，是以凶也。",
                占:
                "【问时运】运途不正，作事委靡，愈高愈危，有丧无得，凶。\n" +
                "【问战征】身为主帅，畏首畏尾，必致丧师辱国，身亦危矣。\n" +
                "【问营商】可断不断，因循失时，耗损必大。\n" +
                "【问功名】必不能保其终也。\n" +
                "【问婚姻】有惧内之象，难期偕老，凶。\n" +
                "【问家宅】主有丧，凶。\n" +
                "【问六甲】生女。"
            },
        ]
    },
    {
        x:"110110",//兑
        e:{
            原: "巽：小亨，利有攸往，利见大人。",
            象: ["丽泽，兑，君子以朋友讲习。"],
            彖: ["兑，说也。刚中而柔外，说以利贞，是以顺乎天而应乎人。说以先民，民忘其劳，说以犯难，民忘其死，说之大，民劝矣哉！"],
            析: "卦体一阴出于二阳之上，二阳在下，上承一阴，象如泽之蓄水。泽以润生万物，犹《兑》以悦服万民，其义相同，此卦所以取象于兑为泽也。\n" +
            "通观此卦，此卦次《巽》，《巽》者二阳在上，一阴入下，故阳顺而下来；《兑》者二阳在下，一阴出上，故阳悦而上往，与《巽》相反。于方位，《兑》者，西也，利美而和，其气为金，从革而新，其决断快利，其音响铿锵，故其德为悦。于四时，《巽》木，春也，《离》火，夏也，《兑》金，秋也，天以三时生物，木气发生，金气收敛，《巽》《兑》相反，而适以相成，中皆互《离》，三时相因，生克自然之运也。大抵兑悦之情，在和顺，而兑悦之气，主肃杀，和顺者柔也，肃杀者刚也。故以柔为悦，其弊必流于谄谀，以刚为悦，其德乃在于“利贞”。卦内初、二、四、五皆刚爻，得其正也；三上皆柔爻，失其正矣。初之“和兑”，得《彖》之“利”；二之“孚兑”，得《彖》之“贞”；四之“喜”，喜即在于利也；五之“厉”，厉即取其贞也；至三之“来兑”，悦以要结以来，故有凶；上之“引兑”，牵连而引，故“未光”。是《传》特著其德，曰刚中柔外，示其用，曰“顺天应人”，极其效，曰“民忘其劳”，“民忘其死”，而所以致其悦者，其道在先，其功在劝，其义则愈推而愈大。",
            占:
            "【问时运】运途平平，能得众心，自然获吉，惟逢三六之年，不利。\n" +
            "【问营商】得人扶助，可以获利。\n" +
            "【问功名】赖朋友之力可成。\n" +
            "【问战征】屯兵陂泽之地，宜于两后营相约进攻，可以获胜。\n" +
            "【问婚姻】必是朋友旧好。\n" +
            "【问家宅】宅临泽水，宜与朋友同居。\n" +
            "【问疾病】宜延相熟医师并诊，方可全愈。\n" +
            "【问讼事】宜请朋友公评，不必涉讼。\n" +
            "【问六甲】生女。"
        },
        ye:[
            {
                原: "初九：和兑，吉。",
                象: ["和兑之吉，行未疑也。"],
                析: "初居卦首，体得《乾》刚，“和兑”者，即和悦也。《乾》曰利物和义，是和即《彖》之所谓利也。人当初交，便觉和衷相济，以斯而悦，悦得其正矣，故吉。《传》曰“行未疑也”，谓人私曲疑虑，每生于转念，当其初，一片天心，固未尝间以人欲也。“和兑”在初，顺天而行，疑于何有？故不曰无疑，而曰“未疑”。" ,
                占:
                "【问时运】运当初爻，以和为贵，万事获吉。\n" +
                "【问战征】师克在和，民兵咸悦，有不战来归之象。\n" +
                "【问营商】《兑》为正秋，万实告成，天地自然之美利也。营商得此，吉无不利。\n" +
                "【问功名】得祥和之气，吉。\n" +
                "【问婚姻】有家室和平之乐。\n" +
                "【问家宅】一门和气，吉。\n" +
                "【问行人】行当即归，无疑。\n" +
                "【问讼事】即可和解。\n" +
                "【问六甲】生女。"
            },
            {
                原: "九二：孚兑，吉，悔亡。",
                象: ["孚兑之吉，信志也。"],
                析: "二居下卦之中，以阳居阴，即《彖》所谓“刚中”也。二与五应，“孚兑”者，二孚于五，五亦孚于二，两相孚，即两相悦。二为臣，五为君，是君臣一心，相孚而相悦也，故吉。夫上下之心不相孚，则上下必不相悦，是以有悔，既得其孚，悔自亡矣。《象传》以“信志”释之，谓孚即信也，以其志之可信，故得吉也。" ,
                占:
                "【问时运】运得中正，众心交孚，是以有吉，无悔。\n" +
                "【问战征】上下一心，令出惟行，有匹夫不可夺之志，战无不克，吉。\n" +
                "【问营商】贸易虽在逐利，要必以信为本，有信则彼此无欺，而商业乃可通行矣。\n" +
                "【问婚姻】二五相孚，是阴阳相偶也，吉。\n" +
                "【问家宅】“有孚挛如，富以其邻”，谓能与邻家，并力致富也。\n" +
                "【问功名】《中孚》二爻曰，“我有好爵，吾与尔靡之”，有父子同升之吉。\n" +
                "【问疾病】是因疑致疾，今既得相孚，灾悔自亡。\n" +
                "【问六甲】生女。"
            },
            {
                原: "六三：来兑，凶。",
                象: ["来兑之凶，位不当也。"],
                析: "三为《兑》主，即《彖》所谓“柔外”也。以柔招悦，故谓之“来”。初曰“和”，二曰“孚”，是不期悦而自悦，有相悦于无言耳。若专以阴柔悦人，亦以阴柔而致人悦，则所以来悦者，皆不以其道，则上下相蒙，适以长诈伪之风也，故“凶”。《传》以“不当位”释之，谓一阴居二阳之上，其位不当，欲以柔道致悦，其悦也，皆由强致而来，是失刚中之德矣。" ,
                占:
                "【问时运】人品卑鄙，专以谄笑求悦，未免为人所贱矣。\n" +
                "【问营商】通商之来，固宜和悦相招，然悦不以道，尔诈我虞，是失商道之正也。\n" +
                "【问功名】奔竞而来，虽荣必败。\n" +
                "【问战征】要皆招徕乌合之众也，不能久持。\n" +
                "【问婚姻】有始合终离之象。\n" +
                "【问疾病】病有外祟，其象本凶，三至四隔一爻，早则一日，迟则一月，可望愈快。\n" +
                "【问讼事】是外来之祸，凶。\n" +
                "【问六甲】生女。"
            },
            {
                原: "九四：商兑未宁，介疾有喜。",
                象: ["九四之喜，有庆也。"],
                析: "“介”，谓节操坚固之义，同《豫》之六二“介于石”之介；又两间曰介，四爻在三五之间，上承五之刚中，下比三之阴柔，是以一身介君子小人之间者也。“商”，商量也，《兑》为口，有商之象。四与初同体，初为事始，无所疑虑，故不待商；四则处上下之交，用刚用柔，皆须商榷，故曰“商兑”。商之而意难遽定，则中心游移，故曰“未宁”。因忧成病，故曰“介疾”。然未宁者终必宁，介然而疾，亦介然而喜矣。《兑》通《艮》，《艮》上《兑》下为《损》，《损》四曰“损其疾，使遄有喜”，其旨相同。《象传》以“有庆”释之，谓商而后宁，疾而有喜，则刚柔得中，天人相合，喜在一人，庆在天下矣。" ,
                占:
                "【问时运】运途未稳，逆则有忧，顺则有喜，万事宜斟酌行之。\n" +
                "【问营商】“四多惧”，营商在外，必有忧惧不安之事，商量出之，方得有喜。\n" +
                "【问功名】功名必从艰苦患难而来者，方得大就。\n" +
                "【问婚姻】一时疑惧未成，必待媒妁再三说合，终得成合有喜。\n" +
                "【问家宅】现下宅中不安，致多疾厄。《兑》为秋，必待秋时，得以平安有喜。\n" +
                "【问疾病】病由心神不安所致，得逢喜事，胸怀宽悦自愈。\n" +
                "【问六甲】生女。"
            },
            {
                原: "九五：孚于剥，有厉。",
                象: ["孚于剥，位正当也。"],
                析: "五处外卦之中，秉《乾》之刚，即《彖传》所谓“刚中”也，悦以“利贞”，五得其贞焉。《兑》为秋，《剥》九月之卦，当《兑》之未孚而至《剥》，是孚之极也。其不言《兑》者，至五《兑》悦既深，浑若相忘，故不见为《兑》，而只见为《剥》。《剥》者即劳与难之事也，劳之难之，事虽为民，而王者则视之若剥也；忘劳忘死，王者虽以为剥，而民实不知其为剥也，故曰“孚于剥”。至此而民已视危为安，王者犹以安为危，故曰“有厉”。事本无厉，有者在君之心，亦凛凛乎其有也。五居尊位，固当然也。《传》释以“位正当”，谓居此位者，皆当存此心也。" ,
                占:
                "【问时运】位得其正，运当其盛，盛极则剥，尤当预防，能时时防剥，斯时时得盛矣。\n" +
                "【问战征】“孚于剥”者，谓当生死存亡之地，军兵一心，感激奋勇，而不以为剥，诚可谓众志成城，无往不克矣。\n" +
                "【问营商】剥者，剥削也，虽有剥削，而深信无疑，必有大利。\n" +
                "【问功名】能安命，虽剥必亨。\n" +
                "【问疾病】有剥肤之疾，速治则愈。\n" +
                "【问六甲】生女。"
            },
            {
                原: "上六：引兑",
                象: ["上六引兑，未光也。"],
                析: "上六辰在巳，得《巽》气，《巽》为绳，有引之象；《兑》又旁通《艮》，《艮》为手，是以能引，故曰“引兑”。六与三同体，三失位，六引之使应己，是因其来而引之；来既不正，引亦不当，而悦更失其道矣。爻虽未判吉凶，要之后事之失，亦所难免，故《传》以“未光”释之。《乾》为光，六变《乾》为《坤》，故曰“未光”。凡《易》称“引”者，多在阴爻，《萃》六二曰“引吉”，自五引二，引而升也，引在于上，故吉；此爻曰“引兑”，以六引三，引其来也，引在于后，故“未光”。" ,
                占:
                "【问时运】上为卦之终，行运已极，必藉人引掖而能行，无吉无凶，平平而已。\n" +
                "【问功名】虽得他人荐引，亦已晚矣。\n" +
                "【问营商】得人引导，方可交易，上在卦外，是出洋经营也。“未光”者，未能大得利也。\n" +
                "【问战征】《兑》属正西，“引兑”者，相引而入西也。是引兵向西，与三合队，但当上爻，时会已迟，恐未必能奏功也。\n" +
                "【问疾病】内邪能引而外达，乃得望愈。\n" +
                "【问家宅】宅地纯阴，与三合体，防有内外牵引之患。\n" +
                "【问婚姻】爻象皆柔，恐是勾引而成，非夫妇之正礼也。\n" +
                "【问六甲】生女。"
            }
        ]
    },
    {
        x:"010011",//涣
        e:{
            原: "涣：亨。王假有庙，利涉大川，利贞。",
            象: ["风行水上，涣，先王以享于帝，立庙。"],
            彖: ["涣，亨，刚来而不穷，柔得位乎外而上同。王假有庙，王乃在中也。利涉大川，乘未有功也。"],
            析: "卦体《乾》四与《坤》二易位，《乾》变《巽》，《坤》变《坎》，合而成《涣》涣者，散也，《坎》为水，水之散，万派分流；《巽》为风，风之散，四郊遍被。《巽》上《坎》下，象取风行水上，是风水相遭。水则悠然长逝，风则过而不留，有涣之象焉，此卦所由名《涣》也。\n" +
            "通观此卦，“涣者，离也”，离者复合，散者复聚，故全卦有离合散聚之象。刚来不穷，柔而上同，卦之体也；王在庙中，“乘木有功”，卦之用也；曰“亨”，曰“贞”，卦之德也；曰“庙”，曰“川”，卦之象也。《大象》曰，“先王以享帝立庙”，即《彖》所谓假庙之旨也。盖庙立则昭穆之位定，王假则祭享之诚通，斯灵爽藉是而聚，即民心藉是而系焉。《涣》之正所以合之也，故《萃》亦言“王假有庙”。“萃者，聚也”，以萃而假，神志一焉；以涣而假，精诚通焉。《萃》与《涣》相反，而适以相须，故取象从同。至《易》言“利涉大川”者三，皆取《巽》木，《益》曰“木道乃行”，《中孚》曰“乘木舟虚”，《涣》则曰“乘木有功”，盖谓王者声名洋溢，内则孝享夫祖考，外则化被夫蛮夷，是以舟楫之利，独取诸涣者，此也。六爻言涣，皆隐寓聚象，故初遇险而顺，二阳来脱险，三临险忘身，四成《涣》忘人，五居尊忘天下，六超然遐举，涣以“远害”，所谓恭己无为，化驰若神者矣。故卦以三阴最吉，三阳次之。说者谓《易》道尚刚，一偏之论也。",
            占:
            "【问时运】运途亨通，有乘风破浪之概。\n" +
            "【问战征】利用海军。\n" +
            "【问营商】财水流通，得天神护佑，大利。\n" +
            "【问功名】风随帆转，水到渠成，有即日成名之象。\n" +
            "【问家宅】宜祷告神祗，自然获福。\n" +
            "【问婚姻】中男长女，自成佳偶。\n" +
            "【问疾病】“风行水上”，去而不留，病象危矣；立庙”，有魂归窀穸之象，故凶。\n" +
            "【问失物】难得。\n" +
            "【问六甲】春夏生女，秋冬生男。"
        },
        ye:[
            {
                原: "初六：用拯马壮，吉。",
                象: ["初六之吉，顺也。"],
                析: "初处《坎》之下，《坎》为险，初乃始陷于险者也。陷《坎》者，利用拯，何以拯之？初与二近，二得乾气，《乾》为马，《乾》健故“马壮”。初得二拯，如马之因风而走，得以脱险也，故“吉”。按；《明夷》亦曰“用拯马壮，吉”，《明夷》下互《坎》，二动为《乾》，故“用拯”亦取《乾》马，与《涣》初同象。《传》以“顺”释之，初本《坤》体，《坤》为顺，以《坤》之顺，用《乾》之健，是以吉也。《明夷》《传》曰“顺以则也”，其旨亦同。" ,
                占:
                "【问时运】运多险难，幸而遇救，危而反吉。\n" +
                "【问战征】初次临阵，赖战马精良，得以解围出险，故吉。\n" +
                "【问营商】资本微薄，深幸同事相助，得以获利。\n" +
                "【问功名】行午马运，必可成名。\n" +
                "【问家宅】新建大厦，好有禄马临向，吉。\n" +
                "【问婚姻】《乾》造以肖马者吉。\n" +
                "【问疾病】病宜急治，得遇马姓医士为吉。\n" +
                "【问行人】驿马已动，即日可归。\n" +
                "【问六甲】生男。"
            },
            {
                原: "九二：涣奔其机，悔亡。",
                象: ["涣奔其机，得愿也。"],
                析: "九二以阳居阴，象取以阳假阴，故《彖》云假庙，二当之。下互《震》，《震》为奔，上互《艮》，《艮》为坚木，有机之象；二与五应，机，谓五也。“涣奔其机”，谓假庙而奔就神几，机几字通，即《家语》“仰视榱桷，俯察机筵”是也。王在庙中，洞洞属属，以其恍惚，以与神明交，斯涣者假矣，故“悔亡”。《象传》以“得其愿”释之，谓骏奔在庙，得受其福，故曰“得愿也”。" ,
                占:
                "【问时运】运途顺适，得如所愿，灾悔俱亡。\n" +
                "【问营商】运货贸易，得所凭依，可以如愿而偿也，吉。\n" +
                "【问功名】所愿必遂。\n" +
                "【问战征】虽当涣散败奔，得所依藉，可图恢复，何悔之有？\n" +
                "【问婚姻】内卦《坤》体，二变为《乾》成《坎》，《坎》为中男；外卦《乾》体，四变为《坤》成《巽》，《巽》为长女，此配必女长于男。木水相生，佳偶也。\n" +
                "【问家宅】此宅眷属有奔败之难，幸在外得所凭依，所谓适我愿也。\n" +
                "【问疾病】郁郁不乐，隐几而卧，得遇良医，可以无忧。\n" +
                "【问六甲】生男。"
            },
            {
                原: "六三：涣其躬，无悔。",
                象: ["涣其躬，志在外也。"],
                析: "三体坎水，上体《巽》风，三之趋上，如水过风而流，木得水而浮，有相待而涣散者也，故三至上互《艮》，《艮》为躬，曰“涣其躬，无悔”。《象传》曰“志在外”，谓外卦也，志应夫上也。" ,
                占:
                "【问时运】三处《坎》之极，是运当坎险之时，忘身赴难，得以出险，可免悔也。\n" +
                "【问战征】能国而忘身，忠勇可嘉，去复何悔？\n" +
                "【问营商】运货在外，跋涉风波，备尝艰苦，有重财轻命之象。\n" +
                "【问功名】有杀身成仁，名垂竹帛之荣。\n" +
                "【问婚姻】有捐躯尽节之志，可悲，可嘉。\n" +
                "【问家宅】此宅临坎水之上，宅主宜出行在办，得可免灾。\n" +
                "【问行人】未归。\n" +
                "【问六甲】分娩在即，生男。"
            },
            {
                原: "六四：涣其群，元吉。涣有丘，匪夷所思。",
                象: ["涣其群，元吉，光大也。"],
                析: "六四居《巽》之始，卦体本《乾》，下画化《坤》成《巽》，《坤》为众，《坤》化《巽》，则其群涣矣。《坎》刚中得《乾》之元，故曰“涣其群，元吉”。上互《艮》，《艮》为丘，丘，聚也，高也，谓既涣其坎险，又复聚而成为高丘，是涣中有聚也，故曰“涣有丘”。四为《巽》卦之主，《系辞》曰，“巽，德之制也”，又曰“巽称而隐”，谓《巽》能因事制宜，隐见无常，化裁之妙，有非寻常所可测度者，故曰“匪夷所思”。《传》以“光大”释之，谓四出《坎》入《巽》，所以化险为夷者，正赖此正大光明之作用也。《坤》曰“含宏光大”，四得《坤》气，四之“光大”，即自《坤》来也。" ,
                占:
                "【问时运】能解脱困难，复成基业，正大运亨通之时。\n" +
                "【问营商】绝大手段，能散财济危，又能独成丘壑。\n" +
                "【问功名】有独出冠时之概。\n" +
                "【问战征】军容之盛，忽散忽聚，忽高忽低，忽而万马无声，忽而一丘高峙，变化之妙，有出意表者，此神化之兵也。\n" +
                "【问疾病】散其外邪，又当聚其元气，病自疗矣。\n" +
                "【问家宅】邻居旷远，独成一家，自得幽趣，吉。\n" +
                "【问讼事】“涣其群”，其讼必解矣，吉。\n" +
                "【问六甲】生女。"
            },
            {
                原: "九五：涣汗其大号，涣王居，无咎。",
                象: ["王居无咎，正位也。"],
                析: "五为尊位，《彖》所称“王假”，五当之。号，令也，“大号”，大政令也。五有刚中之德，以天下之险为己险，欲涣散天下之险，以发此“大号”也。“涣汗”者，刘向云：号令如汗，出而不返者。王者无私居，畿甸非近，要荒非远，一人之身，涣之即为万民，一人之心，涣之即为万几，布于四海，犹汗出于身，而浃于四体，故曰“涣汗”。天下之困苦，得仁政而解，一身之邪热，得汗出而消，其所涣一也。三至五体《艮》，《艮》为居，“王居”者，京师也。《论语》所云“譬如北辰，居其所，而众星拱之”者，王居之谓也。“涣王居”者，号令之涣，自近而远，其单敷万方者，要必正位凝命，自王居始也。“无咎”，即“履帝位而不疚”之意，《象传》以“正位”释之，盖以九五为正位，王者居之，得以号令天下。以一亿兆之心，而济万民之险，皆由君德与君位正当之功也。" ,
                占:
                "【问时运】运位得正，语默动静，百事皆吉。\n" +
                "【问营商】地位正当，货物流通，所到无不获利。\n" +
                "【问功名】位近至尊，名闻天下，大吉。\n" +
                "【问战征】号令严明，军威整肃，得奏汗马之勋。\n" +
                "【问婚姻】必得贵婿。\n" +
                "【问家宅】此宅非寻常百姓之家。\n" +
                "【问疾病】一汗即愈。\n" +
                "【问六甲】生女，主贵。"
            },
            {
                原: "上九：涣其血，去逖出，无咎。",
                象: ["涣其血，远害也。"],
                析: "上与三应，三体《坎》，为血卦，故曰“涣其血”。盖人身血脉以流通为安；以郁结致病，“涣其血”，斯体气舒畅，则忧患自消。“逖”，忧也，《坎》为逖，且上爻居《涣》之极，已出坎险，故曰“去逖出”。逖既去矣，咎自无也。《象传》以“远害”释之，谓上去《坎》已远，故害亦远矣。一说，谓上出卦外，逖，远也，身之有血，犹川之有水，喻言川流通达，风驰远去也。即取《大象》“风行水上”之意。" ,
                占:
                "【问时运】运途通达，灾去福来。\n" +
                "【问战征】卦体从《乾》《坤》来，《坤》上曰“龙战于野，其血玄黄”，有战则两伤之象。\n" +
                "【问营商】血者，资财也。商舶远出，贸易亨通，可以获利，自无忧也。\n" +
                "【问功名】有投笔从军之象。\n" +
                "【问婚姻】有远嫁之象。\n" +
                "【问家宅】宅主防有血光之灾，远避可以无咎。\n" +
                "【问疾病】是气血淤结之患，宜疏通脉络，可以免灾。\n" +
                "【问失物】此物已去远，不可复得。\n" +
                "【问讼事】宜远出避之，无咎。\n" +
                "【问六甲】生女。"
            },
        ]
    },
    {
        x:"110010",//节
        e:{
            原: "节：亨，苦节不可贞。",
            象: ["泽上有水，节。君子以制数度，议德行。"],
            彖: ["节，亨，刚柔分而刚得中。苦节，不可贞，其道穷也。说以行险，当位以节，中正以通。天地节而四时成，节以制度，不伤财，不害民。"],
            析: "为卦《兑》下《坎》上，兑为泽，《坎》为水。水之归泽也，盈则进，《坎》则止，水固自有其分量；泽之容水也，平则受，满则溢，泽亦自有其限制，即《节》之谓也。卦与《困》易位，泽在水上，是谓漏泽，泽漏则无水，故谓之《困》；水在泽上，是谓深泽，泽深则有水，故谓之《节》。此卦所以名水泽《节》也。\n" +
            "通观此卦，卦象取下《坎》上《兑》，爻取刚柔均分，当位则吉。阳实阴虚，实塞而虚通。《节》者，竹节也，竹之通处谓空，塞处谓节。凡所称立廉隅，分经界，皆节之义也。故人而无节，犹时而无序。夫寒暑晴雨，推移更代，若失其节，则天地闭塞，岁功不成；人而无节，则昏迷溃乱，行止皆穷，是咎在不知所节也。不知不节固凶，过节亦凶，欲期其节之贞，求其节之亨，惟要在刚柔之得中也。卦体内悦外险，刚柔均分，九五当位，刚得其中，悦以节险，中而能正，斯其道无往而不通矣。盖在圣人以至中者为《节》，其节也无心；在天地以循环者为《节》，其节也无形；在卦以《坎》《兑》相成者为《节》，其《节》也有象。圣人下袭水土，故取其象以示人。《彖传》所曰“苦”，曰“穷”，戒其失也；曰“亨”，曰“通”，著其效也；曰“得中”，曰“当位”，示其则也；曰“不伤财”，曰“不害民”，美其德也。其卦又自《泰》来，故于《节》亦可见天地交泰之象焉。水流《坎》止，有通塞之义，是以六爻皆取通塞，以为吉凶。初知塞而塞，故“不出”，“无咎”；二宜通而塞，故“失时”为凶；三不塞而“嗟”，咎复何辞？四塞而能“安”，得《彖》之亨；五全卦之主，“中正以通”；六塞而不通，是谓“苦节”。大抵《易》道戒盈，节以防盈，防之过，或迟疑而败事，或鄙啬而失当。违天时，拂人情，均难免于凶咎耳。道以刚中为吉，此圣人所以贵时中也。",
            占:
            "【问时运】运途中正，财源富有，惟宜外节出纳，内节身心。吉。\n" +
            "【问战征】节制之军，登高涉险，可守可战。\n" +
            "【问营商】泽有水，富饶之象。法制既精，议论亦确，无不获利也。\n" +
            "【问功名】品行端正，律度精详，有鱼龙得水之象。\n" +
            "【问婚姻】《坎》男《兑》女，水泽相成，吉。\n" +
            "【问家宅】宅临大泽，家道富有，吉。\n" +
            "【问疾病】病宜节饮食，慎行动。\n" +
            "【问六甲】生男。"
        },
        ye:[
            {
                原: "初九：不出户庭，无咎。",
                象: ["不出户庭，知通塞也。"],
                析: "初以阳居阳，为《节》之初，阳实阴虚，初当阳刚，一画塞止《兑》口，故为“不出”。上互《艮》，《艮》为牖，为居，有“户庭”之象；《艮》又为止，有不出之象，故曰“不出户庭”。卦继《涣》后，初六涣散甫集，正宜塞而不宜通也，虽户庭之近，亦不敢出，则一步一趋，无非节也，故得“无咎”。初动体《坎》，坎水为智，智则能审时度势，可通可塞，可出可入，皆有节制，故《象传》以“知通塞”释之。",
                占:
                "【问时运】运途未盛，宜谨守户庭，得以免咎。\n" +
                "【问营商】宜坐贾，不宜行商，无咎。\n" +
                "【问功名】目下宜杜门静守，至四爻可以成名。\n" +
                "【问战征】初当离散之余，军民乍聚，宜养其锐气，不宜出战。\n" +
                "【问婚姻】初与四相应，四得承顺之道，即妇道之正也，故无咎。\n" +
                "【问疾病】宜安居静养，无害。\n" +
                "【问失物】尚在户庭之内，可寻得之。\n" +
                "【问行人】尚未起行。\n" +
                "【问六甲】生女。"
            },
            {
                原: "九二：不出门庭，凶。",
                象: ["不出门庭，凶，失时极也。"],
                析: "户在内，门在外，初为户，二为门，由内而外也。初为内，坎水始至，塞之以防其漏；二则渐至于外，水既盛，宜通之，而犹曰“不出门庭”，是知塞不知通也。二爻有刚中之才，正当乘时应变，出而有为，使天下得节之用。卦自初至三互《震》，四至六互《艮》，乃不为《震》之行，而固守《艮》之止，杜门绝迹，坐失时机，是以凶也。故《象传》以失时之极斥之。",
                占:
                "【问时运】运途方盛，时会亦好，咎在因循自误，为可惜也。\n" +
                "【问战征】时可进取，乃畏首畏尾，固守不出，反致凶也。\n" +
                "【问营商】货物充积，时价得宜，本可获利，乃因拘墟失时，反致耗损。《兑》为毁折，是失象也。\n" +
                "【问功名】时会未逢，难望成名。\n" +
                "【问婚姻】桃夭失时，难免旷怨，凶。\n" +
                "【问家宅】门户闭锁，无人之象，凶。\n" +
                "【问疾病】病由步履艰难，几成痿痹。\n" +
                "【问失物】是内窃也。\n" +
                "【问讼事】恐有囚禁之祸。\n" +
                "【问六甲】生女。"
            },
            {
                原: "六三：不节若，则嗟若，无咎。",
                象: ["不节之嗟，又谁咎也。"],
                析: "三居《兑》之上，上画开口，为漏泽，不节之象。盖《兑》泽至三，坎水既盈，一时任意挹取，不知节省，至后将不继，不免咨嗟悔恨，故曰“不节若，则嗟若”。是为悦极生悲者，祸由己致，无所怨咎，故曰“无咎”。《象传》曰“又谁咎也”，谓当节不节，“不节”在己，“嗟若”亦在己，又将谁咎乎？",
                占:
                "【问时运】壮不自检，老大徒悲，其将谁怨乎？\n" +
                "【问战征】临时不谋，后悔难追。\n" +
                "【问营商】当其获利，骄奢无度，一旦耗失，便致哀嗟，咎由自取耳。\n" +
                "【问婚姻】有先喜后悲之象。\n" +
                "【问功名】随得随失。\n" +
                "【问家宅】三以阴居阳，地位不当。必致先富后贫。\n" +
                "【问疾病】病由不节饮食所致，幸无大咎。\n" +
                "【问失物】付之一叹，不须怨人。\n" +
                "【问六甲】生女。"
            },
            {
                原: "六四：安节，亨。",
                象: ["安节之亨，承上道也。"],
                析: "四本《坤》体，《坤》为安，故曰“安”；居《坎》之始，《坎》为险，以《兑》节之，斯得化险为安，故曰“安节”。“安节”者，安而行之，不失其节，则何往不通？故曰“安节，亨”。四得位承五，五“中正以通”，四先通之，是以《彖》之亨，惟归于四；四以承五得亨，而天下无不亨矣。《象传》曰“承上道也”，上指五，道即《节》之道，谓五以节风示天下，四比近五，能首承其道也。",
                占:
                "【问时运】一路平安。\n" +
                "【问战征】善战者在先安军心，军心安，则临危不惧，而所向有功。\n" +
                "【问营商】四在外卦之始，必是初次贩货出外，能事事节俭，斯得安居外地，而所谋亦得亨通矣。\n" +
                "【问功名】能承上意，必得成名。\n" +
                "【问婚姻】四以阴居阴，得位承阳，自得家室安全。\n" +
                "【问家宅】平安获吉。\n" +
                "【问疾病】病由口入，能节饮食，自得安泰。\n" +
                "【问六甲】生男。"
            },
            {
                原: "九五：甘节吉，往有尚。",
                象: ["甘节之吉，居位中也。"],
                析: "五居尊位，为《节》之主，《彖》所谓“当位以节，中正以通”，惟五当之。《彖》首戒“苦节，不可贞”，反苦为甘，其道必贞，贞则吉矣，故曰“甘节，吉”。四居《坎》中，《坎》《彖》曰“行有尚”，《节》四之“往有尚”，盖即由《坎》《彖》而来。“往”即“行”，谓能行斯而往，洵可嘉尚。按五味以甘为得中，咸苦酸辛，皆偏也。节味之偏，而适其中，谓之“甘节”，甘则人皆乐从，而不病其难也，此“甘节”之所以为吉也。《象传》以“居位中”释之，《礼·月令》白，“中央土，其味甘”，甘位居中，五为君，君位亦居中，《象传》所释之意取此。",
                占:
                "【问时运】运如嚼蔗，到老愈甘。\n" +
                "【问营商】稼穑作甘，当以贩运谷米为吉。“往有尚”，往者往外也，尤当贩米，往外洋销售，定必获利。\n" +
                "【问功名】苦尽甘来，功名必显。\n" +
                "【问家宅】五爻得位，中央为甘，知此宅必地位中正，家风正直，节俭足以嘉尚。\n" +
                "【问婚姻】女之嫁曰往“往有尚”，谓往而成礼。“甘”者，甘心相从，有百年好合之象，吉。\n" +
                "【问疾病】病在中宫，甘则中满，须宜节食为要。\n" +
                "【问六甲】生男。"
            },
            {
                原: "上六：苦节，贞凶，悔亡。",
                象: ["苦节贞凶，其道穷也。"],
                析: "六重阴不中，居《节》之极，是过《节》者。《尔雅》，“卤，咸苦也”，坎水润下作咸。《兑》为刚卤，是味之苦者也。上与初相终始，初在泽底，节以防漏，上在泽口，出纳由之，而竟概节之，是不知通塞也，其困苦之状，物所难堪，有不可终日者矣，故《彖》之“苦节”，独归于上。“悔亡”者，谓奢不如俭，以此修身，悔自亡矣。《传》曰“道穷”，即以释《彖》者释之。“苦节，贞凶”者，自古之龙逢比干，为国亡身，克全臣节，其祸虽凶，其道则正，足以表式万世，复有何悔？",
                占:
                "【问时运】运途亦正，为固执不通，以致终身穷苦。\n" +
                "【问营商】机会已极，不知变通，以致穷迫，徒自苦耳。\n" +
                "【问功名】其人则守正不阿，困苦自守，难望成名。\n" +
                "【问战征】爻象重阴，柔弱无力，又当地穷势极，只知苦守不出，终必凶矣。\n" +
                "【问疾病】阴盛阳衰，病势已极，凶。\n" +
                "【问六甲】生男。"
            },
        ]
    },
    {
        x:"110011",//中孚
        e:{
            原: "中孚：豚鱼吉，利涉大川，利贞。",
            象: ["泽上有风，中孚。君子以议狱缓死。"],
            彖: ["中孚，柔在内而刚得中，说而巽，孚乃化邦也。豚鱼吉，信及豚鱼也。利涉大川，乘木舟虚也。中孚以利贞，乃应乎天也。"],
            析: "卦体上《巽》下《兑》，《巽》为风，兑为泽，风之应时，春夏秋冬，不愆其候，风之信也；泽之受水，朝潮夕泛，不爽其期，泽之信也。卦象三、四二柔居内，是谓中虚，中虚则通，通则孚；二五两刚得中，是谓中实，中实则诚，诚亦孚也。此卦所以名《中孚》也。\n" +
            "通观此卦，此卦次《节》，凡事有节，则有常可守，无节则泛滥无据而不信。故喜怒哀乐，“中节”谓之“达道”，“达道”，即信也。《序卦传》曰，“节而信之，故受之以中孚”，此《中孚》所以次《节》也；卦内三四两偶为虚，二五两奇为实，初上两奇包外，恰如甲壳；鸟覆育其卵曰孚，应期而化，子自中出，故曰《中孚》。卦体《巽》上《兑》下，《巽》者东南司春，《兑》者正西司秋，自春至秋，自东至西，天地生物之功毕；《兑》往而归于西北，化机敛藏，贞固而为孚甲，遇《巽》复还东南，所以《兑》《巽》合而为《中孚》也。在五行则《兑》为金，《巽》为木，金克木。造物之理，生杀相因，卵不裂，不可以成鸟，木不刳，不可以为舟，《巽》木之利涉，《兑》金之功。故《兑》毁折而后能悦，《巽》鸡伏雏，甲坼而后羽毛见。《中孚》取象于孚卵，《小过》取象于飞鸟，法象之自然也。初象鸟之伏子，其心专一，故有“有它不燕”之辞；二象卵之受伏，其化将成，故有“鹤鸣”“子和”之辞；三象子之在壳，成败可忧，故有“得敌”之辞；四象卵之将成，盈满有时，故有“月几望”之辞；五象雏之成群，饮啄相呼，故有“有孚挛如”之辞；上象雏之习飞，下上其音，故有“翰音”“登天”之辞。有人则初上之实为躯，三四之虚为心，二五之实为情。然三四同虚，而有善有不善者，正则善，不正则恶；爻得位则正，失位则不正。初得位存诚，二得中相应，三不当位，四五当位，上九阳亢外弛，故初、二、四、五孚之善也，三上，孚之不善也。此贞谅之辨，圣人所谓倦倦者也。",
            占:
            "【问时运】“泽上有风”，防有风波之险。\n" +
            "【问营商】宜仔细酌议，宽缓行事，斯得免害。\n" +
            "【问战征】当以不嗜杀人为心，斯为心咸孚，所向无敌。\n" +
            "【问功名】一时罪狱未平，功名难望。\n" +
            "【问婚姻】婚媾致寇，因之速狱，宜慎。\n" +
            "【问家宅】主有讼狱之灾。\n" +
            "【问疾病】危则危矣，一时生命可保。\n" +
            "【问讼事】一时未了。\n" +
            "【问六甲】生女。"
        },
        ye:[
            {
                原: "初九：虞吉，有它不燕。",
                象: ["初九虞吉，志未变也。"],
                析: "“虞”，虞人也。《巽》四曰“田获三品”，《兑》五曰“孚于剥”，《月令》，“冬日剥阴木”，《诗》云“九月剥枣，是谓斩木”，是《巽》《兑》皆有虞人之象，故《中孚》初爻取之。王制獭祭鱼，然后虞人入泽梁。按虞人入泽梁，在十月中，《周礼》山虞令万民斩材木，《贾疏》“草木零落，然后入山林”，亦在十月中。《中孚》为十一月卦，正当入泽梁，斩材木时也。岁有常期，则渔者樵者，受命于虞人，入泽入林，各从其取，故曰“虞吉”。顺《中孚》之时，不愆其候，不纷其志，无他求也；有他则上下不孚，渔樵失时，焚林竭泽，将自此起，不能安矣，故曰“有它不燕”，“燕”，安也。《象传》以“志未变”释“虞吉”，谓变即有他，有他即不吉矣。惟其初“志未变”，是以吉也。",
                占:
                "【问时运】阳刚当令，用心专一，不惑于他途，故吉。\n" +
                "【问营商】安于本业，见异不迁，以交冬令为利。\n" +
                "【问功名】有志竟成。\n" +
                "【问战征】《巽》初爻曰“利武人之贞”，从禽从戎，其义相同，所当专心一志，踊跃前进，自可获胜。吉。\n" +
                "【问婚姻】有从一而终之象。\n" +
                "【问疾病】病可无虞，但恐有他变，变则危矣。\n" +
                "【问讼事】恐有别生枝节。\n" +
                "【问六甲】生女。"
            },
            {
                原: "九二：鹤鸣在阴，其子和之。我有好爵，吾与尔靡之。",
                象: ["其子和之，中心愿也。"],
                析: "“鹤鸣”“子和”，喻《中孚》之相应也。鹤为阳鸟，二以阳处阴，故曰“在阴”。《春秋·说题》称，鹤夜半则鸣，亦为信鸟，有孚之象。盖鸣者在鹤，和者为子，一鸣一和，同声相应，同气相孚，有得《中孚》感应之妙者矣。“我”谓二，“尔”谓五，“我有好爵，吾与尔靡之”，“靡”，共也，为二得此“好爵”，愿与五共之。二五相应，志同道合，一如母子相依，有同鸣共栖之象，其至诚之感孚如此。或疑五为君位，不当言子，不知《易》尚变通，未可拘执一见也。《象传》曰，“中心愿也”，谓鸣和乃自然之应，中心相孚，孚之至也。",
                占:
                "【问时运】此唱彼和，适得我愿，正当运途亨通之会。\n" +
                "【问营商】主客同心，气谊相投，有交相获利之象。\n" +
                "【问功名】有父子同升之庚。\n" +
                "【问战征】上下一体，如以臂使手，以手使指，一气相连，有进则共进，退则共退之象，未易攻击者。\n" +
                "【问婚姻】得夫妇唱随之乐。\n" +
                "【问疾病】是传染之症。\n" +
                "【问家宅】必是贵显之家，且得孝贤之子。\n" +
                "【问六甲】生女。"
            },
            {
                原: "六三：得敌，或鼓或罢，或泣或歌。",
                象: ["或鼓，或罢，位不当也。"],
                析: "《易》例以俱刚俱柔谓敌应，此爻三四俱柔，敌体也，故曰“得敌”。二至四互《震》，《震》为鼓，又互《艮》，《艮》为止，止即罢也，故曰“或鼓，或罢”。《兑》为口，能歌，《巽》为号，象泣，故曰“或泣，或歌”。“或”者不定之辞，盖三与四敌，始怒而鼓，复惧而罢，继喜而歌，复悲而泣，皆由中心无主，言动改常，其象有如此者。夫人有孚，虽千里相应，孰非吾与？不孚，虽一室相违，皆为吾敌，固不在外貌之相亲，而在内心之相孚也。三居《兑》之极，悦不由衷，故进退无极，惫可知也。《象传》以“位不当”释之，谓三以阴居阳，位不当也。",
                占:
                "【问时运】目下运途颠倒。\n" +
                "【问营商】忽盈忽亏，忽成忽败，皆由主谋不定。\n" +
                "【问功名】升降无常，荣辱随之。\n" +
                "【问战征】强敌在前，难以制胜。\n" +
                "【问婚姻】反复未成。\n" +
                "【问家宅】宅神不安，事多颠倒。\n" +
                "【问疾病】时重时轻，防有鬼祟。\n" +
                "【问行人】欲归复止，一时未定。\n" +
                "【问失物】防得而复失。\n" +
                "【问六甲】生女。"
            },
            {
                原: "六四：月既望，马匹亡，无咎。",
                象: ["马匹亡，绝类上也。"],
                析: "六四重阴之爻，月，阴也，故象取月。月至“几望”而始盈，盈则中实，有孚之象。四与五比，五为君位，日也，四为月，月无光，得日之光以为光，是日月交孚也，孚之正者也，故曰“月几望”。“马”者，卦体本《乾》，《乾》为马，四动成《巽》，《乾》象已失，故曰“马匹亡”。“匹”谓初，以四与初，以类相应，谓之匹。《巽》为风，马之良者，能追风，《中孚》十一月，正胡马感北风之时，是《中孚》之气候，有以感之也。《象》以“绝类上也”释“马匹亡”，“类初”也。初亦《乾》体，象马，如马之离其群匹，绝初之类而上五也。“月几望”者，无盈满之嫌，“马匹亡”者，无党同之累，夫复何咎？窃又别得一说，按马得月之精气而生，月与马自相感孚，故月马并言。“几望”者，为月盈满之时，“匹亡”者，即《传》所谓“绝类”，是马之至良至驯者也。四爻重阴得《坤》气，《坤》为月，亦为牝马，爻象兼取之，以其一气相孚也。亦足备解。",
                占:
                "【问时运】运当全盛，宜保泰持盈，去私从公，得以无咎。\n" +
                "【问营商】“月几望”，喻财利之丰盈；“马匹亡”，喻谋事之快利。吉。\n" +
                "【问功名】有春风得意之象。\n" +
                "【问战征】宜于月夜进攻，马脱蹄，兵衔枚，奋勇而上，定可获胜。\n" +
                "【问婚姻】愿望颇丰，“匹亡”者，恐不久有丧偶之灾。\n" +
                "【问疾病】三五之期不利。\n" +
                "【问家宅】此宅阴气太盛，恐同居中，难免死亡之祸。\n" +
                "【问行人】十四五可归。\n" +
                "【问六甲】生女。"
            },
            {
                原: "九五：有孚挛如，无咎。",
                象: ["有孚挛如，位正当也。"],
                析: "九五为孚之主，有孚一言，惟五足以当之。《巽》为绳，五《艮》为手，象挛，五居君位，二为臣位，五与二相应，即与二相孚。孚曰“挛如”，孚之至也。孚于臣，孚于民，亦可孚于邦，《彖》所谓“孚乃化邦”，由是而暨焉。《小畜》五爻，亦曰“有孚挛如”，《中孚》与《小畜》，同体巽顺，故同象。《象传》以“位正当”释之，谓二五之位适当，是以牵系不绝，故能有孚如此。",
                占:
                "【问时运】所谋所求，无不称心。\n" +
                "【问营商】同心协力，合伙经营，无不获利。\n" +
                "【问功名】有求必成。\n" +
                "【问战征】军心团结，戮力同心，自能制胜。\n" +
                "【问婚姻】有二人同心，百年好合之庆。\n" +
                "【问家宅】一家和乐，百室盈止。\n" +
                "【问疾病】病由肝风，致手足牵挛，带病延年，尚无咎也。\n" +
                "【问讼事】防有桎梏之灾。\n" +
                "【问六甲】生女。"
            },
            {
                原: "上九：翰音登于天，贞凶。",
                象: ["翰音登于天，何可长也。"],
                析: "鸡曰翰音，鸡必振羽而复鸣。翰，羽翮也，鸡鸣不失时，孚之象也。鸡本微物，而翰音远闻，人无实德，而有虚声者似之。上居孚极，区区小忠小信，上彻九天，虽正亦凶。《象传》释以“何可长也”，谓其绳盗虚声，何能久乎？",
                占:
                "【问时运】运途亦盛，但虚而无实，转觉可危。\n" +
                "【问营商】场面颇广，声势亦宏，有外观而无内蕴，恐其不能久也。\n" +
                "【问功名】绳盗灵声，君子所耻。\n" +
                "【问婚姻】恐难偕老。\n" +
                "【问家宅】此宅有牝鸡司晨之象，家业难保，凶。\n" +
                "【问疾病】肝风作痛，喊叫声声，病状颇苦，凶。\n" +
                "【问讼事】势将上控，凶。\n" +
                "【问六甲】生女，小儿善啼，恐难育。"
            },
        ]
    },
    {
        x:"001100",//小过
        e:{
            原: "小过：亨利贞，可小事，不可大事。飞鸟遗之音，不宜上，宜下，大吉。",
            象: ["山上有雷，小过。君子以行过乎恭，丧过乎哀，用过乎俭。"],
            彖: ["小过，小者过而亨也。过以利贞，与时行也。柔得中，是以小事吉也。刚失位而不中，是以不可大事也。有飞鸟之象焉，飞鸟遗之音，不宜上，宜下，大吉，上逆而下顺也。"],
            析: "为卦二阳在内，四阴在外，阴为小，谓之小，阴过于阳，谓之过。卦体《震》上《艮》下，《震》动也，《艮》止也，动止宜得其中，若过动过止，皆谓之过。《震》为雷，《艮》为山，若雷过猛，山过险，亦谓之过。以其所过，皆在小事，此卦所以名《小过》也。\n" +
            "通观此卦，《大过》自《颐》来，口腹之养过度，则有死丧，《小过》自《中孚》来，性情失常，则有灾眚。故《小过》之内，互为《大过》，不中不信，动而不止，必同至灭亡。《彖》曰“亨”者，谓人宜收敛改悔，则自亨通，使亦如《大过》之“不惧”“无闷”，其咎反甚于《大过》。何则？《大过》有阳刚之才，而《小过》阴柔，飞扬躁扰，尤所深忌也。卦之取象于飞鸟者，亦由《中孚》上爻“翰音登于天”来也，故卦体中，二奇象鸟身，上下四偶象鸟翼。《艮》欲止而《震》欲动，四阴用事，二阳迫处凶惧之地，任阴所往，不能自止，如鸟之振翼高飞，身不自主，翼飞愈远，身愈不安，哀鸣疾呼，求援不得，所谓飞鸟遗音是也。故《小过》之时，下止则吉，上动则凶，所谓“不宜上，宜下”是也。六爻皆取鸟象；初上在外，为翼为翰皆凶；二五为翼，二无咎，下也，五虽中无功，上也；三四为身，三《艮》止之主，不能止而上应，故凶，四《震》之主，虽动而下应，故无咎。是以《传》所谓“上逆而下顺”者，道由是焉。",
            占:
            "【问时运】运途清高，有不屑于同污流俗之概。\n" +
            "【问营商】因一时价值过高，不合时宜，买卖均难。\n" +
            "【问功名】以其不谐时俗，反为人忌。\n" +
            "【问战征】屯营山上，地位过高，进退俱难。\n" +
            "【问婚姻】想是老夫女妻，年岁相去过远。\n" +
            "【问家宅】此宅想在高山。\n" +
            "【问疾病】是过寒过热之症，须调剂得中。\n" +
            "【问六甲】生男。"
        },
        ye:[
            {
                原: "初六：飞鸟以凶",
                象: ["飞鸟以凶，不可如何也。"],
                析: "“以”者，即左右之曰以是也。鸟以翼而飞，初与上，象取两翼，故皆言“飞鸟”。《小过》“不宜上，宜下”，初在下，更不宜上，飞则振冀直上，欲下不能，其凶可知也，故曰“飞鸟以凶”。初居《艮》止之始，本无飞象，初与上相终始，上居《震》动之终，上之鸟，动而思飞。初上分为两翼，一翼飞，一翼不能独止，故飞则俱飞，凶亦俱凶。《象传》释以“不可如何”，谓“上逆而下顺”，初在下，乃不顺下而逆上，是自取其凶也，亦无可如何耳。",
                占:
                "【问时运】不安本分，妄思风腾上进，凶。\n" +
                "【问营商】力小而图大，位卑而谋高，不自量力，必致败也。\n" +
                "【问功名】宜卑小自安。\n" +
                "【问战征】初在《艮》下，宜按兵不动。\n" +
                "【问婚姻】宜门户相当，不宜攀结高亲。\n" +
                "【问家宅】屋宇以低小为宜。\n" +
                "【问疾病】神魂飞越，凶。\n" +
                "【问六甲】生男。"
            },
            {
                原: "六二：过其祖，遇其妣。不及其君，遇其臣，无咎。",
                象: ["不及其君，臣不可过也。"],
                析: "《易》例，阴阳相应，为君臣，为夫妇，取其配偶；无应者，或为父子，或为等夷，或为嫡媵，或为妣妇，取其同类。五为父母之位，亦为祖妣之位，阳爻为父为祖，阴爻为母为祖妣。五为父母，则必以二为子；五为祖妣，则必以二为孙。今二五皆阴，而不相应，有妣妇之配，故曰“过其祖，遇其妣”。常例五为君，此卦君当谓上，五则臣也，故臣谓二五。过四而与五遇，则止于五而不上，故曰“不及其君，遇其臣”。可过而过，不及而不过，为能得经权之中，无过不及之偏，故“无咎”。且二五以柔相亲，五尊二卑，卑之于尊，弗过则可承其礼遇，过则有逾越之嫌，故五视上虽为臣，而二不可遇也，不可遇，则二于上，但觉庙高堂远，瞻仰弗及矣。不可过而不过，安于“宜下”，夫复何咎？此《小过》之最善者也。《象传》之所释者以此。",
                占:
                "【问时运】运途平顺，不得其全，犹得其半，亦可无咎矣。\n" +
                "【问营商】贸资以往，虽未得满载而归，亦足称十得其五矣。\n" +
                "【问功名】不得其上，已获其中。\n" +
                "【问战征】已得斩其将，拔其旗，夫复何咎？\n" +
                "【问疾病】药力未到。\n" +
                "【问婚姻】恐非正配。\n" +
                "【问家宅】宅神不安。\n" +
                "【问六甲】生男。"
            },
            {
                原: "九三：弗过防之，从或戕之，凶。",
                象: ["从或戕之，凶如何也。"],
                析: "三处下卦之上，重刚不中，《彖》所谓“不可大事”者，三四当之。且三为多凶之地，过将焉往？故爻曰“弗过”。卦体刚阳，一画横亘其中，有防之象，《艮》，止也，有防之义。防者，止其过也，止其过，即当“弗过”。上互《兑》，《兑》为金刀，有戕之象，三窬防而过，或有从而戕之者矣。“或”虽为未然之事，而其势已岌岌可危，故“凶”。《象传》曰“凶如何也”；谓纯刚既足召祸，强进更必致灾，凶由自取，无如何也。",
                占:
                "【问时运】运途不正，谨慎自防，尚可免祸。\n" +
                "【问营商】贩运出外，防遇盗劫之凶，宜勿前进。\n" +
                "【问功名】切弗往求，求则有祸。\n" +
                "【问婚姻】非婚媾，则寇雠也，宜防。\n" +
                "【问家宅】有凶祸临门，宜谨防之。\n" +
                "【问疾病】防是刀伤，凶。\n" +
                "【问失物】不必追寻，方可免灾。\n" +
                "【问讼事】防干大辟。\n" +
                "【问六甲】生男，难育。"
            },
            {
                原: "九四：无咎。弗过遇之，往厉必戒，勿用永贞。",
                象: ["弗过遇之，位不当也。往厉，必戒，终不可长也。"],
                析: "四亦阳刚不中，四处外卦之下，以刚居柔，非若三之重刚在上也，故“无咎”。“弗过遇之”，遇者不期而遇者也。《小过》“不宜上，宜下”，不可前往，往则有危，故曰“往厉必戒”，所以戒其妄动也。《彖》曰“过以利贞，与时行也”，时当夫动，以动为贞，时当夫上，以止为贞，贞在随时，不在固守，故曰“勿用永贞”。《象传》以“位不当”释“弗过遇之”，谓以阳居阴，刚而失位，示弗过五也。以“终不可长”释“往厉，必戒”，谓往则有危，不可长守其正也。此爻九家《易》谓，四进则遇五，不复过，于卦象最合。汉人言象，固有至当不易者。",
                占:
                "【问时运】运以当可之谓时，勿宜妄动轻进。\n" +
                "【问营商】得可而止，切勿过贪。\n" +
                "【问功名】不求躁进，自得巷遇之庆，若妄动希荣，恐反遭祸。\n" +
                "【问战征】四刚而失位，宜勿进攻，乃可无咎。\n" +
                "【问婚姻】自有良缘，得时则遇，宜勿急急媒聘。\n" +
                "【问家宅】安居为宜，无用迁移。\n" +
                "【问六甲】生男。"
            },
            {
                原: "六五：密云不雨，自我西郊，公弋取彼在穴。",
                象: ["密云不雨，已上也。"],
                析: "“密云不雨”，与《小畜》《彖》辞同，言其不能济大事，即《彖》辞所云“不可大事”之义也。六五以阴居尊，阴之盛也，阴盛则有云雨之象。五互《兑》为密，故曰“密云”；《兑》又属西，故曰“西郊”；上《震》下《艮》，《震》动而《艮》止之，故曰“不雨”。盖《小过》盛阴在外，阳气伏藏，是以密云而不雨也。云之占自东而西则雨，自西而东则不雨，故曰“自我西郊”。《易》例，大事称王，小事称公，《小过》“可小事，不可大事”，故曰“公”“穴”。卦自《坎》来，《坎》为隐伏，穴之象，《坎》又为弓，为弧，弋之象。弋所以取飞鸟也，故曰“公弋取彼在穴”。“密云不雨”，是“不可大事”也；弋取在穴，是“可小事”也。“不宜上”，故云在上而不雨，宜于下，故穴在下而可弋。五为卦主，故《彖》之旨，皆于五发之。《象传》曰“已上也”，亦即以释《彖》“不宜上”之意也。",
                占:
                "【问时运】运途平平，难成大事，只可小受。\n" +
                "【问营商】小利可占。\n" +
                "【问功名】伏处山林，当有弓旌下逮。\n" +
                "【问战征】敌于山穴中，设有埋伏，宜先攻取之。\n" +
                "【问婚姻】是钻穴隙以相从者，非正娶也。\n" +
                "【问天时】大旱。\n" +
                "【问失物】当就穴地中觅之。\n" +
                "【问疾病】宜用针刺之法治之。\n" +
                "【问六甲】生男。"
            },
            {
                原: "上六：弗遇过之，飞鸟离之，凶，是谓灾眚。",
                象: ["弗遇过之，已亢也。"],
                析: "上爻重阴不中，居全卦之极，上与初为终始，故初曰“飞鸟”，上亦曰“飞鸟”。四曰“弗过遇之”，上曰“弗遇过之”，其义大反。“弗过”者，谓弗过于五，而自得所遇，遇则无咎也；“弗遇”者，谓不过于五，而复欲遇之，遇则必凶也。位处卦外，象为鸟翼，与初并飞，初当始飞，已知其凶，上则其飞己极，故凶尤甚。罗网高张，欲脱不得，《诗》所咏“鱼网之设，鸿则离之”是也。以亢致灾，违“不宜上”之戒也，故《象传》即以“亢”释之。",
                占:
                "【问时运】高而愈危，进而愈厉，不知退守，凶由自取也。\n" +
                "【问功名】躁进取祸。\n" +
                "【问营商】既不遇时，又复妄进，必致取败。\n" +
                "【问战征】凡行军前进，不遇敌兵，知敌军必于暗地设伏，宜即退军，否则必陷险难。\n" +
                "【问婚姻】防坠奸媒之计。\n" +
                "【问六甲】生男。"
            },
        ]
    },
    {
        x:"101010",//既济
        e:{
            原: "既济：亨小，利贞，初吉终乱。",
            象: ["水在火上，既济。君子以思患而豫防之。"],
            彖: ["既济亨，小者亨也。利贞，刚柔正而位当也。初吉，柔得中也。终止则乱，其道穷也。"],
            析: "卦本地天《泰》，《泰》交故水火济。水在地中，未升于器，火在木中，尚丽于空，卦取润下者加诸火上，取炎上者搐诸水下，是谓《既济》。此卦所以名水火《既济》也。\n" +
            "通观此卦，《易》六十四卦，首《乾》《坤》，《上经》三十卦，终《坎》《离》，以其为天地之终也；《下经》三十四卦，终《既济》《未济》，以其为《坎》《离》之交也。天下之事，《未济》则忧其不济，《既济》则宜图其永济，然无终不初，无往不来，一治一乱者，天也，一阴一阳者，道也，天无无阴之阳，世无不乱之治。今以爻观，六位得所，未有如《既济》者，奇偶各三，其数均也；以阴居阴，以阳居阳，其位当也；六爻上下，刚柔相配，其应正也。《乾》《坤》以来，三百七十二爻，循环往复，变化交错，而后得《既济》。《离》明在内，坎险在外，明以消险，以开济世成功之会，由此而慎始图终，有治无乱，固万世人民之幸福也。然乱极思治，治极思乱，天运剥复，卦象已示其机矣。下《离》而互《坎》，上《坎》而互《离》，反复之象也。以阴而乘阳，初治而终止，盛衰之兆也，故《彖》曰“终止则乱”。可知造化之数，不能长治久安者，非人力之强排，可以终济也。又以图数推之，初刚，二柔，三刚，四柔，五刚，六柔，与天一，地二，天三，地四，天五，地六，其数正合，然至六而止，是亦天地无完数也，所以《未济》方来，皆自然之法象。故众人以《既济》为喜，圣人以《既济》为忧，何者？未治易治，既治难保。六爻之孜孜以保济者，各有次序焉：初为济之始，力求其济者也；二得济之中，不失其济者也；三涉济之险，言其济之甚难也；四处济之时，惧其济而复失也；五受济之福，喜其济之合时也；六当济之极，虑其济之不可久也。凡卦皆至终而穷，《既济》之终，则为《未济》，六十四卦穷于《未济》。《既济》变而为《未济》，岂但《既济》之穷而已哉！则“初吉”其可恃乎哉？",
            占:
            "【问时运】运途全盛，盛极必衰，须防后患。\n" +
            "【问营商】目下货物，得时得价，正当满足，须留后步。\n" +
            "【问功名】居高思危，得防其终。\n" +
            "【问战征】大难既平，大险既定，战胜功成，还宜图始保终，毋贻后患。\n" +
            "【问家宅】大厦既成，苟完苟合，贻谋孔远。\n" +
            "【问婚姻】有好合百年之兆。\n" +
            "【问疾病】大病既痊，更宜自保。\n" +
            "【问讼事】毋再涉讼。\n" +
            "【问六甲】春夏生女，秋冬生男。"
        },
        ye:[
            {
                原: "初九：曳其轮，濡其尾，无咎。",
                象: ["曳其轮，义无咎也。"],
                析: "《既济》爻义，大略与《泰》同。《泰》下卦三爻，为《泰》中之《泰》，上卦三爻，为《泰》中之《否》，《既济》亦然。其所以分内外者，《离》为明，《坎》为险，犹《泰》以《乾》为有余，《坤》为不足也。《既济》初爻，以济渡取义，故有曳轮濡尾之象，《坎》为轮，为曳，初为尾。“曳其轮”者，曳之前进，是用力而求济也。按《诗》“济盈不濡轨，始济而濡及马尾”，言济之难也，然尾虽濡而曳不倦，曳者济矣。初居济之始，力求其济如此，故“无咎”也，《象传》即以无咎释之。",
                占:
                "【问时运】运未脱险，当自奋勉，可以无咎。\n" +
                "【问营商】初次经营，跋涉多艰，前而不止，虽危得济，无咎。\n" +
                "【问功名】先难后获。\n" +
                "【问战征】虽有车脱马蹶之危，一鼓而进，当必可获胜也。\n" +
                "【问家宅】初次迁居，虽此宅或轮奂不美，或首尾不完，居之无咎。\n" +
                "【问婚姻】火为水妃，初聘则吉。\n" +
                "【问疾病】初病，虽危无咎。\n" +
                "【问六甲】初胎生女。\n" +
                "【问失物】物已沾水，当就车中觅之，可得。\n" +
                "【问行人】在途，稍有水灾，无咎。"
            },
            {
                原: "六二：妇丧其茀，勿逐，七日得。",
                象: ["七日得，以中道也。"],
                析: "火为水妃，故二《离》象妇。“茀”，车蔽也。《尔雅》“舆革，前谓之艰，后谓之茀；竹，前谓之御，后谓之蔽”，曰“弗”，曰“蔽”，以竹革而异也。《诗》则统谓之茀，“硕人翟茀以朝”。《孔疏》云：妇人乘车不露，车之前后，皆设障以自隐蔽，谓之茀，丧弗者，失其所蔽也。二当临济之时，驱车前进，车在前，弗在后，中途丧弗，停车而逐，将有欲济而不及者矣，故示之以“勿逐”。“七日得”者，得犹复也。阴阳之数，至七而复，一卦六爻，循环往复，自二后至七，又值二爻，故不过七日而自得也。《象传》以“中道”释之，日辰十二，七日正当中也。丧茀者，或云二乘车适五，四当其前，四《坎》为盗，是窃茀者也。其说亦通。茀，《释文》：茀首饰。按《诗》屡言茀，皆作车蔽，且初曰曳轮，二日车茀，象正相合，当作车蔽。",
                占:
                "【问时运】小小得失，切勿介意，方得脱大难，成大功也。\n" +
                "【问营商】有失而复得之象。\n" +
                "【问功名】七年内，定可复职。\n" +
                "【问战征】中途被劫，丧其辎重，七日内，必获胜仗。\n" +
                "【问婚姻】早则七月，迟则七年，可复团聚。\n" +
                "【问家宅】其宅被人居，七年后，即可归还原主。\n" +
                "【问疾病】七日必愈。\n" +
                "【问失物】不久可得。\n" +
                "【问六甲】七日内可产，生女。"
            },
            {
                原: "九三：高宗伐鬼方，三年克之，小人勿用。",
                象: ["三年克之，惫也。"],
                析: "“高宗”，殷中兴之主；“鬼方”，西羌国名。按《竹书纪年》，武丁三十二年伐鬼方，次于荆，三十四年，克鬼方，氏羌来宾，即“高宗伐鬼方，三年克之”，实事也。《既济》爻象，初二皆在济中，至三始济，故取三年克鬼方以为况。高宗贤主，鬼方小国，六师所加，三年乃克，师亦惫矣，以喻济《坎》之难如此。天下之事，每以艰难得之，安乐失之，当其始，数载经营而不足，其后一旦败坏而有余；而其弊皆由于远君子而近小人也，故戒曰“勿用小人”，处《既济》者，所当凛凛焉。《师》上爻曰，“开国承家，小人勿用”，与此爻辞，意正同。" ,
                占:
                "【问时运】忍苦耐劳，所谋必成。\n" +
                "【问营商】数载经营，方可获利。\n" +
                "【问功名】辛苦而成。\n" +
                "【问战征】劳师久征，所攻虽得，然亦惫矣。\n" +
                "【问婚姻】三年内可完配。\n" +
                "【问家宅】此宅阴象太重，三年后，方可居住。\n" +
                "【问疾病】此病一时无恙，三年内，必难保全。\n" +
                "【问讼事】三年可了，防小人又复生事，宜戒。\n" +
                "【问六甲】生女。"
            },
            {
                原: "六四：繻有衣袽，终日戒。",
                象: ["终日戒，有所疑也。"],
                析: "按：“繻”为采绘，“袽”为敝衣。四处内外卦之交，出《离》入坎，繻有文明之象，盖取诸《离》；袽为败衣，《坎》为破，盖取诸《坎》。言四当《既济》之盛，衣冠济济，文物声名，焕然一新，然天命靡常，盛倏为衰，新倏成故，若不因时弥缝，曾不几时，立成败坏，犹是绘采之华裳，未几而为敝败之残絮矣，故曰“繻有衣袽。”《既济》，由《乾》《坤》二五相易而来，“终日戒”者，即《乾》“终日乾乾，夕惕若”之意，当《既济》而益励危心，其戒慎无已时也，故曰“终日戒”。《传》释以“有所疑”，《坎》为疑，疑者，未然而忧其或然，亦戒也。“繻”，王弼谓宜作濡，衣袽谓以敝衣塞舟漏也。王弼之解，强从济字取义，谓济必有舟，舟或有漏则濡，濡则敝衣塞之。于爻辞“繻有衣袽”一语，添生枝节，自圆其说，未免矫强。" ,
                占:
                "【问时运】运当全盛，然不预防，衰即立至，所宜谨戒。\n" +
                "【问营商】如舟行，中流舟漏，急宜补修。\n" +
                "【问功名】有忽赐忽褫之惧。\n" +
                "【问战征】夺帜易帜，胜当虑败，所贵临事而惧。\n" +
                "【问婚姻】古人多以衣服比夫妇，为不可喜新而弃旧也。\n" +
                "【问疾病】是老弱之症也。\n" +
                "【问六甲】生男。"
            },
            {
                原: "九五：东邻杀牛，不如西邻之禴祭，实受其福。",
                象: ["东邻杀牛，不如西邻之时也；实受其福，吉大来也。"],
                析: "五与二相应，犹东与西相对，五为君，二为臣。东邻为君，是纣之国中，西邻为臣，是文王之国中也。按纣都在东，岐周在西，东邻西邻，郑谓殷周是也。《离》为牛，《坎》为豕，杀牛而凶，不如杀豕受福，喻言奢而慢，不如俭而敬也。上卦处《既济》之后，下卦当甫济之时，殷天子祭用太牢，故杀牛；周西伯不得用牛，用豕，故为禴。当时殷道已衰，时为《既济》；周德方新，时为甫济。《既济》者，时已去，甫济者，时方来。已去不复也，方来者未有已也，则杀牛不足侈，而禴祭大可恃，故曰“东邻杀牛，不如西邻之禴祭，实受其福”。九五阳爻，阳为实，五体《乾》，《乾》为福，《象传》以“吉大来”释之。《泰》曰“小往大来，吉亨”，自外而内曰来，卦以二五相易，为《乾》成《泰》，谓福自《乾》来也。" ,
                占:
                "【问时运】已盛则退，方盛则进，宜保俭约，毋侈奢华，吉凶皆由自取也。\n" +
                "【问战征】盛气在西，宜顺天修德，不宜暴兵耀武。\n" +
                "【问营商】合伙同业，殷富者亦奢，不如俭约者，实获其利也。\n" +
                "【问功名】已成者宜慎，未成者大可望也。\n" +
                "【问婚姻】宜就西邻订姻，吉。\n" +
                "【问家宅】宅以西首为吉。\n" +
                "【问疾病】宜祷。\n" +
                "【问六甲】生男。"
            },
            {
                原: "上六：濡其首，厉。",
                象: ["濡其首，厉，何可久也。"],
                析: "上为首，初为尾，是首尾相接也。上处《既济》之极，反之即《未济》，已然者甫能过，未然时相待，进而不已，身虽未溺，首先犯焉，故曰“濡其首”。夏殷之盛，未几而坏于桀纣，文武之兴，未几而降为幽厉，所谓治日少而乱日多者，古今有同慨焉，故曰“厉”。《象传》曰“何可久”，所以戒之者深矣。" ,
                占:
                "【问时运】好运已过，深为可危，宜慎。\n" +
                "【问战征】上处坎险之极，上为首，恐首将有不利。\n" +
                "【问营商】头番买卖，必难获利。\n" +
                "【问功名】可许夺元。\n" +
                "【问婚姻】元配有灾，续弦无咎。\n" +
                "【问家宅】此宅长房不利。\n" +
                "【问讼事】防首领难保。\n" +
                "【问疾病】患在首面，可危。\n" +
                "【问六甲】生男。"
            }
        ]
    },
    {
        x:"010101",//未济
        e:{
            原: "未济：亨，小狐汔济，濡其尾，无攸利。",
            象: ["火在水上，未济。君子以慎辨物居方。"],
            彖: ["未济，亨，柔得中也。小狐汔济，未出中也。濡其尾，无攸利，不续终也。虽不当位；刚柔应也。"],
            析: "《未济》反《既济》，以《既济》之上卦，反而居下，《既济》之下卦，反而居上。火与水相背不交，是炎上者未能成其炎，润下者未能致其润，此卦所以名火水《未济》也。\n" +
            "通观此卦，《既济》者功已毕，《未济》者事复始，终而复始，有生生之义焉。“生生之谓《易》”，《易》所以终于《未济》也。《既济》者水在上，势欲下，火在下，势欲上，二气参和，交致其用；《未济》反是，炎上者上升，流下者反下，分背不交，不相为用。致用则其用已成，不相为用，而其用正有待也，此即五德相乘，四时递嬗，无绝不续之运会也。《坎》《离》之既《未济》，犹《乾》《坤》之《泰》《否》，《泰》极则《否》，《既济》而后《未济》，其象同焉。为卦下三爻为《未济》中之《未济》，上三爻则为《未济》中之《既济》，由未而既，故爻象视《既济》为吉，卦体《坎》上《离》下，《离》为日，《坎》为夜，《离》明《坎》暗，《离》虚《坎》实，德莫大于明，道莫神于虚，故《坎》降而《离》升，《坎》隐在内，《离》明在外，日丽天上，水行地下，《乾》《坤》正位，法象之自然也。圣人于此，当其既济，不忘未济之念，当其未济，倍切既济之图，业必慎于创始，功不隳于垂成，俾天运得以永贞，治道得以久安，岂不甚愿？无如阴阳倒置，爻位失当，《坎》《离》各安其宅，水火互藏其用，卦所以为《未济》也。在六爻，位皆不当，而刚柔则各相应也。初濡尾，无济之具也；二曳轮，得济之具也；三涉川，以躁动而凶也。内卦三爻，皆为欲济而犹未济者也。四“有赏”，以《震》伐而行志也；五辉光，以“有孚”而获吉也；上濡首，以饮食而失节也。外卦三爻，皆进《未济》而为《既济》者也。爻以二五为正应，故皆曰“贞吉”；初与四虽应，初当济之始，四得济之中，故初不如四吉；三与上皆处极位，三以《未济》而失利，上以《既济》而失节，故皆示以为戒，戒之正，所以保其终也。《易》之道以不终为终，乃无终而非始，故《乾》曰“无首”，《坤》曰“大终”。六十四卦，不终于《既济》，而终于《未济》，为《既济》者已尽，《未济》者无穷，以既启未，以未续既，《乾》《坤》之大用，即在《坎》《离》之相续也。",
            占:
            "【问时运】运途颠倒，诸事须慎。\n" +
            "【问营商】货物失当，地位不合，所当谨慎处置，方可获利。\n" +
            "【问功名】未也。\n" +
            "【问战征】营垒器具，各失所宜，不相为用，急宜慎重审察，斯可免败。\n" +
            "【问家宅】方向倒置，须当改易。\n" +
            "【问婚姻】门户不合。\n" +
            "【问疾病】上下焦血络不通，宜升不升，宜降不降，药方最宜审慎。\n" +
            "【问失物】辨明方位，可以寻得。\n" +
            "【问六甲】上月生女，下月生男。"
        },
        ye:[
            {
                原: "初六：濡其尾，吝。",
                象: ["濡其尾，亦不知极也。"],
                析: "初居《未济》之始，《彖》所云“小狐汔济，濡其尾”，初爻当之。《未济》之初，与《既济》之上，首尾相接，《既济》之上，以濡首而厉，初踵其后，见上之濡首，反而自惩，未济者亦可免于濡矣，乃前首后尾，同遭其濡，顽不知戒，故曰“吝”也。《象传》以“亦不知极”释之，谓前覆其辙，后又不知而蹈之，故曰亦术知其极也。" ,
                占:
                "【问时运】不审前后，不顾进退，鲁莽从事，是昏而无知者也。\n" +
                "【问营商】前既失败，后又不戒，覆辙相仍，其将何以了事乎？\n" +
                "【问功名】龙头既失，骥尾亦必难附。\n" +
                "【问婚姻】流离首尾，团聚难矣。\n" +
                "【问家宅】此宅前门后户，方位不正。\n" +
                "【问疾病】病在下身。\n" +
                "【问六甲】生男。"
            },
            {
                原: "九二：曳其轮，贞吉。",
                象: ["九二贞吉，中以行正也。"],
                析: "二居《坎》之中，《坎》为轮，故曰“轮”。轮者，济之具也。《既济》初爻曰曳轮而濡尾，有济之具而濡者也；此曰曳轮，而不曰濡尾，有济之具而不濡者也，视《既济》之初为优矣，故曰“贞吉”。《坎》又为矫輮，按《周礼·考工记》，“行泽者反輮，行山者仄輮”，取其便于曳也。御轮济水，中道而行，其济以正，是为中行以正，吉何如之！《象传》所释，最为明著。" ,
                占:
                "【问时运】运如轻车渡水，中道以济，无往不利。\n" +
                "【问营商】有满载而归之象。\n" +
                "【问功名】二与五应，五为君，二为臣，二五皆吉，是君臣相济也。有后车以载之象。\n" +
                "【问战征】有曳柴伪遁之谋。\n" +
                "【问婚姻】有桓少君鹿车共挽之风，必得贤妇，吉。\n" +
                "【问家宅】有轮奂并美之象。\n" +
                "【问疾病】必是胸腹作鸣，辘辘如车声，宜开通三焦，使气机舒展，自愈。\n" +
                "【问六甲】生男。"
            },
            {
                原: "六三：未济，征凶，利涉大川。",
                象: ["未济，征凶，利涉大川，位不当也。"],
                析: "三爻以阴居阳，当内外卦之交，首尾俱不着岸，故爻曰“未济”。专以卦名归之，谓《未济》之所以未济者，在此爻也。三为《坎》之，地当重要，进一步则出险，误一步即履危，鲁莽前进，一经失足，功败垂成，故曰“征凶”。然《未济》有可济之道，有险有出险之时，自古定大难，建大功者，罔非从“征凶”之时而兴起也。所谓“征凶”者，第戒其不可妄动，非欲其退缩不前。三之地，正当利涉之地，三之时，正当利涉之时，此而不济，则终不济矣，此而得济，则汔济者乃得济矣。《象传》曰“位不当也”，《未济》六爻，位皆不当，三为《坎》之终，故《传》专以不当释之。" ,
                占:
                "【问时运】宜镇静待时，躁动则凶。\n" +
                "【问战征】宜会集海军，水陆并进，则凶者吉矣。\n" +
                "【问营商】以舟运为利。\n" +
                "【问功名】有涉川作楫之材。\n" +
                "【问婚姻】《诗》云“造舟为梁，亲迎于渭”，迎娶则吉，往赘则凶。\n" +
                "【问疾病】《艮》为狐，病由狐祟所致，宜涉川以避。\n" +
                "【问六甲】生男。"
            },
            {
                原: "九四：贞吉，悔亡。震用伐鬼方，三年有赏于大国。",
                象: ["贞吉，悔亡，志行也。"],
                析: "《未济》济在四，《既济》济在三，《未济》之四，即《既济》之三，故爻辞皆曰“伐鬼方”。三居《离》之始，《离》为戈兵，故“用伐”。《坎》为鬼，故取象于“鬼方”。“震”者，威怒之象，所谓一怒而安天下之民也。《未济》则有悔，济则悔亡。故曰“贞吉，悔亡”。“三年”者，言其久也，即《既济》三爻所云“三年克之”也。“有赏”者，为献俘授馘饮，至大赏是也。“大国”谓殷，爻虽不明言高宗，要不出《既济》三爻之义也。《象传》曰“志行”，谓班师奏凯，威震遐方，主三军者，得行其志矣。《既济》三爻《传》曰“惫也”，为劳师远征而言；此《传》曰“志行”，为振旅告捷而言。" ,
                占:
                "【问时运】有此大运，“贞吉，悔亡”，名利俱全。\n" +
                "【问战征】率军远征，奏凯而还，得以荣邀赐命。\n" +
                "【问营商】行商远出，财利丰盈。\n" +
                "【问功名】声名远震，得承天宠。\n" +
                "【问婚姻】三年可成。\n" +
                "【问家宅】贞吉。\n" +
                "【问疾病】“鬼方”二字不祥，三年后恐难保。\n" +
                "【问六甲】生女。"
            },
            {
                原: "六五：贞吉，无悔。君子之光，有孚吉。",
                象: ["君子之光，其晖吉也。"],
                析: "五为《未济》一卦之主，居《离》之中，与四相比，与二相应。二以居中行正，四以征伐有功，当此文德昭明，武功显著；臣下之勋业，要即为天子之威光也，故曰“君子之光”。柔得中，故“贞吉，无悔”。《离》为明，为光，德莫盛于明，业莫大于光，六五之君，和顺积中，英华发外，其光皆出于君子之身，天下莫不仰文明之化，故曰“有孚，吉”。《象传》以“晖吉”释之，谓其笃实辉光，自然昭著，吉何如也！",
                占:
                "【问时运】运当全盛，百事皆吉。\n" +
                "【问战征】《师》卦曰“师贞，丈人吉”，可并占之。\n" +
                "【问营商】其营业必关系政府公干，或为军饷，或为军器，得沾朝廷之余泽，故吉。\n" +
                "【问功名】有入觐天颜之象。\n" +
                "【问家宅】此宅大吉，当邀旌赐之劳。\n" +
                "【问婚姻】“君子好逑”，必得。\n" +
                "【问六甲】生女，主贵。"
            },
            {
                原: "上九：有孚于饮酒，无咎。濡其首，有孚失是。",
                象: ["饮酒，濡首，亦不知节也。"],
                析: "上爻当《未济》之终，反为《既济》，坎险已脱，上下交孚，则饮食以燕乐之。《诗》“南有嘉鱼，君子有酒，嘉宾式燕以乐”，《序》曰太平君子至诚。乐与贤者共之，有孚于酒食之义也，故“无咎”。然酒以成礼，不及于乱，立监立史，所以示其节也，“濡其首”，则醉而不出，是谓伐德，亦何取于孚矣，故曰“有孚失是”。是始为有孚而饮酒者，继反为饮酒而失孚也，《象传》以“不知节”释之。《易》之为书，患太过，更甚于防不及，欲不可纵，乐不可极，持盈保泰，无非节也。此特于《未济》之终，借饮酒以为喻耳。",
                占:
                "【问时运】《坎》难已平，众心欢乐，能知撙节，可以永保无咎。\n" +
                "【问战征】此为得胜班师，饮酒策勋之时也。\n" +
                "【问营商】已得厚利而归，从此量入为出，富可永保矣。\n" +
                "【问功名】有得而复失之患。\n" +
                "【问疾病】必是饮食不节所致。\n" +
                "【问讼事】《序卦》曰“饮食必有讼”，知其讼必由于酗酒来也。\n" +
                "【问六甲】生女。"
            }
        ]
    }
]